{
    "1-ne": {
        "meta": {
            "slug": "1-ne",
            "name": "Llyfr Cyntaf Nephi.",
            "chapterWord": "Pennod Ⅰ."
        },
        "chapters": {
            "1": {
                "intro": "Hanes Lehi a’i wraig Sariah, a’i bedward mab, y rhai a elwid (gan ddechreu ar yr hynaf), Laman, Lemuel, Sam, a Nephi. Mae yr Arglwydd yn rhybyddio Lehi i ymadael o wlad Jerusalem, o herwydd ei fod yn prophwydo wrth y bobl ynghylch eu drygioni; a cheisiant ddyfetha ei fywyd ef. Cymmera daith tri diwrnod i’r anialwch gyda’i deulu. Y mae Nephi yn cymmeryd ei frodyr ac yn dychwelyd i wlad Jerusalem i ymofyn cof-lyfr yr Iuddewon. Hanes eu dyoddefiadau. Cymmerant ferched Ishmael yn wragedd. Cymmerant eu teuluoedd ac ymadawant i’r anialwch. Eu dyoddefiadau a’u cystuddiau yn yr aniolwch. Helynt eu teithiau. Eu dyfodiad at y dyfroedd mawrion. Brodyr Nephi yn gwrthryfela yn ei erbyn. Mae efe yn eu drysu hwynt, ac yn adeiladu llong. Galwasant y lle yn Llawnder. Y meant yn croesi y dyfroedd mawrion i’r tir addawedig, gc. Mae hyn yn ol hanes Nephi, neu, mewn geiriau ereill, myfi, Nephi, a gsgrifenodd y cof-lyfr hwn.",
                "0": "A bu ddarfod i mi a’m tad, hyd yma, gadw y gorchymynion a orchymynwyd i ni gan yr Arglwydd. Ac yr oeddem wedi cael y cof-lyfrau a orchymynodd yr Arglwydd i ni, ac wedi eu chwilio a chael allan eu bod yn ddymunol; ïe, o werth mawr i ni, yn gymmaint ag y gallem gadw gorchymynion yr Arglwydd i’n plant. Am hyny, yr oedd yn ddoethineb yn yr Arglwydd fod i ni eu cario hwynt gyda ni, tra y teithiem yn yr anialwch tua gwlad yr addewid."
            },
            "2": {
                "0": "Er hyny, yr wyf wedi derbyn gorchymyn oddiwrth yr Arglwydd, fod i mi wneuthur y llafnau hyn i’r dyben neillduol o fod hanes yn cael ei gerfio am weinidogaeth fy mhobl. Ar y llafnau ereill y dylid cerfio hanes teyrnasiad y breninoedd, a rhyfeloedd ac ymrafaelion fy mhobl; gan hyny mae y llafnau hyn, y rhan fwyaf, at y weinidogaeth; a’r llafnau ereill, y rhan fwyaf, at deyrnasiad y breninoedd, a’r rhyfeloedd, ac ymrafaelion fy mhobl.—Gan hyny, mae yr Arglwydd wedi gorchymyn i mi wneuthur y llafnau hyn i ryw ddyben doeth ynddo ef; yr hwn ddyben ni wn i. Eithr y mae yr Arglwydd yn gwybod pob peth o’r dechreuad; gan hyny y mae efe yn parotoi ffordd i gyflawni ei holl weithredoedd yn mhlith plant dynion; canys, wele, y mae ganddo bob gallu hyd at gyflawniad ei eiriau oll. Ac felly y mae. Amen."
            },
            "3": {
                "0": "A myfi, Nephi, a glywais, ac yr wyf yn dwyn tystiolaeth, mai enw apostol yr Oen yw Ioan, yn ol gair yr angel. Ac, wele, yr wyf fi, Nephi, yn cale fy ngwahardd i ysgrifenu gweddill y pethau a welais ac a giywais; am hyny digon i mi yw y pethau a ysgrifenais; ac ni ysgrifenais ond rhan fechan o’r hyn a welais. Ac yr wyf yn dwyn tystiolaeth, i mi weled y pethau a welodd fy nhad, ac angel yr Arglwydd a’u gwnaeth hwynt yn adnabyddus i mi. Ac yn awr yr wyf yn gwneuthur diwedd ar lefaru ynghylch y pethau a welais, pan y cymmerwyd fi ymaith yn yr ysbryd: ac os nad yw yr holl bethau a welais wedi eu hysgrifenu, y mae y pethau a ysgrifenais yn wirionedd. Ac felly y mae. Amen."
            },
            "4": {
                "0": "A hwy a ddywedasant wrthyf, A yw y peth hwn yn meddwi poenedigaeth y corff yn nyddiau prawf, neu a yw yn meddwi sefyllfa olaf yr enaid ar ol marwolaeth y corff tymmorol? Neu a ydyw yn llefaru am bethau sydd yn dymmorol? A bu i mi ddywedyd wrthynt, ei fod yn arddangosiad o bethau tymmorol ac ysbrydol; canys fe ddaw y dydd pan y bydd yn rhaid iddynt gael eu barnu wrth eu gweithredoedd, ïe, sef y gweithredoedd a gyflawnwyd gan y corff tymmorol yn nyddiau eu prawf; am hyny, os byddant farw yn eu drygioni, rhaid iddynt gael eu bwrw ymaith hefyd gyda golwg ar y pethau ag ydynt yn ysbrydol, y rhai ydynt yn berthynol i iachawdwriaeth; am hyny, rhaid iddynt gael eu dwyn i sefyll gerbron Duw, i gael eu barnu am eu gweithredoedd; ac os bu eu gweithredoedd yn ffiaidd, y maent hwythau yn ffiaidd o anghenrhaid; ac os ydynt hwy yn ffiaidd, nis gallant drigo yn nheyrnas Dduw; pe gallent, byddai raid fod teyrnas Dduw yn ffiaidd hefyd. Ond, wele, yr wyf yn dywedyd wrthych, Nid yw teyrnas Dduw yn ffiaidd; ac ni all dim aflan fyned i mewn i deyrnas Dduw: am hyny anghenrhaid yw fod lle ffiaidd wedi ei barotoi i’r hyn sydd ffiaidd. Ac y mae lle wedi ei barotoi, ïe, sef yr ufern ddychrynllyd hono am ba un yr wyf wedi llefaru, a’r diafol yw y sylfaen o honi; am hyny sefyllfa olaf eneidiau dynion yw trigo yn nheyrnas Dduw, neu gael eu taflu allan oblegid y cyflawnder hwnw am ba un yr wyf wedi llefaru; am hyny, y drygionus a wahanir oddiwrth y cyfiawn, ac hefyd oddiwrth bren y bywyd hwnw, ffrwyth yr hwn sydd yn dra gwerthfawr a thra dymunol uwchlaw pob ffrwythau ereill; ïe, ac efe yw y fwyaf o holl roddion Duw. Ac felly y llefarais wrth fy mrodyr. Amen."
            },
            "5": {
                "0": "A myfi, Nephi, a ysgrifenais y pethau hyn i’m pobl, fel y galwn efallai eu perswadio hwynt i gofio yr Arglwydd en Gwaredwr; am hyny, yr wyf yn llefaru wrth holl dŷ Israel, os bydd iddynt feddu y pethau hyn. Canys, wele, y mae ynof weithrediadau yr ysbryd, y rhai ydynt yn fy mlino, hyd nes y mae fy nghymmalau yn weinion, ynghylch y rhai hyny ag ydynt yn Jerusalem; canys oni fuasai i Dduw fod yn drugarog, i ddangos i mi yn eu cylch, hyd y nod megys i’w brophwydi gynt, mi a fuaswn wedi trengu hefyd; ac yn ddiau efe a ddangosodd i’r prophwydi gynt yr holl bethau perthynol iddynt hwy; ac hefyd efe a ddangosodd i lawer o berthynas i ninnau; am hyny, mae yn rhaid ein bod ni yn gwybod yn eu cylch hwynt, canys y mae eu hanes yn ysgrifenedig ar y llafnau pres."
            },
            "6": {
                "0": "Dyrchafa dy lygaid oddiamgylch, ac edrych; yr holl rai hyn a ymgasglant, a hwy a ddeuant atat ti. Ac fel mai byw fi, medd yr Arglwydd, diau y gwisgi hwynt oll fel hardd-wisg, ac y rhwymi hwynt arnat fel priodferch. Canys dy ddiffaethwch a’th anialwch, a’th dir dinystriol, yn ddiau fydd yn awr yn rhy gyfyng gan breswylwyr; a’r rhai a’th lyncant a ymbellhant. Y plant a gai, ar ol i ti golli y cyntaf, a ddywedant etto yn dy giyw, Cyfyng yw y lle hwn i mi; dod le i mi, fel y preswyliwyf. Yna y dywedi yn dy galon, Pwy a genedlodd y rhai hyn i mi, a mi yn ddieppil, ac yn unig, yn gaeth, ac ar grwydr? A phwy a fagodd y rhai hyn? Fel hyn y dywed yr Arglwydd Dduw, Wele, cyfodaf fy llaw at y Cenedloedd, a dyrchafaf fy maner at y bobloedd; a dygant dy feibion yn eu mynwes, a dygir dy ferched ar eu hysgwyddau. Breninoedd hefyd fydd dy dadmaethod, a’u breninesau dy fammaethod; crymant i ti â’u hwynebau tua’r llawr, a llyfant lwch dy draed; a chei wybod mai myfi yw yr Arglwydd; canys ni chywilyddir y rhai a ddysgwyliant wrthyf fi. Canys a ddygir y caffaeliad oddiar y cadarn? Neu a waredir y rhai a garcherir yn gyfiawn? Ond fel hyn y dywed yr Arglwydd, Ië, carcharorion y cadarn a ddygir, ac anrhaith y creulawn a ddianc; canys myfi a ymrysonaf â’th ymrysonydd, a mi a achubaf dy feibion. Gwnaf hefyd i’th orthrymwyr fwyta eu cig eu hunain, ac areu gwaed eu hun y meddwant fel ar win melys; a gwybydd pob cnawd mai myfi, yr Arglwydd, yw dy achubydd, a’th gadarn waredydd di, Jacob."
            },
            "7": {
                "0": "Ac yn awr, yr wyf fi, Nephi, yn diweddu; canys ni feiddiaf lefaru ychwaneg yn bresennol, ynghylch y pethau hyn. Am hyny, fy mrodyr, hoffwn i chwi ystyried fod y pethau a ysgrifenwyd ar y llafnau pres yn wirioneddol; ac y maent hwy yn tystiolaethu fod yn rhaid i ddyn fod yn ufydd i orchymynion Duw. Am hyny, na feddyliwch mai fy nhad a minnau yw yr unig rai sydd wedi eu tystiolaethu, ac hefyd eu dysgu hwynt. Am hyny, os ufyddhewch i’r gorchymynion, a pharhau hyd y diwedd, chwi a achubir yn y dydd diweddaf. Ac felly y mae. Amen."
            },
            "8": {},
            "9": {},
            "10": {},
            "11": {},
            "12": {},
            "13": {},
            "14": {},
            "15": {},
            "16": {},
            "17": {},
            "18": {},
            "19": {},
            "20": {},
            "21": {},
            "22": {}
        }
    },
    "2-ne": {
        "meta": {
            "slug": "2-ne",
            "name": "Ail Lyfr Nephi.",
            "chapterWord": "Pennod Ⅰ."
        },
        "chapters": {
            "1": {
                "intro": "Hanes marwolaeth Lehi. Brodyr Nephi yn gwrthryfela yn ei erbyn Yr Arglwydd yn rhybyddio Nephi i fyned i’r anialwch. E deithiau yn yr anialwch, & c.",
                "0": "Mi a lefarais yr ychydig eiriau hyn wrthych oll, fy meibion, yn nyddiau olaf fy mhrawf; ac mi a ddewisais y rhan dda, yn ol geiriau y prophwyd. Ac nid oes genyf ddyben arall mewn golwg, na lleshad tragywyddol eich eneidiau. Amen."
            },
            "2": {
                "0": "Ac yn awr, wele, fy mab Joseph, yn ol y dull hyn y prophwydodd fy nhad i gynt. Am hyny, o herwydd y cyfammod hwn bendigedig ydwyt ti; canys ni ddyfethir dy had di, oblegid hwy a wrandawant eiriau y llyfr. A chyfyd un galuog yn eu mysg hwynt, yr hwn a wna lawer o ddaioni, mewn gair a gweithred, gan fod yn offeryn yn nwylaw Duw, trwy ffydd nerthol, i wneyd rhyfeddodau mawrion, a chyflawni y peth hwnw ag sydd yn fawr yn ngolwg Duw, hyd y nod dwyn oddiamgylch lawer o adferiad i dŷ Israel, ac i had dy frodyr. Ac yn awr, gwyn dy fyd di, Joseph. Wele, tydi ydwyt fychan; am hyny, gwrandaw ar eiriau dy frawd Nephi, a bydd i ti yn ol y geiriau a lefarais. Cofia eiriau dy dad wrth farw. Amen."
            },
            "3": {
                "0": "A bu cyn pen llawer o ddyddiau ar ol ei farwolaeth, i Laman a Lemuel, a meibion Ishmael, fod yn ddigllawn wrthyf o herwydd rhybyddion yr Arglwydd; canys yr oeddwn i, Nephi, yn rhwym o lefaru wrthynt, yn ol ei air ef. Canys mi a lefarais lawer o bethau wrthynt, ac hefyd fy nhad, cyn ei farwolaeth; y mae llawer o’r dywediadau hyny yn ysgrifenedig ar fy llafnau ereill; canys y mae rhan fwyaf hanesyddol yn ysgrifenedig ar fy llafnau ereill. Ac ar y rhai hyn yr wyf yn ysgrifenu pethau fy enaid, a llawer o’r ysgrythyrau y rhai ydynt wedi eu cerfio ar y llafnau pres. Canys y mae fy enaid yn ymhyfrydu yn yr ysgrythyrau, a’m calon yn eu dwys ystyried, ac yn eu hysgrifenu er addysg a lles fy mhlant. Wele, mae fy enaid yn ymhyfrydu yn mhethau yr Arglwydd; a’m calon sydd yn dwys ystyried yn barhaus y pethau a welais ac a glywais. Er hyny, y mae daioni mawr yr Arglwydd, wrth ddangos i mi ei waith mawr a rhyfedd, yn achosi i’m calon waeddi, Ys truan o ddyn wyf fi; ïe, mae fy nghalon yn tristâu o herwydd fy nghnawd. Fy enaid a ymofidia oblegid fy anwir eddau. Amgylchynir fi gan y profedigaethau a’r pechodau sydd barotaf i’m dal. A phan yr ewyllysiwyf orfoleddu, fy nghalon a ocheneidia o herwydd fy mhechodau; er hyny, mi a wn yn mhwy yr ymddiriedais. Fy Nuw a’m cynnaliodd; efe a’m harweiniodd trwy fy mlinderau yn yr anialwch, ac a’m cadwodd ar ddyfroedd y dyfnder mawr. Llanwodd fi â’i gariad, hyd at ysiad fy nghnawd. Cywilyddiodd fy ngelynion, nes achosi iddynt grynu o’m blaen. Wele, gwrandawodd fy nghri yn y dydd, a rhoddodd i mi wybodaeth trwy weledigaethau yn y nos. Ac yn y dydd aethym yn hyf mewn gweddi nerthol o’i flaen; ïe, fy llais a anfonais i fyny yn uchel; a daeth angylion i waered a gweinyddu i mi. Ac ar adenydd ei ysbryd y cymmerwyd fi ymaith i fynyddoedd uchel iawn. A gwelodd fy llygaid bethau mawrion; ïe, sef rhy fawr i ddyn: gan hyny, gorchymynwyd i mi beidio eu hysgrifenu hwynt. O, ynte, os gwelais bethau mor fawr—os yw yr Arglwydd, yn ei ymddarostyngiad at blant dynion, wedi ymweled â dynion gyda’r fath drugaredd, paham yr wyla fy nghalon, ac yr ymhwyrfryda fy enaid yn nglỳn trallod, ac y treulia fy nghnawd, ac y lleiha fy nerth, o herwydd fy nghystuddiau? A phaham yr ymroddaf i bechod, o herwydd fy nghnawd? Ië, paham y rhoddaf ffordd i brofedigaethau, er i’r un drwg gael lle yn fy nghalon, i ddinystrio fy heddwch a chystuddio fy enaid. Paham yr wyf yn ddigllawn o herwydd fy ngelyn? Dihuna, fy enaid! Na ddihoena mwyach mewn pechod. Gorfoledda, fy nghalon, ac na rodda le mwyach i elyn fy enaid. Na ddigia mwyach, o herwydd fy ngelynion. Na leiha dy nerth, o herwydd fy nghystuddiau. Gorfoledda, fy nghalon, a gwaedda ar yr Arglwydd, a dywed, O, Arglwydd, moliannaf dy enw yn dragywydd; ïe, fy enaid a ymorfoledda ynot ti, fy Nuw, a chraig fy iachawdwriaeth. O Arglwydd, a waredi di fy enaid? A waredi di fi allan o ddwylaw fy ngelynion? A wnai di imi grynu wrth weled pechod? A gaiff pyrth uffern fod yn nghau o’m blaen yn barhaus, o herwydd fod fy nghalon yn ddrylliog a’m hysbryd yn gystuddiedig? O Arglwydd, a beidi a chau pyrth trugaredd o’m blaen, fel y rhodiwyf lwybr y blyn isel, fel y byddwyf gywir ar y ffordd eglur? O, Arglwydd, a amgylchyni di fi yn ngwisg dy gyfiawnder? O Arglwydd, a wnai di ffordd i’m ddianc o flaen fy ngelynion? A wnai di fy llwybr yn uniawn o’m blaen? A wnai di beidio gosod maen tramgwydd ar fy ffordd? Eithr clirio fy ffordd o’m blaen, a pheidio cau i fyny fy ffordd i, eithr ffyrdd fy ngelynion. O Arglwydd, mi a ymddiriedais ynot, ac a ymddiriedaf ynot byth. Ni ymddiriedaf mewn braich o gnawd; canys mi a wn mai melldigedig yw yr hwn a ymddiriedo mewn braich o gnawd. Ië, melldigedig yw yr hwn a ymddiriedo mewn dyn, neu a wnelo gnawd yn fraich iddo. Ië, mi a wn y rhydd Duw yn haelionus i’r hwn a ofyno. Ië, fy Arglwydd a rydd i mi, os na ofynaf ar gam; gan hyny, dyrchafaf fy llais atat ti; ïe, mi a waeddaf arnat ti, fy Nuw, a chraig fy iachawdwriaeth. Wele, fy llais a ddyrchafa yn dragywydd atat ti, fy nghraig a’m Duw tragywyddol. Amen."
            },
            "4": {
                "0": "A bu i’r Arglwydd Dduw ddywedyd wrthyf, Gwna lafnau ereill; a thi a gei ysgrifenu arnynt lawer o bethau ag ydynt yn dda yn fy ngolwg, er lleshad dy bobl. Am hyny, myfi, Nephi, er ufyddhau i orchymynion yr Arglwydd, a aethym ac a wnaethym y llafnau hyn ar ba rai y cerfiais y pethau hyn. Ac mi a gerfiais yr hyn oedd yn rhyngu bodd Duw. Ac os rhyngir bodd fy mhobl â phethau duw, rhyngir eu bodd hefyd â’m cerfiadau innau, y rhai ydynt ar y llafnau hyn. Ac os yw fy mhobl yn chwennych gwybod y rhan fwyaf neillduol o hanes fy mhobl, rhaid iddynt chwilio fy llafnau ereill. Ac y mae yn ddigon i mi ddweyd, fod deugain mlynedd wedi myned heibio, a’n bod eisioes wedi cael rhyfeloedd ac amrafaelion gyda’n brodyr."
            },
            "5": {
                "0": "Deffro, deffro, gwisg dy nerth, O Seion; gwisg wisgoedd dy ogoniant, santaidd ddinas Jerusalem; canys ni ddaw o’th fewn mwy ddïenwaededig nac aflan. Ymysgwyd o’r llwch; cyfod, eistedd, Jerusalem; ymddattod oddiwrth rwymau dy wddf, ti gaethferch Seion."
            },
            "6": {
                "0": "Ac yn awr, fy mrodyr, mi a fynwn lefaru ychwaneg wrthych; eithr y fory mi a draethaf wrthych y gweddill o’m geiriau. Amen."
            },
            "7": {
                "0": "Ac yn awr, fy anwyl frodyr, gan weled fod ein Tad trugarog wedi rhoddi i ni wybodaeth mor fawr am y pethau hyn, bydded i ni ei gofio ef, a gosod ein pechodau o’r neilldu, a pheidio gostwng ein penau, canys nid ydym wedi ein bwrw ymaith; er hyny, ni a yrwyd allan o wlad ein hetifeddiaeth; etto ni a arweiniwyd i wlad well, oblegid yr Arglwydd a wnaeth y môr i ni yn llwybr, ac yr ydym ni ar ynys y môr. Ond mawr yw addewidion yr Arglwydd i’r rhai ydynt ar ynysoedd y môr; am hyny, gan y dywedir ynysoedd, rhaid fod ychwaneg nag hon, a phreswylir hwynt hefyd gan ein brodyr ni. Canys wele, y mae yr Arglwydd Dduw wedi arwain rhai ymaith o dŷ Israel o bryd i bryd, yn ol ei ewyllys a’i foddlonrwydd. Ac yn awr, wele, y mae yr Arglwydd yn cofio am yr holl rai a dorwyd ymaith, am hyny y mae yn ein cofio ninnau hefyd; gan hyny llawenhewch yn eich calonau, a chofiwch eich bod yn rhydd i weithredu drosoch eich hunain—i ddewis ffordd marwolaeth dragywyddol, neu ffordd bywyd dragywyddol. Am hyny, fy anwyl frodyr, ymgymmodwch ag ewyllys Duw, ac nid ewyllys y diafol a’r cnawd; a chofiwch ar ol ymgymmodi â Duw, mai yn a thrwy râs Duw yr ydych yn gadwedig. Am hyny, cyfoded Duw chwi o farwolaeth trwy allu yr adgyfodiad, ac hefyd o farwolaeth dragywyddol trwy allu yr iawn, fel y derbynier chwi i deyrnas dragywyddol Duw, fel y moliannoch ef trwy ddwyfol râs. Amen."
            },
            "8": {
                "0": "Ac efe a gyfyd faner i’r cenedloedd o bell, ac a chwibana arnynt hwy o eithaf y ddaear; ac wele, ar frys yn fuan y deuant: ni bydd un blin na thramgwyddedig yn eu plith; ni huna yr un, ac ni chwsg; ac ni ddattodir gwregys ei lwynau, ac ni ddryllir carai ei esgidiau. Yr hwn sydd â’i saethau yn llymion, a’i holl fwäau yn annelog; carnau ei feirch ef a gyfrifir fel callestr, a’i olwynion fel corwynt, a’i ruad fel llew. Efe a rua fel cenawon llew; ïe, efe a chwyrna hefyd, ac a ymeifl yn yr ysglyfaeth, ac a’i dwg ymaith yn ddiogel, ac ni bydd achubydd. Ac efe a rua arnynt y dydd hwnw, fel rhuad y môr; os edrychir ar y tir, wele dywyllwch a chyfyngder, a’r goleuni a dywyllir yn ei nefoedd."
            },
            "9": {
                "0": "Yna y dywedi yn y dydd hwnw, Molaf di, O Arglwydd: er i ti sori wrthyf, dychwelir dy lid, a thi a’m cysuri. Wele, Duw yw fy iachawdwriaeth; gobeithiaf, ac nid ofnaf: canys yr Arglwydd Dduw yw fy nerth a’m cân; efe hefyd yw fy iachawdwriaeth. Am hyny, mewn llawenydd y tynwch ddwfr o ffynnonau iachawdwriaeth. A chwi a ddywedwch yn y dydd hwnw, Molwch yr Arglwydd, gelwch ar ei enw, hysbyswch ei weithredoedd ef yn mhlith y bobloedd, cofiwch mai dyrchafedig yw ei enw ef. Cenwch i’r Arglwydd; canys godidawgrwydd a wnaeth efe: hysbys yw hyn yn yr holl dir. Bloeddia a chrochlefa, breswylferch Seion; canys mawr yw Sanct Israel o’th fewn di."
            },
            "10": {
                "0": "Palestina, na lawenycha di oll, er tori gwïalen dy darawydd: o herwydd o wreiddyn y sarff y daw gwiber allan, a’i ffrwyth hi fydd sarff danllyd hedegog. A chynblant y tlodion a ymborthant, a’r rhai anghenus a orweddant mewn diogelwch: ac mi a laddaf dy wreiddyn â newyn, yntau a ladd dy weddill. Uda, borth; gwaedda, ddinas; Palestina, ti oll a doddwyd: canys mwg sydd yn dyfod o’r gogledd, ac ni bydd unig yn ei amseroedd nodedig ef. A pha beth a atebir i genadau y genedl? Seilio o’r Arglwydd Seion, ac y gobeithia trueiniaid ei bobl ef ynddi."
            },
            "11": {
                "0": "A’r dydd hwnw y rhai byddar a glywant eiriau y llyfr, a llygaid y deillion a welant allan o niwl a thywyllwch, a’r rhai llariaidd a ychwanegant, a’u llawenydd fydd yn yr Arglwydd, a’r dynion tlodion a ymorfoleddant yn Sanct Israel. Canys yn ddiau, fel mai byw yr Arglwydd, hwy a welant y derfydd am yr ofnadwy, ac y dyfethir y gwatwarus; a’r rhai oll a wyliant am anwiredd a dorir ymaith; a’r rhai a wnant ddyn yn droseddwr o herwydd gair, ac a osodant faglau i’r hwn a geryddo yn y porth, ac a wnant i’r cyfiawn wyro am beth coeg. Am hyny, fel hyn y dywed yr Arglwydd, yr hwn a waredodd Abraham, am dŷ Jacob, Weithian ni chywilyddir Jacob, ac ni lasa ei wyneb ef. Eithr pan welo efe ei feibion, gwaith fy nwylaw, o’i fewn, hwy a santeiddiant fy enw, ïe, santeiddiant Sanct Jacob, ac a ofnant Dduw Israel. A’r rhai cyfeiliornus o ysbryd a ddysgant ddeall, a’r grwgnachwyr a ddysgant addysg."
            },
            "12": {
                "0": "A bydd i’r Arglwydd Dduw ddechreu ei waith yn mhlith pob cenedl, llwyth, iaith, a phobl, er dwyn oddiamgylch adferiad ei bobl ar y ddaear. A’r Arglwydd Dduw a farna y tlodion mewn cyfiawnder, ac a argyhoedda dros rai llariaidd y ddaear mewn uniondeb. Ac efe a dery y ddaear â gwialen ei enau, ac ag anadl ei wefusau y lladd efe yr anwir; canys y mae’r amser yn dyfod ar frys y pair yr Arglwydd Dduw ymraniad mawr yn mhlith y bobl; a’r drygionus a ddyfetha efe; ac a arbed ei bobl, ïe, hyd y nod pe byddai raid iddo ddyfetha y drygionus trwy dân. A chfiawnder fydd gwregys ei lwynau ef, a ffyddlondeb yn wregys ei arenau. Ac yna y blaidd a drig gyda’r oen, a’r llewpard a orwedd gyda’r mŷn; y llo hefyd, a chenaw y llew, a’r anifail brâs fyddant ynghyd, a bachgen bychan a’u harwain. Y fuwch hefyd a’r arth a borant ynghyd; a’u llydnod a gydorweddant; y llew, fel yr ŷch, a bawr wellt. A’r plentyn sugno a chwery wrth dwll yr asp; ac ar ffau y wiber yr estyn yr hwn a ddiddyfnwyd ei law. Ni ddrygant ac ni ddyfethant yn holl fynydd fy santeiddrwydd; canys y ddaear a fydd lawn o wybodaeth yr Arglwydd, megys y mae y dyfroedd yn toi y môr.Am hyny, gwneir pethau yr holl genedloedd yn adnabyddus; ïe, pob peth a wneir yn hysbys i blant dynion. Nid oes dim dirgel, na ddadguddir; nid oes weithredoedd y tywyllwch, na amlygir yn y goleuni; ac nid oes dim seliedig ar y ddaear, na ryddheir. Am hyny, pob peth a ddadguddiwyd i blant dynion, a ddadguddir yn y dydd hwnw; ac ni chaiff satan awdurdod ar galonau plant dynion mwyach, am hir amser. Ac yn awr, fy anwyl frodyr, y mae yn rhaid i mi ddiweddu fy ymadroddion."
            },
            "13": {
                "0": "Ac yn awr, wele, fy anwyl frodyr, hon yw y ffordd; ac nid oes ffordd nac enw arall wedi eu rhoddi dan y nef; trwy y rhai y gall dyn gael ei achub yn nheyrnas Dduw. Ac yn awr, wele, dyma athrawiaeth Crist, ac unig wir athrawiaeth y Tad, a’r Mab, a’r Ysbryd Glân, y rhai ydynt un Duw, heb ddiwedd. Amen."
            },
            "14": {
                "0": "Ac yn awr, fy anwyl frodyr, canfyddaf eich bod etto yn myfyrio yn eich calonau; a blinir fi am fod yn rhaid i mi lefaru ynghylch y peth hyn. Canys pe gwrandawech ar yr ysbryd sydd yn dysgu dyn i weddio, chwi a wybyddech fod yn rhaid i chwi weddio; canys nid yw yr ysbryd drwg yn dysgu dyn i weddio, eithr yn ei ddysgu i beidio gweddio. Ond, wele, meddaf i chwi, rhaid i chwi weddio yn wastadol, a pheidio diffygio; ac na chyflawnwch ddim i’r Arglwydd, oddieithr i chwi yn gyntaf weddio ar y Tad, yn enw Crist, i gyssegru i chwi eich gwasanaeth, fel y byddo eich gwasanaeth er lleshad eich enaid."
            },
            "15": {
                "0": "Ac yn awr, fy anwyl frodyr, yr holl rai ydynt o dŷ Israel, a chwithau holl derfynau y ddaear, yr wyf yn llefaru wrthych, megys llef un yn gwaeddi o’r llwch: ffarwel hyd nes y delo y dydd mawr hwnw; a chwithau y rhai ni chyfranogwch o ddaioni Duw, ac ni pherchwch eiriau yr Iuddewon, ac hefyd fy ngeiriau innau, a’r geiriau a ddaw allan o enau Oen Duw, wele yr wyf yn rhoi ffarwel bythol i chwi, canys y geiriau hyn a’ch condemniant chwi yn y dydd diweddaf: canys yr hyn wyf yn selio ar y ddaear, a ddygir yn eich erbyn yn y frawdle; oblegid felly y gorchymynodd yr Arglwydd i mi, a rhaid i minnau ufyddhau. Amen."
            },
            "16": {},
            "17": {},
            "18": {},
            "19": {},
            "20": {},
            "21": {},
            "22": {},
            "23": {},
            "24": {},
            "25": {},
            "26": {},
            "27": {},
            "28": {},
            "29": {},
            "30": {},
            "31": {},
            "32": {},
            "33": {}
        }
    },
    "jacob": {
        "meta": {
            "slug": "jacob",
            "name": "Llyfr Jacob,",
            "chapterWord": "Pennod Ⅰ."
        },
        "chapters": {
            "1": {
                "intro": "Geiriau ei bregethau wrth ei frodyr. Y mae yn dyrysu dyn sydd yn ceisio dymchwelyd athrawiaeth Crist. Ychydig o eiriau yn nghylch hanes pobl Nephi.",
                "0": "Ac yn awr, dygwyddodd i fobl Nephi, dan deyrnasiad yr ail frenin, ddechreu ymgaledu yn eu calonau, ac ymollwng i raddau i ymarferiadau drygionus, yn gyffelyb i Ddafydd gynt, gan ddymuno llawer o wragedd a gordderchwragedd, ac hefyd Solomon, ei fab: ïe, dechreuasant hefyd i chwilio am lawer o aur ac arian, ac a ddechreuasant ymdderchafu ychydig mewn balchder; am hyny, myfi, Jacob, a roddais y geiriau, hyn iddynt, tra yn eu dysgu hwynt yn y deml, wedi derbyn yn gyntaf fy nghenadwri oddiwrth Dduw. Canys yr oeddwn i, Jacob, a’m brawd Joseph, wedi ein neillduo yn offeiriaid, ac yn ddysgawdwyr y bobl hyn, trwy law Nephi. A darfu i ni fawrygu ein swydd i’r Arglwydd, gan gymmeryd arnom y cyfrifoldeb, o ateb pechodau y bobl ar ein penau ein hunain, os na ddysgem iddynt air Duw gyda phob diwydrwydd; am hyny, llafuriasom â’n holl allu, fel na ddeuai eu gwaed hwynt ar ein gwisgoedd; pe amgen, eu gwaed a ddeuai ar ein gwisgoedd, ac ni cheffid ninnau yn ddifrycheulyd yn y dydd diweddaf."
            },
            "2": {
                "0": "O, fy mrodyr, gwrandewch ar fy ngair; deffrowch gynneddfau eich enaid; ymysgydwch, fel y dihunoch o gwsg marwolaeth; ac ymryddhewch o boenau uffern, fel nad eloch yn angylion i’r diafol, i gael eich taflu i’r llyn hono o dân a brwmstan, yr hon yw yr ail farwolaeth. Ac yn awr, yr wyf fi. Nephi, gan eu rhybyddio hwynt yn erbyn puteindra a thrythyllwch, a phob math o bechod, gan fynegi iddynt y canlyniadau erchyll o honynt; ac ni all y ddegfed ran o weithrediadau y bobl yma, y rhai yn awr a ddechreuant fod yn lliosog, gael eu hysgrifenu ar y llafnau hyn; eithr y mae llawer o’u gweithrediadau yn ysgrifenedig ar y llafnau mwyaf, ynghyd â’u rhyfeloedd, a’u hamrafaelion, a theyrnasiad eu breninoedd. Y llafnau hyn a elwir llafnau Jacob, a hwy a wnaed gan law Nephi. Ac yr wyf fi yn gorphen llefaru y geiriau hyn."
            },
            "3": {
                "0": "A bu pan welodd Arglwydd y winllan fod ei ffrwyth yn dda, ac nad oedd ei winllan mwyach yn llygredig, efe a alwodd i fyny ei weision, ac a ddywedodd wrthynt, Wele, am y waith ddiweddaf hon y gwrteithiasom fy ngwinllan; a chwi a welwch i mi wneuthur yn ol fy ewyllys; ac mi a gedwais y ffrwyth naturiol, sydd yn dda, ïe, megys yr oedd yn y dechreuad; a gwyn eich byd chwi. Canys o herwydd i chwi ddyfal lafurio gyda mi yn fy ngwinllan, a chadw fy ngorchymynion, a dwyn i mi drachefn y ffrwyth naturiol, fel nad yw fy ngwinllan mwyach yn llygredig, a’r drwg wedi ei daflu ymaith, wele, chwi a gewch lawenydd gyda mi, o herwydd ffrwyth fy ngwinllan. Canys wele, am hir amser y casglaf ffrwyth fy ngwinllan i mi fy hun, erbyn y tymmor, yr hwn sydd yn dyfod ar frys; ac am y waith ddiweddaf mi a wrthteithiais fy ngwinllan, ac a’i triniais, ac a gloddiais oddiamgylch, ac a fwriais dail; am hyny, mi a gasglaf i mi fy hun o’r ffrwyth, am hir amser, yn ol yr hyn a lefarais. A phan ddelo yr amser i ffrwyth drwg ddyfod drachefn i’m gwinllan, yna y perafi’r da a’r drwg gael eu casglu; a’r da a gadwaf i mi fy hun; a’r drwg a fwriaf ymaith i’w le ei hun. Ac yna y daw y tymmor a’r diwedd; a pheraf i’m gwinllan gael ei llosgi â thân."
            },
            "4": {
                "0": "Ac yn awr, wele, fy mrodyr, megys y dywedais wrthych y byddai i mi brophwydo, wele, dyma fy mhrophwydoliaeth. Fod yn rhaid i’r pethau a lefarodd y prophwyd Zenos hwn, ynghylch tŷ Israel, yn y rhai y cyffelybodd hwynt i olewydden ddôf, ddyfod i ben. A’r dydd y gesyd efe ei law etto yr ail waith i achub ei bobl, yw y dydd, ïe, sef yr amser diweddaf, yr â gweision yr Arglwydd allan yn ei nerth ef, i wrteithio a thrin ei winllan: ac ar ol hyny, mae y diwedd yn dyfod ar frys. A pha mor wynfydedig yw y rhai a lafuriasant yn ddyfal yn ei winllan ef: a pha mor felldigedig yw y rhai a fwrir allan i’w lle eu hun! A’r byd a losgir â thân. Ac mor drugarog yw ein Duw i ni: canys y mae efe yn coflo tŷ Israel, gwreiddiau a changenau; ac y mae efe yn estyn allan ei ddwylaw atynt trwy gydol y dydd; a hwythau ydynt bobl wargaled a gwrthddywedgar; ond cynnifer ni chaledant eu calonau, a achubir yn nheyrnas Dduw. Am hyny, fy anwyl frodyr, deisyfaf arnoch mewn geiriau sobrwydd, i edifarhau, a dyfod gyda llawn fwriad calon, a glynu wrth Dduw megys ag y glyna efe wrthych chwi. A thra y mae ei fraich drugarog yn estynedig atoch yn ngoleu y dydd, na chaledwch eich calonau. Ië, heddyw, os clywch ei leferydd ef, na chaledwch eich calonau; canys paham y byddwch feirw? Canys wele, ar ol i chwi gael eich meithrin â gair daionus Duw trwy gydol y dydd, paham y dygwch ffrwyth drwg, fel y rhaid eich tori i lawr a’ch taflu i’r tân? Wele, a wrthodwch chwi y geiriau hyn? A wrthodwch chwi eiriau y prophwydi? Ac a wrthodwch chwi yr holl eiriau a lefarwyd ynghylch Crist, ar ol i gynnifer lefaru am dano ef; a gwadu gair daionus Crist a gallu Duw, a dawn yr Ysbryd Glân, a dddiffodi yr Ysbryd Santaidd? A gwneuthur gwawd o gynllun mawr y waredigaeth a drefnwyd i chwi? Ai ni wyddoch chwi os gwnewch y pethau hyn, y dygir chwi gan allu y waredigaeth a’r adgyfodiad sydd yn Nghrist, i sefyll gyda chywilydd ac euogrwydd ofnadwy gerbron brawdle Duw? Ac yn ol gallu cyfiawnder, canys ni ellir gwadu cyfiawnder, y bydd raid i chwi fyned i’r llyn hono sydd yn llosgi o dân a brwmstan, yr hon sydd â’i fflamau yn anniffoddadwy, a’i mwg yn esgyn i fyny yn oes oesoedd, yr hon lyn o dân a brwmstan yw poenedigaeth diddiwedd. O, ynte, fy anwyl frodyr, edifarhewch, ac ewch i mewn trwy y porth cyfyng, a pharhewch yn y ffordd yr hon sydd gul, hyd nes y cyrhaeddoch fywyd tragywyddol. O, byddwch ddoeth: beth a allaf ddywedyd yn ychwaneg? Yn ddiweddaf, yr wyf yn rhoi ffarwel i chwi, hyd nes y cyfarfyddaf â chwi gerbron brawdle ddymunol Duw, yr hon frawdle a dery y drygionus â dychryn a braw. Amen."
            },
            "5": {
                "0": "A myfi, Jacob, a welais fod yn rhaid i mi yn fuan fyned lawr i’m bedd; am hyny, mi a ddywedais wrth fy mab Enos, Cymmer y llafnau hyn. Ac mi a fynegais wrtho y pethau a orchymynodd fy mrawd Nephi i mi, ac efe a addawodd ufyddhau i’r gorchymynion. Ac yr wyf fi yn gorphen ysgrifenu ar y llafnau hyn, yr hyn ysgrifenu a fu yn ychydig: ac i’r darllenydd yr wyf yn rhoddi ffarwel, gan obeithio y gwna llawer o’m brodyr ddarllen fy ngeiriau. Frodyr, ffarwel."
            },
            "6": {},
            "7": {}
        }
    },
    "enos": {
        "meta": {
            "slug": "enos",
            "name": "Llyfr Enos.",
            "chapterWord": "Pennod Ⅰ."
        },
        "chapters": {
            "1": {
                "0": "A bu i mi ddechreu heneiddio, ac yr oedd cant a phedair blynedd ar bymtheg a thrigain wedi myned heibio er pan gychwynodd ein tad Lehi o Jerusalem. A gwelais fod yn rhaid i mi yn fuan fyned i’m bedd, wedi bod dan gynhyrfiad gallu Duw yn pregethu a prophwydo wrth y bobl hyn, a thraethu y gair yn ol y gwirionedd yr hwn sydd yn Nghrist. Ac mi a’i traethais ef trwy fy holl ddyddiau, ac a orfoleddais ynddo, yn fwy nag yn eiddo y byd. Ac yn fuan mi a âf i’m gorphwysfa yr hon sydd gyda’m Gwaredwr; canys mi a wn mai ynddo ef y gorphwysaf: ac yr wyf yn gorfoleddu yn y dydd y gwisga fy marwol anfarwoldeb, ac y safo o’i flaen ef: yna y caf weled ei wyneb ef gyda phleser, ac y dywed efe wrthyf, Tyred ataf, ti fendigedig, y mae lle wedi ei barotoi i ti yn nhrigfanau fy Nhad. Amen."
            }
        }
    },
    "jarom": {
        "meta": {
            "slug": "jarom",
            "name": "Llyfr Jarom.",
            "chapterWord": "Pennod Ⅰ."
        },
        "chapters": {
            "1": {
                "0": "A bu i ddau gant a thair blynedd ar bymtheg ar hugain fyned heibio ar ddull rhyfeloedd, ac amrafaelion, ac ymraniadau am yspaid llawer o amser. Ac nid wyf fi, Jarom, yn ysgrifenu ychwaneg, canys y mae’r llafnau yn fychain. Ond wele, fy mrodyr, chwi a ellwch fyned at lafnau ereill Nephi; canys wele, arnynt hwy y mae hanes ein rhyfeloedd yn gerfiedig, yn ol ysgrifeniadau y breninoedd, neu y rhai a berodd eu hysgrifenu. Ac yr wyf fi yn cyflwyno y llafnau hyn i ddwylaw fy mab Omni, fel y cadwer hwynt yn ol gorchymynion fy nhadau."
            }
        }
    },
    "omni": {
        "meta": {
            "slug": "omni",
            "name": "Llyfr Omni.",
            "chapterWord": "Pennod Ⅰ."
        },
        "chapters": {
            "1": {
                "0": "A bu iddynt hefyd gymmeryd ereill hyd at nifer fawr, a chymmeryd eu taith drachefn i’r anialwch. Ac yr oedd genyf finnau, Amaleki, frawd, yr hwn a aeth hefyd gyda hwynt; ac oddiar hyny ni wn ddim am danynt. Ac yr wyf fi ynghylch myned i orwedd yn fy medd; a’r llafnau hyn ydynt yn llawnion; a minnau wyf yn gorphen llefaru."
            }
        }
    },
    "w-of-m": {
        "meta": {
            "slug": "w-of-m",
            "name": "Geiriau Mormon.",
            "chapterWord": "Pennod Ⅰ."
        },
        "chapters": {
            "1": {
                "0": "A dygwyddodd ar ol bod gau Gristiau, ac i’w geneuau gael eu cau, a hwythau eu cospi yn ol eu troseddiadau; ac ar ol bod gau-brophwydi, a gau bregethwyr ac athrawon yn mhlith y bobl, ac i’r holl rai hyn gael eu cospi yn ol eu troseddiadau; ac ar ol bod llawer o amrafaelion ac ymraniadau ymaith at y Lamaniaid, wele, dygwyddodd i’r brenin Benjamin, trwy gynnorthwy y prophwydi santaidd oedd yn mysg ei bobl; canys wele, yr oedd y brenin Benjamin yn ddyn santaidd, ac efe a deyrnasodd dros ei bobl mewn cyfiawnder. Ac yr oedd llawer o ddynion santaidd yn y tir; a hwy a lefarasant air Duw, gyda gallu ac awdurdod; ac a arferent lawer o erwindeb o herwydd gwargaledwch y bobl; am hyny, trwy gynnorthwy y rhai hyn, y brenin Benjamin, trwy lafurio â’i holl nerth corfforol, a galluoedd ei holl enaid ef, a’r prophwydi hefyd, a sefydlodd heddwch unwaith yn rhagor yn y tir."
            }
        }
    },
    "mosiah": {
        "meta": {
            "slug": "mosiah",
            "name": "Llyfr Mosiah.",
            "chapterWord": "Pennod Ⅰ."
        },
        "chapters": {
            "1": {
                "0": "Ac yn awr, mi a lefarais y geiriau a orchymynodd yr Arglwydd Dduw i mi. Ac fel hyn y dywed yr Arglwydd: Hwy a safant megys tystiolaeth eglur yn erbyn y bobl hyn, yn nydd y farn; am yr hyn y bernir hwy, pob dyn yn ol ei weithredoedd, pa un a fyddant ai da ai drwg; ac os byddant ddrwg, trosglwyddir hwynt i olygfa ddychrynllyd o’u heuogrwydd a’u ffieidd-dra eu hunain, yr hyn a achosa iddynt gilio mewn braw o wyddfod yr Arglwydd, i gyflwr o drueni a phoen diddiwedd, o ba le nis gallant ddychwelyd mwyach; am hyny, yfasant ddamnedigaeth i’w heneidiau eu hunain. Gan hyny, yfasant o gwpan digofaint Duw, yr hwn ni allai cyfiawnder mwyach ei wrthod iddynt, mwy na allai wrthod i Adda syrthio, o herwydd iddo gymmeryd o’r ffrwyth gwaharddedig; am hyny, ni allai trugaredd gael hawl ynddynt hwy byth mwyach. A’u poen sydd megys llyn o dân a brwmstan, fflamiau yr hon ydynt yn anniffoddadwy, a’i mwg yn esgyn i fyny yn oes oesoedd. Felly y gorchymynodd yr Arglwydd i mi. Amen."
            },
            "2": {
                "0": "Ac yn awr, er mwyn y pethau hyn a lefarais wrthych; hyny yw, er mwyn diogelu maddeuant o’ch pechodau o ddydd i ddydd, fel y rhodioch yn ddieuog gerbron Duw, mi a ewyllysiwn i chwi gyfranu o’ch eiddo i’r tlodion, pob dyn yn ol yr hyn sydd ganddo, megys porthi y newynog, dilladu y noeth, ymweled â’r claf, a gweini i’w cymhorth, yn ysbrydol a thymmorol, yn ol eu hanghenion, ac edrych fod yr holl bethau hyn yn cael eu gwneuthur mewn doethineb a threfn; canys nid yw yn ofynol i ddyn redeg yn gyflymach na allo. A thrachefn: y mae yn anghenrheidiol iddo fod yn ddiwyd, fel trwy hyny yr ennillo y wobr; gan hyny, rhaid i bob peth gael ei wneuthur mewn trefn. Ac mi a fynwn i chwi gofio, y dylai pwy bynag a fenthycio oddiar ei gymmydog, ddychwelyd yr hyn a fenthycio, yn ol fel y cytuno, onide y mae yn cyfiawni pechod, ac efallai yr achosa i’w gymmydog gyflawni pechod hefyd. Ac yn olaf, nis gallaf fynegi wrthych yr holl bethau trwy y rhai y gellwch gyflawni pechod; canys y mae amryw ffyrdd a moddion, ïe, gynnifer, fel nas gallaf eu cyfrif. Ond hyn a allaf ddywedyd wrthych, os nad ydych yn gwylio arnoch eich hunain, ac ar eich meddyliau, ac ar eich geiriau, a’ch gweithredoedd, a chadw gorchymynion yr Arglwydd, a pharhau yn ffyddiog yn yr hyn a glywsoch ynghylch dyfodiad ein Harglwydd, ïe, hyd ddiwedd eich einioes, y dyfethir chwi. Ac yn awr, O ddya, cofia, ac na ddyfether di."
            },
            "3": {
                "0": "A bydd, yn awr, pwy bynag na chymmero arno enw Crist, a raid ei alw wrth ryw enw arall; am hyny, efe a gaiff ei hun ar law aswy Duw. Ac mi a fynwn i chwi gofio hefyd, mai dyma yr enw a ddywedais y rhoddaswn i chwi na ddileid byth, oddieithr trwy drosedd; gan hyny, gofalwch na throseddoch, fel na ddilëer yr enw o’ch calonau. Yr wyf yn dywedyd wrthych, mi a fynwn pe cadwech yr enw yn ysgrifenedig o hyd yn eich calonau, fel na chaffer chwi ar law aswy Duw, eithr fel y clywoch ac yr adnabyddoch y llais gan yr hwn y’ch gelwir, ac hefyd yr enw wrth ba un y’ch gelwir ganddo; canys pa fodd yr adnebydd dyn y meistr na wasanaethodd, a’r hwn sydd yn ddyeithr iddo, ac yn mhell oddiwrth feddyliau a bwriadau ei galon? A thrachefn: A yw dyn yn cymmeryd asyn a berthyn i’w gymmydog, ac yn ei gadw? Yr wyf yn dywedyd wrthych, nac ydyw; ni oddefa hyd y nod iddo bori gyda’i ddeadelloedd, eithr gyr ef ymaith, ac a’i bwria allan. Yr wyf yn dywedyd wrthych, mai felly y bydd yn eich plith chwithau, os na adnabyddwch yr enw wrth yr hwn y’ch gelwir. Gan hyny, mi a fynwn i chwi fod yn sicr a diysgog, ac helaethlawn yn wastadol mewn gweithredoedd da, fel y selier chwi gan Grist, yr Arglwydd Dduw Hollalluog, yn eiddo iddo ef, fel y dyger chwi i’r nef, ac y caffoch iachawdriaeth dragywyddol a bywyd annherfynol, trwy ddoethineb, a gallu, a chyfiawnder, a thrugaredd yr hwn a greodd bob peth, yn y nef ac ar y ddaear yr hwn sydd Dduw uwchlaw pawb. Amen."
            },
            "4": {
                "0": "A’r brenin Mosiah a berodd i’w bobl lafurio y ddaear. Ac efe ei hunan hefyd a lafuriodd y ddaear, fel trwy hyny na fyddai yn faich i’w bobl, fel y gwnelai megys y gwnaeth ei dad yn mhob peth. Ac ni fu amrafael yn mhlith ei bobl am yspaid tair blynedd."
            },
            "5": {
                "0": "Ac yn awr, pan orphenodd Ammon lefaru y geiriau hyn, y brenin a lawenychodd yn ddirfawr, ac a ddiolchodd i Dduw, gan ddywedyd, Diau fod dirgelwch mawr yn gynnwysedig ar y llafnau hyn, ac y mae yn ddiau fod y cyfieithwyr hyn wedi eu rhagbarotoi i’r dyben o egluro pob dirgelion o’r fath i blant dynion. O mor rhyfedd yw gweithredoedd yr Arglwydd, ac mor hir y goddefa gyda’i bobl; ïe, ac mor ddall ac annhreiddgar yw dealltwriaeth plant dynion, canys ni cheisiant ddoethineb, ac ni ddymunant iddi lywodraethu arnynt. Ië, y maent megys praidd gwylltion yn rhedeg oddiwrth y bugail, ac yn gwasgaru, ac yna yn cael eu gyru a’u dyfetha gan fwystfilod y goedwig."
            },
            "6": {
                "intro": "Cof-ysgrif Zeniff.—Hanes ei bobl, o’r amser y gadawsant dir Zarahemla, hyd yr amser y gwaredwyd hwynt o ddwylaw y Lamaniaid.",
                "0": "A bu i ni ddychwelyd drachefn i dir ein hunain, a’m pobl a ddechreuasant eilwaith ofalu am eu deadelloed, a thrin eu tir. Ac yn awr, gan fy mod innau yn hen, mi a roddais y deyrnas i un o’m meibion; am hyny, nid wyf yn dywedyd ychwaneg. A bydded i’r Arglwydd fendithio fy mhobl. Amen."
            },
            "7": {
                "0": "Ac yn awr, yr ydych yn cofio i mi ddywedyd wrthych, Na wna i ti ddelw gerfiedig, na llun dim a’r y sydd yn y nefoedd uchod, nac a’r y sydd ar y ddaear isod, nac a’r sydd yn y dwfr dan y ddaear. A thrachefn: Nac ymgryma iddynt, ac na wasanaetha hwynt; oblegid myfi yr Arglwydd dy Dduw, wyf Ddaw eiddigus, yn ymweled ag anwiredd y tadau ar y plant, hyd y drydedd a’r bedwaredd genedlaeth o’r rhai a’m cashant; ac yn gwneuthur trugaredd i filoedd o’r rhai a’m carant ac a gadwant fy nghorchymynion. Na chymmer enw yr Arglwydd dy Dduw yn ofer; canys nid dieuog gan yr Arglwydd yr hwn a gymmero ei enw ef yn ofer. Cofia y dydd Sabboth i’w santeiddio ef. Chwe diwrnod y gweithi, ac y gwnai dy holl waith: ond y seithfed dydd, Sabboth yr Arglwydd dy Dduw, na wna ddim gwaith, tydi, na’th fab, na’th ferch, na’th wasanaethwr, na’th wasanaethferch, na’th anifail, na’th ddyeithrddyn a fyddo o fewn dy byrth; o herwydd mewn chwe diwrnod y gwnaeth yr Arglwydd y nefoedd a’r ddaear, y môr, a’r hyn oll sydd ynddynt; ac a orphwysodd y seithfed dydd; am hyny, y bendithiodd yr Arglwydd y dydd Sabboth ac a’i santeiddiodd ef. Anrhydedda dy dad a’th fam, fel yr estyner dy ddyddiau ar y ddaear, yr hon y mae yr Arglwydd dy Dduw yn rhoddi i ti. Na ladd. Na wna odineb. Na ladrata. Na ddwg gam-dystiolaeth yn erbyn dy gymmydog. Na chwennych dŷ dy gymmydog, na chwennych wraig dy gymmydog, na’i wasanaethwr, na’i wasanaethferch, na’i ŷch, na’i asyn, na dim a’r sydd eiddo dy gymmydog."
            },
            "8": {
                "0": "Ac yn awr, dygwyddodd ar ol i Abinadi lefaru y geiriau hyn, iddo estyn ei law a dywedyd, Daw yr amser pan y caiff pawb weled iachawdwriaeth yr Arglwydd; pan y caiff pob cenedl, llwyth, iaith, a phobl, weled lygad yn lygad, a chyffesu gerbron Duw fod ei farnedigaethau ef yn gyfiawn; ac yna y drygionus a fwrir allan, a chant achos i ubain, wylofain, galaru, a rhineian eu dannedd; a hyn am na wrandawsant ar lais yr Arglwydd; am hyny, nid yw yr Arglwydd yn eu gwaredu, canys y maent yn gnawdol a chythreulig, ac y mae gan y diafol awdurdod arnynt; ïe, sef yr hen sarff hono a dwyllodd ein rhieni cyntaf, yr hyn oedd achos eu cwymp; yr hyn oedd yr achos i holl ddynolryw fyned yn gnawdol, yn anianol, yn gythreulig, gan adnabod y drwg oddiwrth y da, ac ymddarostwng i’r diafol. Felly yr aeth holl ddynolryw yn golledig; ac wele, buasent yn dragywyddol golledig, oni buasai i Dduw waredu ei bobl o’u sefyllfa golledig a syrthiedig. Eithr cofiwch, yr hwn sydd yn parhau yn ei anian gnawdol ei hun, ac yn myned ar hyd ffyrdd pechod a gwrthryfel yn erbyn Duw, a erys yn ei sefyllfa syrthiedig, ac y mae gan y diafol bob awdurdod arno. Am hyny, y mae efe megys pe na byddai prynedigaeth wedi ei gwneyd; gan fod yn elyn i Dduw; ac y mae y diafol hefyd yn elyn Duw. Ac yn awr, pe na ddaethai Crist i’r byd, gan lefaru am bethau i ddyfod, megys pe byddentwedi dyfod eisoes, nis gallai fod prynedigaeth. A phe na adgyfodai Crist oddiwrth y meirw, neu ddryllio rhwymau marwolaeth, fel na chaffai y bedd fuddugoliaeth, ac na chaffai angeu golyn, nis gallai fod adgyfodiad. Ond y mae adgyfodiad, gan hyny ni chafodd y bedd fuddugoliaeth, a cholyn angeu a lyncwyd i fyny yn Nghrist: Efe yw goleuni a bywyd y byd; ïe, goleuni ag sydd yn ddiddiwedd, nad ellir byth ei dywyllu; ïe, ac hefyd, fywyd yr hwn sydd yn ddiddiwedd, fel nas gall fod marwolaeth mwy. Hyd y nod y marwol hwn a wisga anfarwoldeb, a’r llygredig hwn a wisga anllygredigaeth, ac a ddygir i sefyll gerbron brawdle Duw, i gael eu barnu ganddo yn ol eu gweithredoedd, pa un bynag a fyddont ai da neu ddrwg. Os byddant dda, i adgyfodiad bywyd annherfynol a dedwyddwch; ac os byddant ddrwg, i adgyfodiad damnedigaeth annherfynol; gan fod wedi eu traddodi i’r diafol, yr hwn a’u darostyngodd hwynt, yr hyn yw damnedigaeth; wedi myned yn ol eu hewyllysiau a’u dymuniadau cnawdol eu hunain; heb alw erioed ar yr Arglwydd tra yr oedd breichiau trugaredd yn estynedig tuag atynt; canys breichiau trugaredd a estynwyd tuag atynt, ac nis mynent hwy; wedi eu rhybyddio am eu hanwireddau, ac etto ni ymadawent â hwynt; ac wedi eu gorchymyn i edifarhau, ac etto ni edifarhaent. Ac yn awr, ai ni ddylech grynu ac edifarhau am eich pechodau, a chofio mai yn a thrwy Grist yn unig y gellir eich achub? Gan hyny, os ydych yn dysgu cyfraith Moses, dysgwch hefyd ei fod yn gysgod o’r pethau hyny sydd i ddyfod; dysgwch hwynt fod prynedigaeth yn deillio trwy Grist yr Arglwydd, yr hwn yw y gwir Dad tragywyddol. Amen."
            },
            "9": {
                "0": "A bu i’r brenin Limhi, a llaweroedd o’i bobl, ddymuno cael eu bedyddio; eithr nid oedd neb yn y tir yn meddu awdurdod oddiwrth Dduw. Ac Ammon a wrthododd gyflawni hyn, gan ystyried ei hun yn was annheilwng; am hyny, ni ffurfiasant eu hunain yn eglwys yr amser hwnw, eithr dysgwyliasant wrth ysbryd yr Arglwydd. Yn awr, yr oeddynt yn chwennych bod megys Alma a’i frodyr, y rhai a ffoisant i’r anialwch. Chwennychent gael eu bedyddio, yn ddangosiad ac yn dystiolaeth eu bod yn foddlawn gwasanaethu Duw â’u holl galon; er hyny hwy a oedasant yr amser: a rhoddir hanes eu bedydd yn ol llaw. Ac yn awr, holl fyfyrdod Ammon a’i bobl, a’r brenin Limhi a’i bobl, oedd gwaredu eu hunain o ddwylaw y Lamaniaid, ac o gaethiwed."
            },
            "10": {
                "0": "A bu i bobl y brenin Limhi ymadael liw nos i’r anialwch, gyda eu da a’u defaid, ac a aethant oddiamgylch tir Shilom yn yr anialwch, ac a gyfeiriasant eu taith tua thir Zarahemla, gan gymmeryd eu harwain gan Ammon a’i frodyr. Ac yr oeddynt wedi cymmeryd eu holl aur, a’u harian, a’u pethau gwerthfawr, gymmaint a allant ddwyn; ac hefyd eu darpariadau, gyda hwynt i’r anialwch; a hwy a aethant yn mlaen ar eu taith. Ac wedi bod llawer o ddyddiau yn yr anialwch, cyrhaeddasant dir Zarahemla, ac a ymunasant â’r bobl yno, ac a ddaethant yn gyd-ddeiliaid. A bu i Mosiah eu derbyn hwynt gyda llawenydd; a derbyniodd hefyd eu cof-lyfrau hwy, ac hefyd y coflyfrau a gafwyd gan bobl Limhi. Ac yn awr, dygwyddodd pan wybu y Lamaniaid fod pobl Limhi wedi ymadael â’r tir yn y nos, iddynt ddanfou byddin i’r anialwch i’w hymlid hwynt; ac ar ol iddynt eu hymlid am ddau ddiwrnod, ni allent mwyach ddilyn eu hol; gan hyny, hwy a gollwyd yn yr anialwch."
            },
            "11": {
                "intro": "Hanes Alma a phobl yr Arglwydd, y rhai a yrwyd i’r anialwch ga bobl y brenin Noah.",
                "0": "Ac yn awr, dygwyddodd i Alma, o’r amser hwn allan, ynghyd â’r rhai oedd gydag Alma ar y pryd yr ymddangosodd yr angel iddynt, ddechreu dysgu y bobl, gan deithio oddiamgylch trwy yr holl wlad, a chyhoeddi wrth yr holl bobl y pethau oeddynt wedi glywed a gweled, a phregethu gair Duw mewn mawr drallod, gan gael eu herlid yn enbyd gan y rhai oeddynt yn anghredinwyr, a’u taraw gan lawer o honynt; ond er hyn oll, hwy a roddasant lawer o ddyddanwch i’r eglwys, gan gadarnhau eu ffydd, a’u hannog trwy hir-ymaros a lludded mawr, i gadw gorchymynion Duw. A phedwar o houynt oeddynt feibion Mosiah; a’u henwau oedd Ammon, ac Aaron, ac Omner, a Himni: dyna oedd enwau meibion Mosiah. A hwy a deithiasant trwy holl dir Zarahemla, ac yn mhlith yr holl bobl oedd dan deyrnasiad y brenin Mosiah, gan ymdrechu yn selog i ddileu yr holl niwed a wnaetheut i’r eglwys: gan gyffesu eu holl bechodau, a chyhoeddi yr holl bethau a welsent, ac egluro y prophwydoliaethau a’r ysgrythyrau wrth bawb a ewyllysient eu gwrandaw: ac felly buont yn offerynau yn llaw Duw, i ddwyn llaweroedd i wybodaeth o’r gwirionedd, ïe, i wybodaeth o’u Gwaredwr. Ac O, mor wynfydedig ydynt! Canys hwy a gyhoeddasant heddwch; hwy a fynegasant ddaioni; ac a gyhoeddasant wrth y bobl fod yr Arglwydd yn teyrnasu."
            },
            "12": {
                "0": "Yn awr, wedi i Mosiah orphen cyfieithu y eof-ysgrifau hyn, wele, yr oeddynt yn rhoddi hanes y bobl a ddinystriwyd, o’r amser y dinystriwyd hwynt, yn ol hyd at adeiladiad y twr mawr, yr amser y cymmysgodd yr Arglwydd iaith y bobl; a hwy a wasgarwyd ar hyd wyneb yr holl ddaear, ïe, ac hyd y nod o’r amser hwnw hyd greadigaeth Adda. Yn awr, yr hanes hwn a achosodd i bobl Mosiah alaru yn fawr; ïe, llanwyd hwynt gan dristwch; er hyny, cawsant lawer o wybodaeth drwyddynt, am yr hyn y llawenychent. A’r hanes hwn a ysgrifenir etto: canys, wele, y mae yn fuddiol i’r holl bobloedd gael gwybod y pethau sydd yn ysgrifenedig yn yr hanes hwn."
            },
            "13": {
                "0": "A bu i Mosiah farw hefyd, yn y drydedd flwyddyn ar ddeg ar hugain o’i deyrnasiad, gan fod yn dair blwydd a thrigain oed; gan wneuthur yn y cyfan bum cant a naw mlynedd o’r amser y gadawodd Lehi Jerusalem; ac felly y terfynodd teyrnasiad y breninoedd ar bobl nephi; ac felly y terfynodd dyddiau Alma, yr hwn oedd sylfaenydd eu heglwys."
            },
            "14": {},
            "15": {},
            "16": {},
            "17": {},
            "18": {},
            "19": {},
            "20": {},
            "21": {},
            "22": {},
            "23": {},
            "24": {},
            "25": {},
            "26": {},
            "27": {},
            "28": {},
            "29": {}
        }
    },
    "alma": {
        "meta": {
            "slug": "alma",
            "name": "Llyfr Alma,",
            "chapterWord": "Pennod Ⅰ."
        },
        "chapters": {
            "1": {
                "intro": "Hanes Alma, yr hwn oedd mab Alma y cyntaf, A Phrif Farnwr ar bobl Nephi, ac hefyd yr Archoffeiriad dros yr Eglwys. Hanes am deyrnasiad y Barnwyr, a’r rhyfeloedd a’r amrafaelion yn mhlith y bobl. Ac hefyd, hanes am ryfel rhwng y Nephiaid a’r Lamaniaid, yn ol cof-lyfr Alma y cyntaf, a’r Prif Farnwr.",
                "0": "Yn awr, dygwyddodd cyn pen llawer o ddyddiau ar ol y frwydr a ymladdwyd yn nhir Zarahemla, gan y Lamaniaid a’r Amliciaid, fod byddin arall o’r Lamaniaid wedi dyfod ar bobl Nephi yn yr un man ag y cyfarfu y fyddin gyntaf â’r Amliciaid. A bu i fyddin gael ei danfon i’w gyru hwynt allan o’u tir. Yn awr, gan fod Alma ei hun wedi ei gystuddio gan archoll, nid aeth i fyny i ryfel y waith hon yn erbyn y Lamaniaid; eithr efe a anfonodd fyddin liosog yn eu herbyn hwynt; a hwy a aethant i fyny ac a laddasant lawer o’r Lamaniaid, ac a yrasant y gweddill o honynt allan o gyffiniau eu tir; ac yna hwy a ddychwelasant drachefn, ac a ddechreuasant sefydlu heddwch yn y tir, gan na flinid hwy mwyach am dro gan eu gelynion. Yn awr, yr holl bethau hyn a wnaethwyd, ïe, yr holl ryfeloedd a’r amrafaelion hyn a ddechreuwyd ac a orphenwyd yn y bummed flwyddyn o deyrnasiad y Barnwyr; ac mewn un flwyddyn gyrwyd miloedd a degau o filoedd o eneidiau i’r byd tragywyddol, i fedi eu gwobr yn ol eu gweithredoedd, pa un bynag a fuont ai da neu dddrwg, i fedi dedwyddwch tragywyddol neu drueni tragywyddol, yn ol yr ysbryd y bu iddynt wrandaw ac ufyddhau iddo, pa un bynag ai ysbryd da neu un drwg; canys y mae pob dyn yn derbyn cyflog gan yr hwn y gwrandawodd ac yr ufyddhaodd iddo, a hyn yn ol geiriau ysbryd y brophwydoliaeth; am hyny, bydded yn ol y gwirionedd. Ac felly y terfyna y bummed flwyddyn o deyrnasiad y Barnwyr."
            },
            "2": {
                "0": "Ac yn awr, dygwyddodd i Alma, ar ol gweled cystuddiau canlynwyr addfwyn Duw, a’r erlidiau a gruglwythwyd arnynt gan weddill ei bobl, a gweled eu holl anghydraddoldeb, ddechreu fod yn drist iawn; er hyny, ni fethodd gael o ysbryd yr Arglwydd. Ac efe a ddewisodd ddyn doeth, yr hwn oedd yn mhlith henuriaid yr eglwys, ac a roddodd iddo ef awdurdod yn ol llais y bobl, fel y gallai gael a awdurdod i wneuthur cyfreithiau yn nnol â’r cyfreithiau ag oedd wedi eu rhoddi, ac i’w gosod mewn grym, yn ol drygioni a throseddau y bobl. Yn awr, enw y dyn hwn oedd Nephihah, ac efe a benodwyd yn brif farnwr; ac efe a eisteddodd ar yr orsedd farnol, i farnu a llywodraethu y bobl. Yn awr, ni roddodd Alma iddo ef y swydd o fod yn archoffeiriad dros yr eglwys, eithr efe a gadwodd y swydd o archoffeiriad iddo ef ei hun; ond efe a roddodd yr orsedd farnol i Nephihah; a hyn a wnaeth, fel y gallai efe ei hun fyned allan i blith ei bobl, neu i blith pobl Nephi, fel y pregethai air Duw wrthynt, er eu cynhyrfu i goffadwriaeth am eu dyledswydd, ac fel y tynai i lawr trwy air Duw, yr holl falehder a’r cyfrwysdra, a’r holl amrafaelion ag oedd yn mhlith ei bobl, gan weled nas gallai eu hadferu, ond trwy ddwyn tystiolaeth bur yn eu herbyn hwynt. Ac felly yn nechreu y nawfed flwyddyn o deyrnasiad y Barnwyr ar bobl Nephi, y rhoddodd Alma yr orsedd farnol i Nephihah, ac y cyfyngodd ei hun yn gwbl i archoffeiriadaeth urdd santaidd Duw, i dystiolaethu y gair, yn ol ysbryd dadguddiad a phrophwydoliaeth."
            },
            "3": {
                "intro": "Y geiriau a draddododd Alma, yr Archoffeiriad, yn ol urdd santaidd Duw, i’r bobl yn eu dinasoedd a’u pentrefi trwy y tir.",
                "0": "Ac yn awr, yr wyf fi, Alma, yn gorchymyn i chwi, yn iaith yr hwn a’m gorchymynodd i, gofio gwneuthur o honoch y geiriau a lefarais wrthych. Yr wyf yn llefaru mewn ffordd o orchymyn wrthych chwi y rhai a berthynwch i’r eglwys; ac wrth y rhai ni pherthynant i’r eglwys, yr wyf yn llefaru mewn ffordd o wahoddiad, gan ddywedyd, Deuwch, a bedyddier chwi i edifeirwch, fel y byddoch chwithau hefyd yn gyfranogion o ffrwyth pren y bywyd."
            },
            "4": {
                "0": "Ac yn awr, dygwyddodd ar ol i Alma wneuthur y trefniadau hyn, iddo ymadael oddi wrthynt, ïe, o’r eglwys ag oedd yn ninas Zarahemla, ac efe a aeth drosodd ar y tu dwyreiniol i afon Sidon, i ddyffryn Gideon, lle yr oedd dinas wedi ei hadeiladu yr hon a elwid dinas Gideon, yr hon oedd yn y dyffryn a elwid Gideon, yr hwn a elwid ar enw y dyn a laddwyd gan law Nehor â’r cleddyf. Ac Alma a aeth ac a ddechreuodd draethu gair Duw i’r eglwys oedd wedi ei sefyldlu yn nyffryn Gideon, yn ol dadguddiad gwirionedd y gair a lefarwyd gan ei dadau, ac yn ol ysbryd y brophwydoliaeth ag oedd ynddo, yn ol tystiolaeth Iesu Grist, Mab Duw, yr hwn a ddeuai i wared ei bobl oddiwirth eu pechodau, ac yn ol yr urdd santaidd wrth ba un ei galwyd. Ac felly y mae yn ysgrifenedig. Amen."
            },
            "5": {
                "intro": "Geiriau Alma, y rhai a draddododd wrth y bobl yn Gideon, yn ol ei gof-lyfr ef ei hun.",
                "0": "Ac yn awr, fy anwyl frodyr, mi a lefarais y geiriau hyn wrthych, yn ol yr ysbryd yr hwn a dystiolaetha ynof; ac y mae fy enaid yn mawr-lawenhau, o herwydd y mawr ddyfalwch a’r ystyriaeth a dalasoch i’m gair. Ac yn awr, tangnefedd Duw a orphwyso aranoch, ac ar eich tai a’ch tiroedd, ac ar eich da a’ch defaid, a’r hyn oll a feddwch; ac ar eich gwragedd a’ch plant, yn ol eich ffydd a’ch gweithredoedd da, o’r amser hwn allan ac yn dragywydd. Ac felly y llefarais. Amen."
            },
            "6": {
                "0": "A bu iddynt fyned allan, a dechreu pregethu a phrophwydo wrth y bobl, yn ol yr ysbryd a’r gallu a roddodd yr Arglwydd iddynt."
            },
            "7": {
                "intro": "Geiriau Alma, ac hefyd geiriau Amulek, y rhai a draethwyd wrth y bobl ag oedd yn nhir Ammonihah. Ac hefyd bwrir hwy yn ngharchar, ac a waredir gan allu gwyrthiol Duw yr hwn oedd ynddynt, yn ol cof-lyfr Alma.",
                "0": "A bu i Amulek fyned a sefyll, gan ddechreu pregethu wrthynt hefyd. Ac yn awr, nid yw geiriau Amulek wedi eu hysgrifenu oll, er hyny y mae rhan o’i eiriau yn ysgrifenedig yn y llyfr hwn."
            },
            "8": {
                "0": "Yn awr, wedi i Amulek orphen y geiriau hyn, y bobl a ddechreuasant synu drachefn, a Zeezrom hefyd a ddechreuodd grynu. Ac felly terfynodd geiriau Amulek, neu hyn yw yr oll a ysgrifenais i."
            },
            "9": {
                "0": "Ac yn awr, fy mrodyr, gan weled y gwyddom y pethau hyn, a’u bod yn wir, edifarhawn, ac na chaledwn ein calonau, fel ua chynhyrfom yr Arglwydd ein Duw i ollwng ei ddigofaint arnom yn ei ail orchymynion hyn, y rhai a roddodd efe i ni; eithr awn i mewn i orphwysfa Duw, yr hon sydd wedi ei pharotoi yn ol ei air. A thrachefn, fy mrodyr, mi a ewyllysiwn alw eich meddyliau at yr amser y rhoddodd yr Arglwydd Dduw y gorchymynion hyn i’w blant; ac mi a ewyllysiwn i chwi gofio i’r Arglwydd Dduw ordeinio offeiriaid, yn ol ei urdd santaidd ef, yr hwn oedd yn ol urdd ei Fab, i ddysgu y pethau hyn i’r bobl; a’r offeiriaid hyny a ordeiniwyd yn ol urdd ei Fab, mewn dull ag y gallai y bobl trwyddo wybod yn mha fodd i edrych at ei Fab am waredigaeth. A dyma y dull yn ol pa un yr ordeiniwyd hwynt: wedi eu galw a’u rhagbarotoi er seiliad y byd, yn ol rhagwybodaeth Duw, ar gyfrif eu ffydd fawr a’u gweithredoedd da; yn y lle cyntaf wedi eu gadael i ddewis da neu ddrwg; gan hyny, wedi dewis da, ac ymarfer ffydd fawr, hwy a alwyd â galwedigaeth santaidd, ïe, â’r alwedigaeth santaidd hono a barotowyd gyda, ac yn ol, prynedigaeth ddarpariadol i’r cyfryw; ac felly galwyd hwy i’r alwedigaeth santaidd hon ar gyfrif eu ffydd, tra y gwrthodai ereill ysbryd Duw ar gyfrif caledwch eu calonau a dallineb eu meddyliau, pan y gallent, oni bai hyn, fod wedi cael cymmaint braint â’u brodyr. Neu, yn fyr: yr oeddynt yn y lle cyntaf yn yr un sefyllfa â’u brodyr; felly yr oedd yr alwedigaeth santaidd hon wedi ei rhagbarotoi er seiliad y byd i’r cyfryw na chaledent eu calonau, gan fod yn a thrwy iawn yr unig-anedig Fab, yr hwn a ragbarotowyd; ac felly wedi eu galw trwy yr alwedigaeth santaidd hon, a’u hordeinio i archoffeiriadaeth urdd santaidd Duw, i ddysgu ei orchymynion i blant dynion, fel y gallent hwythau hefyd fyned i mewn i’w orphwysfa ef, gan fod yr archoffeiriadaeth hon yn ol urdd ei Fab, yr hwn urdd oedd er seiliad y byd: neu mewn geiriau ereill, heb ddechreu dyddiau na diwedd blynyddoedd, wedi ei ragbarotoi o dragywyddoleb i bob tragywyddoldeb, yn ol ei ragwybodaeth ef am bob peth. Yn awr, yr oeddynt wedi eu hordeinio yn y modd hyn: Wedi eu galw â galwedigaeth santaidd, a’u hordeinio ag ordeiniad santaidd, ac wedi cymmeryd arnynt archoffeiriadaeth yr urdd santaidd, yr hyn alwedigaeth, ac ordeiniad, ac arachoffeiriadaeth, sydd heb ddechreu na diwedd; felly y daethant yn archoffeiriaid yn dragywydd, yn ol urdd y Mab, unig-anedig y Tad, yr hwn sydd heb ddechreu dyddiau na diwedd blynyddoedd, yr hwn sydd yn llawn gras, uniondeb, a gwirionedd. Ac felly y mae. Amen."
            },
            "10": {
                "0": "A bu i Alma ac Amulek, gan fod Amulek wedi gadael ei holl aur, a’i arian, a’i bethau gwerthfawr, y rhai oeddynt yn nhir Ammonihah, er mwyn gair Duw, ac wedi cael ei wrthod gan y rhai a fu yn gyfeillion iddo unwaith, ac hefyd gan ei dad a’i berthynasau; gan hyny, ar ol i Alma sefydlu yr eglwys yn Sidom, a gweled attaliad mawr, ïe, gan weled fod y bobl wedi eu hattal gyda golwg ar falchder eu calonau, ac yn dechreu ymostwng gerbron Duw, a dechreu ymgynnull ynghyd yn eu cyssegrfeydd i addoli Duw gerbon yr allor, gan wylio a gweddio yn wastadol, fel y gwaredid hwynt rhag satan, rhag marwolaeth, a rhag dinystr;—ac yn awr, megys ag y dywedais, ar ol i Alma weled yr holl bethau hyn, am hyny, efe a gymmerth Amulek ac a ddaeth drosodd i dir Zarahemla, ac a’i cymmerodd i’w dŷ ei hun, ac a weinodd iddo yn ei gystuddiau, ac a’i cryfhaodd yn yr Arglwydd. Ac felly y terfynodd y ddegfed flwyddyn o deyrnasiad y Barnwyr ar bobl Nephi."
            },
            "11": {
                "0": "Yn awr, yr offeiriaid hyny a aethent i blith y bobl, a bregethasant yn erbyn pob celwydd, a thwyll, a chenfigen, ac amryson, a malais, a chabledd, a lladrad, yspeiliad, anhraith, llofruddiaeth, godineb, a phob math o drythyllwch, gan floeddio na ddylai y pethau hyn fod felly; gan draethu pethau sydd i ddyfod ar fyrder; ïe, traethu am ddyfodiad Mab Duw, ei ddyoddefiadau a’i farwolaeth, ac hefyd adgyfodiad y meirw. A llawer o’r bobl a ymofynasant am y lle y denai Mab Duw; a dysgwyd hwynt yr ymddangosai efe iddynt ar ol ei adgyfodiad; a hyn a wrandawodd y bobl gyda llawenydd a gorfoledd mawr. Ac yn awr, ar ol i’r eglwys gael ei sefydlu trwy yr holl dir, wedi buddugoliaethu ar y diafol, a gair Duw wedi ei bregethu yn ei burdeb trwy yr holl dir, a’r Arglwydd yn tywallt ei feudithion ar ei bobl; ac felly y terfynodd y bedwaredd flwyddyn ar ddeg o deyrnasiad y Barnwyr ar bobl Nephi."
            },
            "12": {
                "intro": "Hanes meibion Mosiah, y rhai a wrthodasant eu hawl i’r deyrnas er mwyn gair Duw, ac a aethant i fyny i dir Nephi, i bregethu i’r Lamaniaid. Eu dyoddefiadau a’u gwaredigaeth, yn ol cof-lyfr Alma.",
                "0": "A bu i Ammon a Lamoni fyned rhagddynt ar eu taith tua thir Middoni. A Lamoni a gafodd ffafr yn ngolwg brenin y tir; am hyny, brodyr Ammon a ddygwyd allan o’r carchar. A phan gyfarfu Ammon â hwynt, yr oedd yn dra thrist, canys wele, yr oeddynt yn noethion, a’u croen wedi treulio llawer, trwy fod yn rhwym wrth reffynau cryfion. Ac yr oeddynt hefyd wedi dyoddef newyn, syched, a phob math o gystuddiau; er hyny, buont amyneddgar yn eu holl ddyoddefiadau. Ac megys y dygwyddodd, eu rhan hwy oedd syrthio i ddwylaw pobl mwy caled a gwrthnysig; gan hyny ni wrandawent ar eu geiriau, ac yr oeddynt wedi eu bwrw allan, ac wedi eu taraw, a’u gyru o dŷ i dŷ, ac o le i le, hyd nes y cyrhaeddasant dir Middoni; ac yno cymmerwyd, a bwriwyd hwy yn ngharchar, a rhwymwyd hwynt â rheffynau cryfion, a chadwyd hwynt yn ngharchar am ddyddiau lawer, ac a waredwyd gan Lamoni ac Ammon."
            },
            "13": {
                "intro": "Hanes am bregethu Aaron, a Muloki, a’u brodyr, wrth y Lamaniaid.",
                "0": "A dygwyddodd fod y Nephiaid wedi poblogi tir Llawnder, hyd y nod o’r môr dwyreiniol i’r un gorllewinol, ac felly yr oedd y Nephiaid yn eu doethineb, gyda’u gwarchodlu a’u byddinoedd, wedi eu hamgau hwynt yn y deau, fel na allent gael rhagor o feddiant yn y gogledd, rhag iddynt ymdaenu dros y tir gogleddol; am hyny, ni allai y Lamaniaid gael rhagor o etifeddiaethau ond yn unig yn nhir Nephi, a’r anialwch oddiamgylch. Yn awr, yr oedd hyn yn ddoethineb yn y Nephiaid, gan fod y Lamaniaid yn elynion iddynt hwy, fel nas dyoddefent eu cystuddiau o bob tu, ac hefyd fel y gallent gael gwlad i ffoi iddi, yn ol eu dymuniadau. Ac yn awr, wedi dywedyd hyn, mi a ddychwelaf drachefn at hanes Ammon ac Aaron, Omner a Himni, a’u brodyr."
            },
            "14": {
                "0": "A bu ar ol i Ammon ddywedyd y geiriau hyn, i’w frawd Aaron ei geryddu ef, gan ddywedyd, Ammon, yr wyf yn ofni fod dy lawenydd yn dy arwain i ymffrostio; eithr Ammon a ddywedodd wrtho, Nid wyf yn ymffrostio yn fy nerth fy hun, nac yn fy noethineb fy hun; ond wele, mae fy llawenydd yn gyflawn, ïe, mae fy nghalon yn orlawn o orfoledd, ac mi a orfoleddaf yn fy Nuw; ïe, mi a wn nad wyf fi ddim; gyda golwg ar fy nerth i, yr wyf yn wan; am hyny, ni ymnrostiaf am fy hun, eithr mi a ymffrostiaf am fy Nuw, canys yn ei nerth gallaf gyflawni pob peth; ïe, wele, llawer o wyrthiau galluog a gyflawnasom yn y tir hwn, am yr hyn y moliannwn ei enw yn dragywydd. Wele, gynnifer o filoedd o’n brodyr a ryddhaodd efe o boenau uffern; a hwy a ddygwyd i ganu cariad gwaredigol, a hyn o herwydd gallu ei air, yr hwn oedd ynom; am hyny, ai nid oes genym achos mawr i orfoleddu? Ië, yr oeddynt wedi eu hamgylchynu gan dywyllwch a dinystr tragywyddol; eithr, wele, efe a’u dygodd i’w dragywyddol oleuni, ïe, i iachawdwriaeth dragywyddol; a hwy a amgylchynir ag haelioni digyffelyb ei gariad; ïe, a nyni a fuom yn offerynau yn ei ddwylaw i gyflawni y gwaith mawr a rhyfedd hwn; am hyny, gorfoleddwn, ïe, ni a orfoleddwn yn yr Arglwydd; ïe, ni a lawenychwn, canys y mae ein llawenydd yn gyflawn; ïe, ni a foliannwn ein Duw yn dragywydd. Wele, pwy a all orfoleddu yn ormodol yn yr Arglwydd? Ië, pwy a all ddywedyd gormod am ei fawr allu, a’i drugaredd, a’i hir-ymaros tuag at blant dynion? Wele, meddaf wrthych, nis gallaf fynegi y rhan leiaf o’r hyn a deimlaf. Pwy allai feddwl y buasai ein Duw mor drugarog â’n cipio ni o’n sefyllfa enbyd, bechadurus, ac halogedig? Wele, ni a aethom allan mewn digter, gyda bygythion mawrion i ddinystrio ei eglwys. O, ynte, paham na fwriodd ni i ddinystr dychrynllyd? ïe, paham na adawodd i gleddyf ei gyfiawnder i syrthio arnom, a’n dedfrydu i anobaith tragywyddol? O, fy enaid, braidd na eheda, fel pe byddai, wrth y meddwl. Wele, ni ddefnyddiodd efe ei gyfiawnder tuag atom, eithr yn ei fawr drugaredd dygodd ni dros y gagendor dragywyddol hono o farwolaeth a thrueni, hyd at iachawdwriaeth ein heneidiau. Ac yn awr, fy mrodyr, pa ddyn anianol sydd a ŵyr y pethau hyn, oddieithr yr edifeiriol: ïe, yr hwn a edifarhao ac a weithredo ffydd, ac a ddwg allan weithredoedd da, gan weddio o hyd yn ddibaid: i’r cyfryw y rhoddir i wybod dirgelion Duw; ïe, i’r cyfryw y rhoddir i ddadguddio pethau na ddadguddiwyd erioed; ïe, a rhoddir i’r cyfryw i ddwyn miloedd o eneidiau i edifeirwch, megys ag y rhoddwyd i ninnau i ddwyn ein brodyr hyn i edifeirwch. Yn awr, a ydych chwi yn cofio, fy mrodyr, i ni ddywedyd wrth ein brodyr yn nhir Zarahemla, Yr ydym ni yn myned i fyny i dir Nephi, i bregethu i’n brodyr y Lamaniaid, a hwy a’n gwawdiasant? Oblegid dywedasant wrthym, A ydych chwi yn tybied y gellwch ddwyn y Lamaniaid i wybodaeth o’r gwirionedd? A ydych chwi yn tybied y gellwch argyhoeddi y Lamaniaid o anghywirdeb traddodiadau eu tadau, pobl mor wargaled ag ydynt hwy; y rhai sydd â’u calonau yn ymhyfrydu mewn tywallt gwaed, a’u dyddiau wedi eu treulio yn y drygioni ffieiddiaf, a’u ffyrdd yn ffyrdd troseddwr o’r dechreuad? Yn awr, fy mrodyr, yr ydych yn cofio mai hyn oedd eu lleferydd. Ac yn mhellach, dywedent, Cymmerwn arfau i fyny yn eu herbyn, fel y dyfethom hwynt a’u drygioni allan o’r tir, rhag iddynt hwy ein goresgyn ni a’n dyfetha. Eithr wele, fy anwyl frodyr, ni ddaethom ni i’r anialwch gyda bwriad i ddyfetha ein brodyr, ond gyda bwriad y gallem efallai achub rhyw nifer o’u heneidiau. Yn awr, pan oedd ein calonau wedi llwfrhau, a ninnau ynghylch troi yn ol, wele, yr Arglwydd a’n cysurodd, ac a ddywedodd. Ewch i blith eich brodyr y Lamaniaid, a dyoddefwch eich cystuddiau gydag amynedd, ac mi a roddaf i chwi lwyddiant. Ac yn awr, wele, ni a ddaethom, ac a fuom yn eu plith hwynt; ac ni a fuom yn amyneddgar yn ein dyoddefiadau, ac a ddyoddefasom bob amddifadrwydd; ïe, ni a deithiasom o dŷ i dŷ, gan ymddibynu ar drugaredd y byd; nid ar drugaredd y byd yn unig, eithr ar drugaredd Duw. Ac ni a aethom i mewn i’w tai ac a’u dysgasom hwynt, a dysgasom hwynt yn eu heolydd; ïe, a dysgasom hwynt ar eu mynyddau; ac hefyd ni a aethom i’w temlau a’u synagogau, ac a’u dysgasom; a chawsom ein bwrw allan, a’n gwatwar, a phoeri arnom, a’n cernodio; a chawsom ein lluchio â cheryg, a’n cymmeryd a’n rhwymo â rheffynau cryfion; a’n bwrw yn ngharchar; a thrwy allu a doethineb Duw gwaredwyd ni drachefn; a dyoddefasom bob math o gystuddiau, a hyn oll, fel ysgatfydd y buasem yn foddion i achub rhyw enaid; a meddyliasom y buasai ein llawenydd yn gyflawn, pe gallem ysgatfydd fod yn foddion i achub rhai. Yn awr, wele, gallwn edrych a gweled ffrwythau ein llafur: ac a ydynt yn ychydig? Yr wyf yn dywedyd wrthych, nac ydynt, y maent yn llawer; ïe, a gallwn weled eu cywirdeb, o herwydd eu cariad tuag at eu brodyr, ac hefyd tuag atom ninnau. Canys, wele, dewisant aberthu eu bywydau, yn hytrach nâ chymmeryd bywyd eu gelyn; ac y maent wedi claddu eu harfau rhyfel yn ddwfn yn y ddaear, o herwydd eu cariad tuag at eu brodyr. Ac yn awr, wele, meddaf wrthych, a fu cariad mor fawr yn yr holl dir? Wele, meddaf wrthych, naddo, ddim hyd y nod yn mysg y Nephiaid. Canys wele cymmerent hwy arfau i fyny yn erbyn eu brodyr; ni oddefent i’w hunain gael eu lladd. Eithr wele, pa gynnifer o’r rhai hyn a roddasant eu bywydau i lawr; ac ni a wyddom eu bod hwy wedi myned at eu Duw, o herwydd eu cariad, a’u casineb at bechod. Yn awr, ai nid oes genym achos i orfoleddu? Ië, yr wyf yn dywedyd wrthych, ni fu dynion erioed â chymmaint o achos ganddynt i orfoleddu â ni, er dechreuad y byd; ïe, ac y mae fy llawenydd yn cael ei arwain hyd y nod i ymffrostio yn fy Nuw; oblegid ganddo ef y mae pob gallu, pob doethineb, a phob dealltwriaeth; y mae yn amgyffred pob peth, ac y mae yn Fod trugarog, hyd at iachawdwriaeth y rhai a edifarhant ac a gredant yn ei enw. Yn awr, os ymffrostio yw hyn, felly yr ymffrostiaf fi; canys hyn yw fy mywyd a’m goleuni, fy llawenydd a’m hiachawdwriaeth, a’m gwaredigaeth rhag gwae tragywyddol. Ië, bendigedig yw enw fy Nuw, yr hwn a ofalodd am y bobl hyn, y rhai ydynt gangen o bren Israel, ac a fu ar goll oddiwrth ei chyff mewn gwlad ddyeithr; ïe, meddaf, bendigedig fyddo enw fy Nuw, yr hwn a ofalodd am danom ni, bererinion mewn gwlad ddyeithr. Yn awr, fy mrodyr, gwelwn fod Duw yn gofalu am bob pobl, yn mha wlad bynag y byddont ynddi; ïe, y mae efe yn cyfrif ei bobl, ac y mae ei ymysgaroedd o drugaredd dros yr holl ddaear. Yn awr, hyn yw fy ngorfoledd i, a’m diolchgarwch mawr; ïe, ac mi a ddiolchaf i’m Duw yn dragywydd. Amen."
            },
            "15": {
                "0": "Ac yn awr, caniatäed Duw i’m brodyr hyn, iddynt gael eistedd i lawr yn nheyrnas Dduw; ïe, ac hefyd yr holl rai ag ydynt yn ffrwyth en llafur, fel nad elont allan mwyach, eithr fel y moliannont ef yn dragywydd. A chaniatäed Duw i hyn gymmeryd lle yn ol fy ngeiriau, ïe, megys y llefarais. Amen."
            },
            "16": {
                "0": "A phobl Ammon a ymadawsant o dir Jershon, ac a ddaethant drosodd i dir Melek, ac a roddasant le yn nhir Jershon i fyddinoedd y Nephiaid, fel yr ymladdent â byddinoedd y Lamaniaid, a byddinoedd y Zoramiaid; ac felly y dechreuodd rhyfel rhwng y Lamaniaid a’r Nephiaid, yn y ddeunawfed flwyddyn o deyrnasiad y Barnwyr; a rhoddir hanes am eu rhyfeloedd yn ol llaw. Ac Alma, ac Ammon, a’u brodyr, ac hefyd dau fab Alma, a ddychwelasant i dir Zarahemla, ar ol bod yn offerynau yn nwylaw Duw i ddwyn llaweroedd o’r Zoramiaid i edifeirwch; a chynnifer ag a ddygwyd i edifeirwch, a yrwyd allan o’u tir; eithr y mae ganddynt diroedd yn etifeddiaeth yn nhir Jershon, ac y maent wedi cymmeryd arfau i amddiffyn eu hunain, a’u gwragedd, a’u plant, a’u tiroedd. Yn awr, Alma, gan fod yn ofidus oblegid anwiredd ei bobl, ïe, oblegid y rhyfeloedd, a’r tywallt gwaed, a’r amrafaelion ag oedd yn eu mysg; ac wedi bod yn traethu y gair, neu wedi danfon i draethu y gair, yn mhlith yr holl bobl yn mhob dinas; a chan weled fod calonau y bobl yn dechreu ymgaledu, a’u bod yn dechreu cymmeryd eu tramgwyddo o herwydd manylrwydd y gair, yr oedd ei galon yn drist iawn; am hyny, efe a achosodd i’w feibion ymgynnull ynghyd, fel y gallai roddi i bob un o honynt ei orchymyn, ar wahan, ynghylch y pethau a berthynent i iachawdwriaeth. Ac y mae genym hanes ei orchymynion, y rhai a roddodd iddynt yn ol ei gof-lyfr ef ei hun."
            },
            "17": {
                "intro": "Gorchymynion Alma, i’w fab Helaman.",
                "0": "O, fy mab, na fydded ein bod yn ddiog, o herwydd rhwyddineb y ffordd; canys felly yr oedd gyda’n tadau; canys felly y parotowyd iddynt hwy, fel os edrychent, y gallent fyw; felly hefyd y mae gyda ninnau. Mae y ffordd wedi ei pharotoi, ac os bydd i ni edrych, gallwn fyw yn dragywydd. Ac yn awr, fy mab, edrych dy fod yn cymmeryd gofal o’r pethau santaidd hyn; ïe, gwel dy fod yn edrych at Dduw, a byw. Dos at y bobl hyn, a thraetha y gair, a bydd sobr. Fy mab, ffarwel."
            },
            "18": {
                "intro": "Gorchymynion Alma i’w fab Shiblon.",
                "0": "A bu i mi fod dri niwrnod a thair noson yn y poenau mwyaf ac mewn ingoedd enaid; ac erioed, hyd nes y gwaeddais ar yr Arglwydd Iesu Grist am durgaredd, nis derbyniais fadeuant o’m pechodau. Eithr, wele, mi a waeddais arno, a chefais heddwch i’m henaid. Ac yn awr, fy mab, mi a fynegais hyn wrthyt, fel y dysgot ddoethineb, ac y dysgot genyf fi nad oes ffordd na moddion ereill, trwy y rhai y gall dyn gael ei achub, ond yn unig yn a thrwy Grist. Wele, efe yw bywyd a goleuni y byd. Wele, efe yw gair y gwirionedd a chyfiawnder. Ac yn awr, megys ag yr wyt wedi dechreu dysgu y gair, felly hefyd mi a ewyllysiwn i ti barhau i ddysgu; ac mi a fynwn i ti fod yn ddiwyd a chymmedrol yn mhob peth. Edrych na ymddyrchafech mewn balchder; ïe, edrych na ymffrostiech yn dy ddoethineb dy hun, nac yn dy gawr nerth; ymarfer eofndra, ond nid traws-arglwyddiaeth; ac edrych hefyd dy fod yn ffrwyno dy holl nwydau, fel y’th lanwer â chariad; edrych dy fod yn ymgadw rhag segurdod; na weddia fel y gwna y Zoramiaid, canys gwelaist eu bod hwy yn gweddio er mwyn cael eu clywed gan ddynion, a’u canmawl am eu doethineb. Na ddywed, O Dduw, yr wyf yn diolch i ti, ein bod ni yn well nâ’n brodyr; eithr yn hytrach dywed, O Arglwydd, maddeu fy annheilyngdod, a chofia am fy mrodyr mewn turgaredd; ïe, cydnabydda dy annheilyngdod gerbron Duw bob amser. A bydded i’r Arglwydd fendithio dy enaid, a’th dderbyn yn y dydd diweddaf i’w deyrnas, i eistedd mewn heddwch. Yn awr, dos, fy mab, a dysga y gair i’r bobl hyn. Bydd sobr. Fy mab, ffarwel."
            },
            "19": {
                "intro": "Gorchymynion Alma i’w fab Corianton.",
                "0": "Ac yn awr, fy mab, yr wyf yn canfod fod rhywbeth yn mhellach yn blino dy feddwl, yr hyn ni elli ei ddeall, ag sydd o berthynas i gyfiawnder Duw, yn nghospedigaeth y pechadur: canys yr wyt ti yn ceisio meddwl mai anghyfiawnder yw fod y pechadur yn cael ei draddodi i gyflwr o drueni. Yn awr, wele, fy mab, mi a egluraf y peth hwn i ti: canys, wele, ar ol i’r Arglwydd Dduw anfon ein rhieni cyntaf allan o ardd Eden, i lafurio y ddaear, o ba un y cymmerwyd hwynt; ïe, efe a gymmerodd y dyn allan, ac a osododd yn y cwr dwyreiniol o Eden, gerubiaid, a chleddyf tanllyd yn troi bob ffordd, i gadw pren y bywyd. Yn awr, gwelwn fod dyn wedi dyfod megys Duw, yn gwybod da a drwg; a rhag iddo estyn allan ei law, a chymmeryd hefyd o bren y bywyd, a bwyta, a byw yn dragywydd, yr Arglwydd Dduw a osododd gerubiaid, a chleddyf tanllyd, fel na chyfranogai o’r ffrwyth; ac felly gwelwn fod amser wedi ei roddi i ddyn, i edifarhau, ïe, amser ymbrawf, amser i edifarhau a gwasanaethu Duw. Canys, wele, pe buasai Adda wedi gosod allan ei law yn uniongyrchol, a chyfranogi o bren y bywyd, efe a fyddai fyw yn dragywydd, yn ol gair Duw, heb gael dim amser i edifarhau; ïe, c hefyd, buasai gair Duw yn ofer, a buasai cynllun mawr yr iachawdwriaeth yn cael ei rwysro. Eithr wele, penodwyd i ddyn farw; am hyny, gan iddynt hwy gael eu tori ymaith oddiwrth bren y bywyd, hwy a gaent eu tori ymaith oddiar wyneb y ddaear; ac aeth dyn yn golledig yn dragywydd; ïe, aethant yn ddyn syrthiedig. Ac yn awr, gwelwn wrth hyn, i’n rhieni cyntaf gael eu tori ymaith yn dymmorol ac ysbrydol, o bresennoldeb yr Arglwydd; ac felly gwelwn iddynt ddyfod yn ddarostyngedig i ddilyn eu hewyllys eu hunain. Yn awr, wele, nid yw yn fuddiol i ddyn gael ei achub oddiwrth y farwolaeth dymmorol hon, canys dinystriai hyny y cynllun mawr o ddedwyddwch: am hyny, gan nas gallai yr enaid byth farw, a bod y cwymp wedi dwyn ar holl ddynolryw farwolaeth ysbrydol, yn gystal a thymmorol; hyny yw, torwyd hwynt ymaith o bresennoldeb yr Arglwydd; yr oedd yn fuddiol i ddynolryw gael eu gwaredu o’r fawolaeth ysbrydol hon; am hyny, gan iddynt fyned yn gnawdol, anianol, a dieflig, wrth natur, daeth y sefyllfa ymbrawf hon yn sefyllfa iddynt i ymbarotoi: daeth yn sefyllfa barotoiadol. Ac yn awr, cofia, fy mab, oni buasai y cynllun o brynedigaeth (gan ei osod o’r neilldu), mor fuan ag y byddent feirw, buasai eu heneidiau yn myned yn druenus, gan gael eu troi ymaith o bresennoldeb yr Arglwydd. Ac yn awr, nid oedd modd i adferu dynion o’r sefyllfa syrthiedig hon ag oedd dyn wedi ei dwyn arno ei hun, o herwydd ei anufydd-dod ei hunan; am hyny, yn ol cyfiawnder, nis gallai y cynllun o brynedigaeth gael ei ddwyn oddiamgylch, ond yn unig ar yr ammodau o edifeirwch dynion yn y sefyllfa hon o ymbrawf; ïe, y sefyllfa barotoiadol hon: canys oni bai yr ammodau hyn, nis gallai trugaredd effeithio heb ddinystrio gwaith cyfiawnder. Yn awr, nis gallai gwaith cyfiawnder gael ei ddinystrio: pe felly, peidiai Duw a bod yn Dduw. Ac felly gwelwn fod holl ddynolryw yn syrthiedig, ac yn ngafael cyfiawnder; ïe, cyfiawnder Duw, yr hwn a’i trosglwyddodd i gael eu troi ymaith am byth o’i bresennoldeb. Ac yn awr, nis gallai y cynllun o drugaredd gael ei ddwyn oddiamgylch, oddieithr i iawn gael ei gwneuthur: am hyny, y mae Duw ei hun yn rhoddi iawn dros bechodau y byd, i ddwyn oddiamgylch y cynllun o drugaredd, i foddloni gofynion cyfiawnder, fel y gallai Duw fod yn Dduw perffaith a chyfiawn, ac yn Dduw trugarog hefyd. Yn awr, nis gallai edifeirwch ddyfod i ddynion, oddieithr fod cosp, yr hon oedd hefyd yn dragywyddol megys y mae bywyd yr enaid, wedi ei chyssylltu yn gyferbyniol i’r cynllun o ddedwyddwch, yr hwn oedd mor dragywyddol hefyd a bywyd yr enaid. Yn awr, pa fodd y gallai dyn edifarhau, oddieithr iddo bechu? Pa fodd y gallai bechu, pe na byddai cyfraith? Pa fodd y gallai fod cyfraith, oddieithr fod cosp? Yn awr, yr oedd cosp wedi ei chyssylltu, a chyfraith gyfiawn wedi ei rhoddi, yr hyn a ddygodd gnofeydd cydwybod i ddyn. Yn awr, pe na fyddai cyfraith wedi ei rhoddi,—pe llofruddiai dyn, efe a gai farw, a fyddai efe yn ofni y cai farw pe llofruddiai? Ac hefyd, pe na fyddai cyfraith wedi ei rhoddi yn erbyn pechod, ni fuasai dynion yn ofni pechu. A phe na roddid cyfraith pan bechai dynion, pa peth allai cyfiawnder wneuthur, na thrugaredd ychwaith: canys ni allent gael un hawl ar y creadur. Eithr y mae cyfraith wedi ei rhoddi, a chosp wedi ei chyssylltu, ac edifeirwch wedi ei ganiatau; yr hwn edifeirwch, y mae trugaredd yn hawlio; pe amgen, mae cyfiawnder yn hawlio y creadur, ac yn gweinyddu y gyfraith, ac y mae’r gyfraith yn rhoddi y gosp; pe nid felly, cawsai gweithredoedd cyfiawnder eu dinystrio, a pheidiai Duw a bod yn Dduw. Eithr nid yw Duw yn peidio bod yn Dduw, dyfod trwy yr iawn; ac y mae’r iawn yn dwyn oddiamgylch adgyfodiad y meirw: ac y mae adgyfodiad y meirw yn dwyn dynion yn ol i bresennoldeb Duw; ac felly y dychwelir hwynt i’w bresennoldeb, i gael eu barnu yn ol eu gweithredoedd, yn ol y gyfraith a chyfiawder; canys, wele, y mae cyfiawnder yn ymarfer ei holl ofynion, ac hefyd y mae trugaredd yn hawlio yr hyn oll a berthyn iddi hithau; ac felly, nid oes neb ond y gwir edifeiriol yn cael ei achub. Beth, a ydych chwi yn tybied y gall trugaredd yspeilio cyfiawnder? Yr wyf yn dywedyd wrthyt, nas gall; ddim un mymryn. Os felly, peidiai Duw a bod yn Dduw. Ac felly y mae Duw yn dwyn oddiamgylch ei fwriadau mawr a thragywyddol, y rhai a barotowyd er seiliad y byd. Ac felly y daw oddiamgylch iachawdwriaeth a phrynedigaeth dyn, ac hefyd eu dystryw a’u trueni; am hyny, O fy mab, gall pwy bynag a ewyllysio, ddyfod, a chyfranogi o ddyfroedd y bywyd yn rhad; a phwy bynag ni ewyllysio ddyfod, y cyfryw ni orfodir i ddyfod; eithr yn y dydd diweddaf, adferir iddo ef, yn ol ei weithredoedd. Os yw wedi ewyllysio gwneuthur drwg, ac heb edifarhau yn ei ddyddiau, wele, iddo ef y gwneir drwg, yn ol adferiad Duw. Ac yn awr, fy mab, yr wyf yn dymuno na adawi i’r pethau hyn flino dy feddwl yn hwy, a gadael i’th bechodau yn unig dy flino, a’r blinder hwnw a’th ddarostynga i edifeirwch. O fy mab, yr wyf yn dymuno na wadi gyfiawnder Duw mwyach. Na cheisia esgusodi dy hun yn y pwynt lleiaf, o herwydd dy bechodau, trwy wadu cyfiawnder Duw, eithr gad i gyfiawnder Duw, a’i drugaredd, a’i hir-amynedd, gael rheolaeth gyflawn yn dy galon, a gad iddo dy ddarostwng i’r llwch mewn gostyngeiddrwydd. Ac yn awr, fy mab, ti a alwyd gan Dduw i bregethu y gair i’r bobl hyn; ac yn awr, dos i’th ffordd, a thraetha y gair mewn gwirionedd a sobrwydd, fel y gelli ddwyn eneidiau i edifeirwch, fel y gallo y cynllun mawr o drugaredd gael hawl arnynt. A bydded i Dduw ganiatau i ti yn ol fy ngeiriau. Amen."
            },
            "20": {
                "0": "Yn awr, dygwyddodd fod Zerahemnah yn dra digllawn, ac efe a gynhyrfodd y gweddill o’i filwyr i ddigofaint, er ymladd yn fwy galluog yn erbyn y Nephiaid. Ac yn awr, yr oedd Moroni yn ddigllawn, o herwydd cyndynrwydd y Lamaniaid; am hyny, efe a orchymynodd i’w bobl syrthio arnynt ‘u lladd. A bu iddynt ddechreu eu lladd hwynt; ïe, a’r Lamaniaid a ymdrechasant â’u cleddyfau, ac â’u holl nerth. Eithr wele, yr oedd eu croen noeth, a’u penau moel, yn agored i gleddyfau llymion y Nephiaid; ïe, wele, yr oeddynt yn cael eu trywanu a’u taraw; ïe, ac yr oeddynt yn syrthio yn gyflym iawn o flaen cleddyfau y Nephiaid; a dechreuasant gael eu hysgubo i lawr, megys yr oedd milwr Moroni wedi prophwydo. Yn awr, pan welodd Zerahemnah eu bod hwy oll ar gael eu dyfetha, efe a alwodd yn nerthol ar Moroni, gan addaw yr ymgyfammodai efe, a’i bobl hefyd, â hwynt, os arbedent y gweddill o’u bywydau, na ddelent byth drachefn i ryfel yn eu herbyn hwynt. A bu i Moroni achosi i waith marwolaeth beidio drachefn yn mhlith y bobl. Ac efe a gymmerodd yr arfau rhyfel oddiwrth y Lamaniaid; ac ar ol iddynt hwy wneyd cyfammod o heddwch ag ef, goddefwyd iddynt ymadael i’r anialwch. Yn awr, ni chyfrifwyd rhifedi eu meirw, o herwydd lliosogrwydd eu rhif; ïe, yr oedd rhif eu meirw yn fawr iawn, o ochr y Nephiaid a’r Lamaniaid. A bu iddynt daflu eu meirw i ddyfroedd Sidon; ac y maent wedi myned i lawr, a chael eu claddu yn nyfnderau y môr. A byddinoedd y Nephiaid, neu Moroni, a ddychwelasant, ac a ddaethant i’w tai, a’u tiroedd. Ac felly y terfynodd y ddeunawfed flwyddyn o deyrnasiad y barnwyr ar bobl Nephi. C felly y terfynodd cof-ysgrif Alma, yr hon oedd yn ysgrifenedig ar lafnau Nephi."
            },
            "21": {
                "intro": "Hanes pobl Nephi, a’u rhyfeloedd a’u hymraniadau, yn nyddiau Helaman, yn ol cof-ysgrif Helaman, yr hon a gadwodd efe yn ei ddyddiau.",
                "0": "A bu, pan welodd y Lamaniaid fod eu pen-gadbeniaid oll wedi eu lladd, hwy a ffoisant i’r anialwch. A bu iddynt ddychwelyd i dir Nephi, i hysbysu eu brenin, Amalickiah, yr hwn oedd yn Nephiad o enedigaeth, am eu mawr golled. A dygwyddodd iddo ef fod yn dra digllawn wrth ei bobl, oblegid nad oedd wedi cael ei ddymuniad ar y Nephiaid—nad oedd wedi eu darostwng hwynt dan iau caethiwed; ïe, yr oedd yn dra digllawn, ac efe a felldithiodd Dduw, a Moroni hefyd, ac a dyngodd lw yr yfai ei waed ef; a hyn o herwydd i Moroni gadw gorchymynion Duw, trwy barotoi er diogelwch ei bobl. A bu, ar y llaw arall, i bobl Nephi ddiolch i’r Arglwydd eu Duw, o herwydd ei allu digyffelyb yn eu gwaredu hwynt o ddwylaw eu gelynion. Ac felly y terfynodd y bedwaredd flwyddyn ar bymtheg o deyrnasiad y barnwyr ar bobl Nephi: ïe, ac yr oedd heddwch gwastadol yn eu plith, a llwyddiant mawr iawn yn yr eglwys, o herwydd yr ystyriaeth a’r dyfalwch a roddasant i air Duw, yr hwn a draethwyd iddynt gan Helaman, a Shiblon, a Corianton, ac Ammon, a’i frodyr, &c.: ïe, a chan yr holl rai a ordeiniwyd trwy urdd santaidd Duw, gan fod wedi eu bedyddio i edifeirwch, a’u danfon allan i bretethu yn mhlith y bobl, &c."
            },
            "22": {
                "0": "Wele, dygwyddodd i fab Nephihah gael ei benodi i lanw yr orsedd farnol, yn lle ei dad; ïe, penodwyd ef yn brif farnwr a llywodraethwr ar y bobl, gyda llw, ac ordinhad gyssegredig, i farnu yn gyfiawn, a chadw yr heddwch, a rhyddid y bobl, a chaniatâu iddynt eu breintiau cyssegredig i addoli yr Arglwydd eu Duw; ïe, i gynnal a chadw achos Duw trwy ei holl ddyddiau, a dwyn y drygionus i farn, yn ol eu trosedd. Yn awr, wele, ei enw oedd Pahoran. A Pahoran a lanwodd orsedd ei dad, ac a ddechreuodd ei deyrnasiad ar bobl Nephi, yn niwedd y bedwaredd flwyddyn ar hugain."
            },
            "23": {
                "0": "A bu i Teancum fyned yn lladradaidd i babell y brenin, a gwanu gwaywffon i’w galon; ac efe a achosodd farwolaeth y brenin yn uniongyrchol, fel na ddeffrodd ei weision. Ac efe a ddychwelodd drachefn yn ddirgelaidd i’w wersyll ei hun, ac wele, yr oedd ei wyr yntau yn nghwsg; ae efe a’u deffrodd hwynt, ac a fynegodd wrthynt yr hyn oll a wnaethai. Ac efe a berodd i’w fyddinoedd fod mewn parodrwydd, rhag fod y Lamaniaid wedi deffroi, ac iddynt ddyfod arnynt. Ac felly y terfynodd y bummed flwyddyn ar hugain o deyrnasiad y barnwyr ar bobl Nephi: ac felly y terfynodd dyddiau Amalickiah."
            },
            "24": {
                "0": "Ac yn awr, dygwyddodd i Helaman fyned o flaen ei ddwy fil o filwyr ienainc, i gynnorthwyo y bobl yn nghyffiniau y tir ar y deau wrth y môr gorllewinol. Ac felly y terfynodd yr wythfed flwyddyn ar hugain o deyrnasiad y Barnwyr ar bobl Nephi, &c."
            },
            "25": {
                "0": "A bu iddo beri i’r Lamaniaid a gymmerodd yn garcharorion, ddechreu gweithio er cadarnhau yr amddiffynfeydd oddiamgylch dinas Gid. A bu ar ol iddo amgaeru dinas gid, yn ol ei ddymuniadau, iddo beri i’w garcharorion gael eu cymmeryd i ddinas Llawnder; ac hefyd efe a wyliodd y ddinas hono â gallu tra nerthol. A bu iddynt, yn ngwyneb holl gynllwynion y Lamaniaid, gadw ac amddiffyn yr holl garcharorion a gymmerasant, ac hefyd gadw yr holl dir a’r manteision a adgymmerasant. A bu i’r Nephiaid ddechreu drachefn fod yn fuddugoliaethus, ac adferu eu hiawnderau a’u breintiau. Llawer o weithiau y cynnygiodd y Lamaniaid eu hamgylchynu hwynt yn y nos, eithr yn y cynnygiadau hyn hwy a gollent lawer o garcharorion. A llawer o weithiau y cynnygiasant roddi eu gwin i’r Nephiaid, fel y gallent eu dinystrio hwynt trwy wenwyn neu trwy feddwdod. Eithr, wele, nid oedd y Nephiaid yn hwyrfrydig i gofio yr Arglwydd eu Duw, yn eu hamseroedd hyn o gystudd. Nis gellid eu dal yn eu maglau hwy; ïe ni chyfranogent o’u gwin, oddieithr iddynt roddi peth yn gyntaf i’r carcharorion Lamanaidd. Ac felly yr oeddynt yn ofalus na weinyddid dim gwenwyn yn eu mysg hwynt; canys os gwenwynai eu gwin hwynt Lamaniad, gwnai hefyd wenwyno Nephiad; ac felly y profasant eu holl wirodydd. Ac yn awr, dygwyddodd fod yn anghenrheidiol i Moroni wneuthur parotoiadau er ymosod ar ddinas Morianton; canys, wele, yr oedd y Lamaniaid, trwy eu llafur, wedi amgaeru dinas Morianton, hyd nes y daeth yn amddiffynfa gref; ac yr oeddynt yn barhaus yn dwyn galluoedd newyddion i’r ddinas hono, ac hefyd ddarpariadau newyddion o luniaeth. Ac felly y terfynodd y nawfed flwyddyn ar hugain o deyrnasiad y Barnwyr ar bobl Nephi."
            },
            "26": {
                "0": "A bu pan ddaeth byddinoedd y Lamaniaid yn agos i’r ddinas, a gweled ein bod ni yn barod i’w cyfarfod, iddynt synu yn ddirfawr a chael eu taraw gan fawr ddychryn, yn gymmaint ag iddynt ffoi i’r anialwch. Ië, a bu i fyddinoedd y Lamaniaid ffoi allan o’r holl gŵr hwn o’r tir. Eithr wele, hwy a ddygasant ganddynt lawer o wragedd a phlant allan o’r tir. A’r dinasoedd hyny ag a gymmerwyd gan y Lamaniaid, yr oll o honynt, ydynt ar yr amser hwn yn ein meddiant ni; ac y mae ein tadau, a’n gwragedd, a’n plant, yn dychwelyd i’w cartrefleoedd, oll oddieithr y rhai a gymmerwyd yn garcharorion ac a ddygwyd ymaith gan y Lamaniaid. Eithr wele, mae ein byddinoedd yn fychain er amddiffyn nifer mor fawr o ddinasoedd, a meddiannau mor fawr. Eithr wele, yr ydym ni yn ymddiried yn ein Duw, yr hwn a roddodd i ni fuddugoliaeth ar y tiroedd hyny, yn gymmaint ag i ni ennill y dinasoedd a’r tiroedd, y rhai oeddynt ein heiddo ein hunain. Yn awr, nis gwyddom ni yr achos nad yw y llywodraeth yn rhoddi i ni fwy o nerth; ac ni ŵyr y gwyr hyny a ddaethant i fyny atom paham nad ydym wedi derbyn rhagor o nerth. Wele, nis gwyddom ni nad ydych chwi yn aflwyddiannus, a’ch bod wedi tynu y galluoedd ymaith i’r cwr hwna o’r tir; os felly, ni chwennychwn rwgnach. Ac os nid felly y mae, wele, ofnwn fod rhyw ymraniad yn y llywodraeth, fel na ddanfonant ychwaneg o wyr i’n cynnorthwy; canys gwyddom eu bod yn fwy lliosog nâ’r hyn a ddanfonasant. Eithr, wele, nid yw wahaniaeth: hyderwn y gwareda Duw ni, yn ngwyneb gwendid ein byddinoedd, ïe, ac y gwareda ni allan o ddwylaw ein gelynion. Wele, hon yw y nawfed flwyddyn ar hugain, yn ei diwedd, ac yr ydym ni mewn meddiant o’n tiroedd; ac y mae’r Lamaniaid wedi ffoi i dir Nephi. Ac y mae’r meibion hyny o eiddo pobl Ammon, am y rhai y llefarais mor ganmoladwy, gyda mi yn ninas Manti; ac y mae yr Arglwydd wedi eu cynnal hwynt, ïe, ac wedi eu cadw rhag syrthio trwy y cleddyf, yn gymmaint ag nad oes un enaid wedi ei ladd. Eithr, wele, y maent wedi derbyn llawer o archollion; er hyny, safant yn gadarn yn y rhyddid hwnw â pha un y rhyddhaodd Duw hwynt; ac y maent yn fanwl i gofio yr Arglwydd eu Duw, o ddydd i ddydd; ïe, cofiant gadw ei ddeddfau, a’i farnedigaethau, a’i orchymynion, yn wastadol; ac y mae eu ffydd yn gadarn yn y prophwydoliaethau am yr hyn sydd i ddyfod. Ac yn awr, fy anwyl frawd Moroni, boed i’r Arglwydd ein Duw, yr hwn a’n gwaredodd ac a’n rhyddhaodd, dy gadw di yn wastadol yn ei bresennoldeb; ïe, a boed iddo ffafrio y bobl hyn, fel y llwyddoch i feddiannu yr oll a gymmerodd y Lamaniaid oddiwrthym, yr hyn oedd er ein cynnaliaeth. Ac yn awr, wele, yr wyf yn terfynu fy epistol. Myfi yw Helaman, fab Alma."
            },
            "27": {
                "0": "A bu iddo ef ysgrifenu drachefn at lywodraethwr y tir, yr hwn oedd Pahoran, a’r rhai hyn yw y geiriau a ysgrifenodd, gan ddywedyd, Wele, yr wyf yn cyfeirio fy epistol at Pahoran, yn ninas Zarahemla, yr hwn yw y prif farnwr a’r llywodraethwr ar y tir, ac hefyd at yr holl rai a ddewiswyd gan y bobl hyn i lywodraethu a threfnu ahcosion y rhyfel hwn; canys wele, y mae genyf rywbeth i ddywedyd wrthynt, mewn ffordd o gondemniad; canys wele, chwi a wyddoch eich hunain i chwi gael eich penodi i gasglu gwyr yngnyd, a’u harfogi â chleddyfau, ac â chrymgleddyfau, ac â phob math o arfau rhyfel, o bob dull, a’u danfon allan yn erbyn y Lamaniaid, yn mha gwr bynag y deuent i’n tir. Ac yn awr, wele, yr wyf yn dywedyd wrthych, fy mod i fy hun, a’m gwyr hefyd, ac hefyd Helaman a’i wyr, wedi dyoddef dyoddefiadau mawrion iawn; ïe, sef newyn, syched, a lludded, a phob math o gystuddiau. Eithr wele, pe hyn fuasai y cyfan a ddyoddefasom, ni rwgnachem nac achwyn; eithr wele, mawr fu y lladdfa yn mysg ein pobl; ïe, y mae miloedd wedi syrthio trwy y cleddyf, tra y gallasai fod fel arall, pe rhoddasech chwi i’n byddinoedd ddigon o nerth a chymhorth. Ië, mawr fu eich esgeulusdod tuag atom. Ac yn awr, wele, dymunwn wybod yar achos o’r esgeulusdod mawr hwn; ïe, dymunwn wybod yr achos o’ch cyflwr anystyriol. A ellwch chwi feddwl eistedd ar eich gorseddau mewn cyflwr o hurtrwydd anystyriol, tra y mae eich gelynion yn taenu gwaith marwolaeth o’ch hamgylch? Ië, tra y maent yn llofruddio miloedd o’ch brodyr; ïe, sef y rhai a edrychasant i fyny atoch chwi am amddiffyniad, ïe, ac a’ch gosodasant chwi mewn sefyllfa fel y gallech eu noddi hwynt; ïe, gallasech chwi fod wedi danfon byddinoedd atynt, i’w nerthu, ac achub miloedd o honynt rhag syrthio trwy y cleddyf. Eithr wele, nid hyn yw’r cyfan; chwi a gadwasoch eich lluniaeth oddiwrthynt, yn gymmaint ag i lawer ymladd a gwaedu allan eu bywydau, o herwydd eu mawr ddymuniadau dros lwyddiant y bobl hyn; ïe, a gwnaethant hyn pan yr oeddynt yn nghylch trengu o newyn, o herwydd eich esgeulusdod mawr chwi tuag atynt. Ac yn awr, fy ngharuaidd frodyr, canys chwi a ddylech gael eich caru; ïe, a chwi a ddylech gyffroi eich hunain i fwy o ddiwydrwydd dros lwyddiant a rhyddid y bobl hyn; eithr, wele, darfu i chwi eu hesgeuluso, yn gymmaint ag y bydd i waed miloedd ddyfod ar eich penau chwi i ymddial; ïe, canys hysbys i Dduw oedd eu holl riddfanau, a’u holl ddyoddefiadau. Wele, a allech chwi dybied y gallech eistedd ar eich gorseddau, ac o herwydd mawr ddaioni Duw na allech chwi wneuthur dim, ac y gwaredai efe chwi? Wele, os tybiasoch hyn, chwi a dybiasoch yn ofer:—a ydych chwi yn tybied hyna, o herwydd fod cynnifer o’ch brodyr wedi eu lladd oblegid eu drygioni? Yr wyf yn dywedyd wrthych, os tybiasoch hyn, chwi a dybiasoch yn ofer: canys, meddaf wrthych, y mae llaweroedd wedi syrthio trwy y cleddyf; ac wele, y mae er eich condemniad chwi; canys y mae yr Arglwydd yn goddef i’r cyfiawn gael eu lladd, fel y delo ei gyfiawnder a’i farnedigaeth ar y drygionus; am hyny, nid oes anghen i chwi feddwl fod y cyfiawn yn golledig, o herwydd eu bod yn cael eu lladd; eithr wele, y maent hwy yn myned i mewn i orphwysfa yr Arglwydd eu Duw. Ac yn awr, wele, yr wyf yn dywedyd wrthych, ofnwyf yn fawr y daw barnedigaethau Duw ar y bobl hyn, o herwydd eu mawr ddiogi; ïe, sef diogi ein llywodraeth, a’u difaterwch mawr tuag at eu brodyr, ïe, tuag at y rhai a laddwyd: canys oni bai y drygioni a ddechreuodd yn gyntaf yn ein pen, gallem fod wedi gwrthsefyll ein gelynion, fel nad allent gael un awdurdod drosom; ïe, oni bai y rhyfel a dorodd allan yn mysg ein hunain; ïe, oni bai y rhyfel a dorodd allan yn mysg ein hunain; ïe, oni bai y breninwyr hyny, y rhai a achosent gymmaint o dywallt gwaed yn ein plith ein hunain; ïe, yn yr amser yr oeddem yn amryson yn ein plith ein hunain, pe buasem wedi uno ein nerth megys y gwnaethem hyd hyny; ïe, oni bai yr awydd am allu ac awdurdod a feddai y breninwyr hyny arnom; pe buasent yn ffyddlawn dros achos ein rhyddid, ac ymuno â ni, a myned allan yn erbyn ein gelynion, yn lle cymmeryd eu cleddyfau yn ein herbyn ni, yr hyn a fu yn achos o gymmaint tywallt gwaed yn ein plith ein hunain; ïe, pe buasem wedi myned allan yn eu herbyn hwynt yn nerth yr Arglwydd, buasem wedi gwasgaru ein gelynion; canys cawsai ei wneuthur yn ol cyflawniad ei air ef. Eithr, wele, yn awr, mae y Lamaniaid yn dyfod arnom, ac yn lladd ein pobl â’r cleddyf; ïe, ein gwragedd a’n plant; gan gymmeryd meddiant o’n tiroedd, ac hefyd eu dwyn hwythau ymaith yn gaeth, gan achosi iddynt ddyoddef pob math o gystuddiau; a hyn o herwydd drygioni mawr y rhai hyny a geisiant allu ac awdurdod; ïe, sef y breninwyr hyny. Eithr paham y dywedaf lawer ynghylch y mater hwn, canys nis gwyddom ni nad ydych chwi eich hunain yn ceisio awdurdod? Nis gwyddom ni nad ydych chwithau yn fradwyr i’ch gwlad? Neu, a ydych wedi ein hesgeuluso ni o herwydd eich bod chwi yn nghanol-bwynt ein gwlad, ac yn cael eich amgylchynu gan ddiogelwch, fel nad ydych yn peri i ymborth gael ei ddanfon i ni, a gwyr hefyd i nerthu ein byddinoedd? A ydych chwi wedi anghofio gorchymynion yr Arglwydd eich Duw? Ië, a ydych wedi anghofio caethwed eich tadau? A ydych wedi anghofio yr amryw weithiau gwaredwyd ni allan o ddwylaw ein gelynion? Neu, a ydych yn tybied y gwareda yr Arglwydd ni o hyd, tra yr eisteddwn ar ein gorseddau, ac heb ddefnyddio y moddion hyny a ddarparodd yr Arglwydd er ein mwyn? Ië, a eisteddwch chwi mewn segurdod, tra yr amgylchynir chwi gan filoedd, ïe, a degau o filoedd, o’r rhai hyny a eisteddant mewn segurdod hefyd, tra y mae miloedd oddiamgylch ar gyffiniau y tir yn syrthio trwy y cleddyf, ïe, yn archolledig a gwaedlyd? A ydych chwi yn tybied yr edrych Duw arnoch fel rhai dienog, tra yr eisteddwch yn llonydd a gweled y pethau hyn? Wele, meddaf wrthych, na wna. Yn awr, mi a ewyllysiwn i chwi gofio fod Duw wedi dywedyd, Y llestr tufewnol a lanheir yn gyntaf, ac yna y llestr allanol a lanheir hefyd. Ac yn awr, os nad ydych yn edifarhau am yr hyn â wnaethoch, a dechreu ymysgwyd, a danfon allan ymborth a gwyr i ni, ac hefyd i Helaman, fel yr amddiffyno efe y rhanau hyny o’n gwlad ag y mae wedi adgymmeryd, ac fel yr adferom ninnau hefyd y gweddill o’n etifeddiaethau yn y parthau hyn, wele, doethach fydd i ni beidio ymladd rhagor â’r Lamaniaid, hyd nes y byddom yn gyntaf wedi glanhau ein llestr tufewnol; ïe, sef pen mawr ein llywodraeth; ac oddieithrt i chwi ganiatâu i mi fy epistol, a dyfod allan a dangos i mi wir ysbryd rhyddid, ac ymdrechu nerthu a chadarnhau ein byddinoedd, a rhoddi ymborth iddynt er eu cynnahaeth, wele, mi a adawaf ran o’m rhyddid-wyr i gadw y cwr hwn o’n tir, ac a adawaf nerth a bendithion Duw arnynt, fel nas medro un gallu arall weithio yn eu herbyn; a hyn o herwydd eu mawr ffydd, a’u hamynedd yn eu trallodion; ac mi a ddeuaf atoch chwi, ac os bydd rhywrai yn eich plith yn chwennych rhyddid, ïe, os bydd hyd y nod gwreichionen o ryddid yn aros, wele, mi a gyffroaf derfysgoedd yn eich plith, hyd nes y difoder y rhai hyny a chwennychant draws-feddiannu gallu ac awdurdod; ïe, wele, nid wyf fi yn ofni eich gallu na’ch awdurdod, eithr fy Nuw yw yr hwn a ofnwyf, acyn ol ei orchymynion ef yr wyf yn cymmeryd fy nghleddyf i amddiffyn achos fy ngwlad, ac o herwydd eich drygioni chwi y dyoddefasom gymmaint o golled. Wele, y mae yn amser, ïe, mae yr amser yn awr wrth law, os na chyffrowch chwi eich hunain er amddiffyn eich gwlad, a’ch rhai bychain, i gleddyf cyfiawnder fod yn hongiedig uwch eich penau; ïe, ac efe a syrthia arnoch ac a ymwel â chwi er eich llwyr ddinystr. Wele, yr wyf fi yn dysgwyl am gynnorthwy oddiwrthych, ac, oddieithr i chwi weinyddu i’n cymhorth, wele, mi a ddeuaf atoch chwi, ïe, yn nhir Zarahemla, ac a’ch tarawaf â’r cleddyf, yn gymmaint ag nas gellwch gael rhagor o allu i rwystro ffyniant y bobl hyn yn achos ein rhyddid; canys, wele, ni oddefa yr Arglwydd i chwi fyw ac ymgryfhau yn eich anwireddau i ddinystrio ei bobl gyfiawn ef. Wele, a ellwch chwi dybied yr arbeda yr Arglwydd chwi, a dyfod allan mewn barn yn erbyn y Lamaniaid, pan mai traddodiad eu tadau hwy sydd wedi achoi eu casineb; ïe, ac y mae wedi ei ddyblu gan y rhai a ymneillduasant oddiwrthym ni; tra y mae eich anwiredd chwithau yn cael ei achosi trwy eich awydd am ogoniant, a gwag bethau y byd. Chwi a wyddoch eich bod yn troseddu cyfreithiau Duw, ac yr ydych yn gwybod eich bod yn eu sathru dan eich traed. Wele, dywed yr Arglwydd wrthyf, Os nad yw y rhai a benodasoch yn llywodraethwyr arnoch yn edifarhau am eu pechodau a’u hanwireddau, ti a gai fyned i frwydr yn eu herbyn hwynt. Ac yn awr, wele, yr wyf fi, Moroni, yn rhwymedig, yn ol y cyfammod a wnaethym i gadw gorchymynion fy Nuw; o ganlyniad, mi a ewyllysiwn i chwi lynu wrth air Duw, a danfon o’ch lluniaeth ac o’ch gwyr i mi ar frys, ac i Helaman hefyd. Ac wele, os na wnewch hyn, yr wyf yn dyfod atoch ar frys; canys, wele, ni oddefa Duw i ni farw o newyn; am hyny, efe a rydd i ni o’ch ymborth chwi, ïe, os bydd raid, trwy y cleddyf. Yn awr edrychwch ar gyflawni o honoch air Duw. Wele, myfi yw Moroni, eich pen-cadben. Nid wyf yn ymgeisio am awdurdod, eithr i’w ddarostwng. Nid wyf yn ymgeisio am anrhydedd y byd, eithr am ogoniant fy Nuw, a rhyddid a llwyddiant fy ngwlad. Ac felly yr wyf yn terfynu fy epistol."
            },
            "28": {
                "0": "Ac yn awr, Moroni, yr wyf yn llawenhau wedi derbyn dy epistol di, canys yr oeddwn rywfaint yn flin ynghylch pa beth a wnelem, pa un a oedd yn gyfiawn ynom i fyned i ryfel yn erbyn ein brodyr. Eithr ti a ddywedaist, os na edifarhaent, i’r Arglwydd orchymyn i ti fyned yn eu herbyn. Edrych dy fod yn cadarnhau Lehi a Teancum yn yr Arglwydd: dywed wrthynt am beidio ofni, canys Duw a’u gwareda; ïe, ac hefyd yr holl rai hyny a arosant yn ddisigl yn y rhyddid hwnw â pha un y rhyddhaodd Duw hwynt. Ac yn awr, yr wyf yn terfynu fy epistol at fy anwyl frawd Moroni."
            },
            "29": {
                "0": "A bu iddynt drachefn gadarnhau eglwys Dduw, trwy yr holl dir; ïe, a gwnaed trefniadau ynghylch y gyfraith. A’u barnwyr a’u prif farnwyr a ddewiswyd. A phobl Nephi a ddechreuasant lwyddo drachefn yn y tir, a dechreu lliosogi a myned yn dra chryfion drachefn yn y tir. A dechreuasant fyned yn dra chyfoethog; ond er eu cyfoeth, neu eu nerth, neu eu llwyddiant, ni ymddyrchafasant yn malchder eu golygon: ac nid oeddynt hwyrfrydig i gofio yr Arglwydd eu Duw; eithr hwy a ymostyngasant yn isel ger ei fron; ïe, hwy a gofiasant pa bethau mawrion a wnaeth yr Arglwydd drostynt, ei fod wedi eu gwaredu oddiwrth farwolaeth, ac oddiwrth rwymau, ac o garcharau, ac o bob math o gystuddiau; ac efe a’u gwaredodd allan o ddwylaw eu gelynion. A hwy a weddient ar yr Arglwydd eu Duw yn wastadol, yn gymmaint ag i’r Arglwydd eu bendithio, yn ol ei air, nes y darfu iddynt gryfâu a llwyddo yn y tir. A bu i’r holl bethau hyn gael eu gwneuthur. Ac Helaman a fu farw, yn y bymthegfed flwyddyn ar hugain o deyrnasiad y Barnwyr ar bobl Nephi."
            },
            "30": {
                "0": "A dygwyddodd yn y bedwaredd flwyddyn ar bymtheg ar hugain o deyrnasiad y Barnwyr, i Shiblon farw hefyd, ac yr oedd Corianton wedi myned allan i’r tir yn ogleddol, mewn llong, i gario lluniaeth allan i’r bobl ag oedd wedi myned i’r tir hwnw; am hyny, daeth yn anghenrheidiol i Shiblon i roddi y pethau cyssegredig hyny, cyn ei farwolaeth, i fab Helaman, yr hwn a elwid Helaman, gan gael ei alw yn ol enw er dad. Yn awr, wele, yr holl gerfladau hyny ag oeddynt yn meddiant Helaman, a ysgrifenwyd ac a ddanfonwyd yn mysg plant dynion trwy yr holl dir, oddieithr y rhanau hyny a orchymynodd Alma na chawsent fyned allan. Er hyny, yr oedd y pethau hyn i’w cadw yn gyssegredig, a’u trosglwyddo i waered o un genedlaeth i’r llall; am hyny, yn y flwyddyn hon, yr oeddynt wedi eu rhoddi i Helaman, cyn marwolaeth Shiblon. A dygwyddodd hefyd yn yr un flwyddyn fod rhai ymneillduwyr wedi myned at y Lamaniaid; a hwythau a gynhyrfwyd i fyny drachefn i ddigofaint yn erbyn y Nephiaid. Ac hefyd yn yr un flwyddyn, hwy a ddaethant i waered gyda byddin liosog i ryfel yn erbyn pobl Moronihah, neu yn erbyn byddin Moronihah, yn yr hyn y gorthrechwyd hwynt, ac y gyrwyd hwynt yn ol drachefn i’w tiroedd eu hunain, wedi dyoddef colled mawr. Ac felly y terfynodd y bedwaredd flwyddyn ar bymtheg ar hugain o deyrnasiad y Barnwyr ar bobl Nephi. Ac felly y terfynodd hanes Alma, ac Helaman ei fab, ac hefyd Shiblon, yr hwn oedd ei fab."
            },
            "31": {},
            "32": {},
            "33": {},
            "34": {},
            "35": {},
            "36": {},
            "37": {},
            "38": {},
            "39": {},
            "40": {},
            "41": {},
            "42": {},
            "43": {},
            "44": {},
            "45": {},
            "46": {},
            "47": {},
            "48": {},
            "49": {},
            "50": {},
            "51": {},
            "52": {},
            "53": {},
            "54": {},
            "55": {},
            "56": {},
            "57": {},
            "58": {},
            "59": {},
            "60": {},
            "61": {},
            "62": {},
            "63": {}
        }
    },
    "hel": {
        "meta": {
            "slug": "hel",
            "name": "Llyfr Helaman.",
            "chapterWord": "Pennod Ⅰ."
        },
        "chapters": {
            "1": {
                "intro": "Hanes am y Nephiaid. Eu rhyfeloedd a’u hamrafaelion, a’u hymraniadau. Ac hefyd brophwydoliaethau amryw o brophwydi santaidd, o flaen dyfodiad Crist, yn ol cof-lyfr Helaman, yr hwn oedd fab Helaman, ac hefyd yn ol cof-lyfrau ei feibion, i lawr hyd at ddyfodiad Crist. Ac hefyd y mae llawer o’r Lamaniaid yn cael eu dychwelyd. Hanes eu dychweliad. Hanes am gyfiawnder y Lamaniaid, a drygioni a ffieidd-dra y Nephiaid, yn ol coflyfr Helaman a’i feibion, i lawr hyd at ddyfodiad Crist, yr hwn a elwir llyfr Helaman, &c.",
                "0": "A bu i Helaman ddanfon allan i ddal y llu hwn o yspeilwyr a llofruddion dirgelaidd, fel y dïenyddid hwynt yn ol y gyfraith. Eithr, wele, pan gafodd Gadianton allan nad oedd Kishkumen yn dychwelyd, efe a ofnai rhag ei fod wedi ei ddyfetha; am hyny, efe a berodd i’w lu ei ganlyn ef. A hwy a ffoisant allan o’r tir, trwy ffordd ddirgelaidd, i’r anialwch; ac felly, pan ddanfonodd Helaman allan i’w dal, nis gellid eu cael mewn un man. A llefarir ychwaneg am y Gadianton hwn yn ol llaw. Ac felly y terfynodd y ddwyfed flwyddyn a deugain o deyrnasiad y Barnwyr ar bobl Nephi. Ac wele, yn niwedd y llyfr hwn, cewch weled i’r Gadianton hwn brofi yn ddadymchweliad, ïe, braidd yn llwyr ddinystr pobl Nephi. Wele, nid wyf yn meddwl diwedd llyfr Helaman, eithr meddyliwyf diwedd llyfr Nephi, o’r hwn y cymmerais yr holl hanes ag wyf wedi ysgrifenu."
            },
            "2": {
                "0": "A bu i’r Lamaniaid ymlid llu yspeilwyr Gadianton; a hwy a bregethasant air Duw yn mhlith y rhai mwyaf drygionus o honynt, yn gymmaint ag i’r llu hwn o yspeilwyr gael eu llwyr ddyfetha o blith y Lamaniaid. A dygwyddodd, ar y llaw arall, i’r Nephiaid eu cynnorthwyo a’u hamddiffyn hwynt, gan ddechreu ar y rhan fwyaf drygionus o honynt, hyd nes yr oeddynt wedi gwasgaru dros holl dir y Nephiaid, ac wedi hudo y rhan fwyaf o’r cyfiawnion, hyd nes y daethant i lawr i gredu yn eu gweithredoedd, a chyfranogi o’u hyspeiliadau, ac ymuno â hwynt yn eu dirgel lofruddiaethau a’u cydfwriadau. Ac felly y cawsant reolaeth y llywodraeth iddynt eu hunain, yn gymmaint ag iddynt sathru dan eu traed, a tharaw, a rhwygo, a throi eu cefnau ar ganlynwyr tlawd, ac addfwyn a gostyngedig Duw. Ac felly gwelwn eu bod mewn sefyllfa ofnadwy, ac yn addfedu i ddinystr tragywyddol. A bu mai felly y terfynodd yr wythfed flwyddyn a thrugain o deyrnasiad y Barnwyr ar bobl Nephi."
            },
            "3": {
                "intro": "Prophwydoliaeth Nephi, fab Helaman.—Duw yn bwgwth pobl Nephi, yr ymwel efe â hwynt yn ei ddigter, er eu llwyr ddinystr, oddieithr iddynt edifarhau am eu drygioni. Duw yn taraw pobl Nephi â haint; y maent yn edifarhau, ac yn troi ato. Samuel, Lamaniad, yn prophwydo wrth y Nephiaid.",
                "0": "A bu mai felly yr aeth efe allan yn yr ysbryd, o dyrfa i dyrfa, gan draethu gair Duw, hyd nes yr oedd wedi ei draethu wrthynt oll, neu ei ddanfon i blith yr holl bobl. A bu na wrandawent ar ei eiriau; a dechreuodd fod amrafaelion, yn gymmaint ag iddynt ymranu yn erbyn eu hunain, a dechreu lladd eu gilydd â’r cleddyf. Ac felly y terfynodd yr unfed flwyddyn ar ddeg a thrugain o deyrnasiad y Barnwyr ar bobl Nephi."
            },
            "4": {
                "0": "A bu yn nechreu yr unfed flwyddyn a phedwar ugain, iddynt fyned allan drachefn yn erbyn y llu yspeilwyr hyn, a dyfetha llawer; ac ymwelwyd â hwythau hefyd gan fawr ddinystr; a gorfodwyd hwynt drachefn i ddychwelyd o’r anialwch, ac o’r mynyddoedd, i’w tiroedd eu hunain, o herwydd lliosogrwydd mawr yr yspeilwyr hyny a gyfanneddent y mynyddoedd a’r anialwch. A bu mai felly y terfynodd y flwyddyn hon. A’r yspeilwyr a liosogent ac a gryf haent o hyd, yn gymmaint ag iddynt hèrio holl fyddinoedd y Nephiaid, ac eiddo y Lamaniaid hefyd; a hwy a achosent i ofn mawr ddyfod ar y bobl, ar holl wyneb y tir; ïe, canys hwy a ymwelent ag amryw ranau o’r tir, ac a wnaent ddystryw mawr iddynt; ïe, lladdent laweroedd, a chaethgludent ereill i’r anialwch; ïe, ac yn fwy neillduol eu gwragedd a’u plant. Yn awr, y drwg mawr hwn, ag a ddaeth ar y bobl oblegid eu hanwiredd, a’u cyffrodd hwynt drachefn i gofio yr Arglwydd eu Duw. Ac felly y terfynodd yr unfed flwyddyn a phedwar ugain o deyrnasiad y Barnwyr. Ac yn y ddwyfed flwyddyn a phedwar ugain, dechreuasant drachefn i anghofio yr Arglwydd eu Duw. Ac yn y drydedd flwyddyn a phedwar ugain, dechreuasant gynnyddu mewn anwiredd. Ac yn y bedwaredd flwyddyn a phedwar ugain, ni ddiwygiasant eu ffyrdd. A bu yn y bummed flwyddyn a phedwar ugain, iddynt fyned yn gryfach gryfach yn eu balchder, ac yn eu drygioni; ac felly yr oeddynt yn addfedu drachefn i ddinystr. Ac felly y terfynodd y bummed flwyddyn a phedwar ugain. Ac felly gallwn weled pa mor dwyllodrus, a pha mor ansefydlog yw calonau meibion dynion; ïe, gallwn weled fod yr Arglwydd yn ei fawr ddaioni anfeidrol, yn bendithio a llwyddo y rhai a osodant eu hymddiried ynddo; ïe, a gallwn weled hyd y nod yr amser y mae efe yn llwyddo ei bobl; ïe, yn nghynnyrch eu maesydd, eu da, a’u defaid, ac mewn aur, ac mewn arian, ac mewn pob math o bethau gwerthfawr o bob natur, a chelfyddyd; gan arbed eu bywydau, a’u gwaredu allan o ddwylaw eu gelynion; gan feddalhau calonau eu gelynion, fel na chyhoeddent ryfeloedd yn eu herbyn hwynt; ïe, ac yn fyr, gan wneuthur pob peth er lles a dedwyddwch ei bobl; ïe, y pryd hwnw yw yr amser y maent yn caledu eu calonau, ac yn anghofio yr Arglwydd eu Duw, ac yn mathru ei Sanct dan eu traed; ïe, a hyn o herwydd eu hesmwythyd, a’u dirfawr lwyddiant. Ac felly gwelwn, os na cherydda yr Arglwydd ei bobl â llawer o gystuddiau, ïe, os na ymwela â marwolaeth, ac â dychryn, ac â newyn, ac â phob math o heintiau, nis cofiant ef. O, mor ffol, ac mor ofer, a drwg, a chythreulig, ac mor gyflym i weithredu anwiredd, ac mor hwyrfrydig i wneuthur daioni, yw plant dynion; ïe, mor gyflym i wrandaw ar eiriau yr un drwg, ac i osod eu calonau ar wag-bethau y byd; ïe, mor gyflym i ymddyrchafu mewn balchder; ïe, mor gyflym i ymffrostio, a gwneuthur pob math o’r hyn sydd yn ddrygioni; ac mor hwyrfrydig y maent i gofio yr Arglwydd eu Duw, ac i roddi clust i’w gynghorion; ïe, mor hwyrfrydig i rodio yn llwybrau gwirionedd! Wele, nid ydynt yn chwennych i’r Arglwydd eu Duw, yr hwn a’u creodd hwynt, lywodraethu a theyrnasu arnynt, er ei fawr ddaioni a’i drugaredd tuag atynt; dirmygant ei gynghorion, ac ni fynant iddo ef fod yn arweinydd arnynt. O mor fawr yw diddymdra plant dynion; ïe, y maent yn llai nâ llwch y ddaear. Canys wele, y mae llwch y ddaear yn symud yma ac acw, hyd at ymwahanu, wrth orchymyn ein Duw mawr a thragywyddol; ïe, wele, wrth ei lef y mae y brynian a’r mynyddoedd yn crynu ac yn ymysgwyd; a thrwy allu ei lef yr ymchwalant ac y deuant yn wastad, ïe, yn gyffelyb i ddyffryn; ïe, trwy allu ei lef y gwna i’r holl ddaear grynu; ïe, trwy allu ei lef y gwna i’r sylfaeni ymsiglo, ïe, yn gyffelyb i ddyffryn; ïe, trwy allu ei lef y gwna i’r holl ddaear grynu: ïe, trwy allu ei lef y gwna i’r sylfaeni ymsiglo, ïe, hyd y nod i’r canol; ïe, ac os dyweda wrth y ddaear, Ymsymud, hi a symudir; ïe, os dyweda wrth y ddaear, Ti a gai fyned yn dy ol, fel yr estyner y dydd amryw oriau, caiff ei wneuthur; ac felly yn ol ei air, mae y ddaear yn myned yn eu hol, ac y mae yn ymddangos i ddyn fod yr haul yn sefyll; ïe, ac wele, felly y mae; canys diau mai y ddaear sydd yn symud, ac nid yr haul. Ac wele, hefyd, os dyweda wrth ddyfroedd y dyfnder mawr, Sycher chwi i fyny, caiff ei wneuthur. Wele, os dyweda wrth y mynydd hwn, Cyfoder di, a dos drosodd a syrthia ar y ddinas hona, fel y cladder hi, wele, caiff ei wneuthur. Ac wele, os cuddia dyn drysor yn y ddaear, ac i’r Arglwydd ddywedyd. Melldithier ef o herwydd anwiredd yr hwn a’i cuddiodd, wele, caiff ei felldithio; ac os dyweda yr Arglwydd, melldithier di, fel na chaffo neb di o’r amser hwn allan ac yn dragywydd, wele, ni chaiff neb ef o hyn allan ac yn dragywydd. Ac wele, os dyweda yr Arglwydd wrth ddyn, O achos dy anwireddau ti a felldithir yn dragywydd, caiff ei wneuthur. Ac os dyweda yr Arglwydd, O achos dy anwireddau, ti a dorir ymaith o’m presennoldeb, efe a bar iddi fod felly. A gwae yr hwn wrth ba un y dywedo efe hyn, canys efe a fydd i’r hwn a weithredo anwiredd, ac nis gellir ei achub; am hyny, i’r dyben yma, fel yr achubir dynion, y traethwyd edifeirwch. Gan hyny, gwynfyd y rhai a edifarhant ac a wrandawant ar lais yr Arglwydd eu Duw; canys y rhai hyn yw y rhai a achubir. A chaniataed Duw, o’i fawr gyflawnder, i ddynion gael eu dwyn i edifeirwch a gweithredoedd da, fel yr adferer hwynt i râs am râs, yn ol eu gweithredoedd. Ac mi a ewyllysiwn i bob dyn gael ei achub. Ond yr ydym yn darllen am y dydd mawr a diweddaf, fod rhai ag a gânt eu bwrw allan; ïe, y rhai a fwrir ymaith o bresennoldeb yr Arglwydd; ïe, y rhai a drosglwyddir i sefyllfa o drueni diddiwedd, gan gyflawni y geiriau a ddywedant, Y rhai a wnaethant dda, a gânt fywyd tragywyddol; a’r rhai a wnaethant ddrwg, a gânt ddamnedigaeth dragywyddol. Ac felly y mae. Amen."
            },
            "5": {
                "intro": "Prophwydoliaeth Samuel, y Lamaniad, wrth y Nephiaid.",
                "0": "Eithr dygwyddodd yn y ddegfed flwyddyn a phedwar ugain o deyrnasiad y Barnwyr, fod arwyddion mawr yn cael eu rhoddi i’r bobl, a fhyfeddodau; a geiriau y prophwydi a ddechreuasant gael eu cyflawni; ac ymddangosodd angylion i ddynion, dynion doeth, ac a fynegasant iddynt newyddion da o lawenydd mawr; felly yn y flwyddyn hon y dechreuodd yr ysgrythyrau gael eu cyflawni. Er hyny, y bobl a ddechreuasant galedu eu calonau, yr oll oddieithr y rhan fwyaf grediniol o honynt, o’r Nephiaid, ac o’r Lamaniaid hefyd, ac a ddechreuasant ymddibynu ar eu nerth eu hunain, ac ar eu doethineb eu hunain, gan ddywedyd, Gallant fod wedi amcanu rhai pethau yn iawn, yn mhlith cynnifer; eithr wele, gwyddom nas gall yr holl weithredoedd mawrion a rhyfedd hyn y llefarwyd am danynt, ddyfod i ben. A hwy a ddechreuasant ymresymu ac ymddadleu yn mhlith eu gilydd, gan ddywedyd nad yw yn rhesymol fod y fath fôd â Christ i ddyfod; pe felly, ac yntau yn Fab Duw, Tad nef a daear, fel y llefarwyd, paham na ddengys efe ei hun i ni, yn gystal ag iddynt hwy y rhai a fyddant yn Jerusalem? Ië, paham na ddengys efe ei hun yn y tir hwn, yn gystal ag yn nhir Jerusalem? Eithr wele, ni a wyddom mai traddodiad drygionus yw hwn, a drosglwyddwyd i waered i ni gan ein tadau, er achosi i ni gredu mewn rhyw beth mawr a rhyfeddol ag a ddeuai i ben, ond nid yn ein plith ni, eithr mewn gwlad sydd yn mhell iawn, gwlad na adwaenwn; gan hyny, gallant ein cadw ni mewn anwybodaeth, canys nis gallwn weled â’n llygaid ein hunain eu bod yn wir. A hwy, trwy gywreinrwydd cyfrwys a dirgelaidd yr un drwg, a weithredant ryw ddirgelwch mawr, ag nas gallwn ni ei ddeall, yr hwn a’n ceidw ni i lawr i fod yn weision i’w geiriau hwynt, ac hefyd iddynt hwythau, canys yr ydym yn ymddibynu arnynt hwy i ddysgu i ni y gair; ac felly y cadwant ni mewn anwybodaeth, os ymollyngwn iddynt, holl ddyddiau ein bywyd. A llawer o bethau yn ychwaneg a ddychymmygai y bobl yn eu calonau, y rhai oeddynt ofer a ffol; ac yr oeddynt wedi eu terfysgu yn fawr, canys yr oedd satan yn eu cynhyrfu i weithredu anwiredd yn barhaus; ïe, elai o amgylch, gan daenu chwedlau ac amrafaelion, ar hyd holl wyneb y tir, fel y caledai galonau y bobl yn erbyn yr hyn oedd dda, ac yn erbyn yr hyn a ddeuai; ac er yr holl arwyddion a’r rhyfeddodau a weithredwyd yn mhlith pobl yr Arglwydd, a’r amryw wyrthiau a gyflawnwyd ganddynt, yr oedd satan wedi cael gafael mawr ar galonau y bobl, ar holl wyneb y tir. Ac felly y terfynodd y ddegfed flwyddyn a phedwar ugain o deyrnasiad y Barnwyr ar bobl Nephi. Ac felly y terfynodd llyfr Helaman, yn ol cof-lyfr Helaman a’i feibion."
            },
            "6": {},
            "7": {},
            "8": {},
            "9": {},
            "10": {},
            "11": {},
            "12": {},
            "13": {},
            "14": {},
            "15": {},
            "16": {}
        }
    },
    "3-ne": {
        "meta": {
            "slug": "3-ne",
            "name": "Llyfr Nephi,",
            "chapterWord": "Pennod Ⅰ."
        },
        "chapters": {
            "1": {
                "intro": "Ac Helaman oedd fab Helaman, yr hwn oedd fab Alma, yr hwn oedd fab Alma, disgynydd o Nephi, yr hwn oedd fab Lehi, yr hwn a ddaeth allan o Jerusalem yn y flwyddyn gyntaf o deyrnasiad Zedekiah, brenin Judah.",
                "0": "A bu yn nechreu y bedwaredd flwyddyn ar ddeg, i’r rhyfel rhwng yr yspeilwyr a phobl Nephi barhau, a myned yn dra blin; er hyny, cafodd pobl Nephi beth mantais ar yr yspeilwyr, yn gymmaint ag iddynt eu gyru yn ol o’u tiroedd i’r mynyddoedd, ac i’w lleoedd dirgel. Ac felly y terfynodd y bedwaredd flwyddyn ar ddeg. Ac yn y bymthegfed flwyddyn, daethant allan yn erbyn pobl Nephi: ac o herwydd drygioni pobl Nephi, a’u hamryw amrafaelion ac ymraniadau, yr yspeilwyr Gadiantonaidd a gawsant lawer o fanteision arnynt hwy. Ac felly y terfynodd y bymthegfed flwyddyn, ac felly yr oedd y bobl mewn sefyllfa o amryw gystuddiau; ac yr oedd cleddyf dinystr yn hongian uwch eu penau, yn gymmaint â’u bod ynghylch cael eu taraw i lawr ganddo, a hyn o herwydd eu hanwiredd."
            },
            "2": {
                "0": "Ac yn awr, dygwyddodd ar ol iddynt gymmeryd yr holl yspeilwyr yn garcharorion, yn gymmaint na ddiangodd neb ag na laddwyd, iddynt fwrw eu carcharorion yn ngharchar, ac achosi i air Duw gael ei bregethu iddynt; a chynnifer a edifarhaent am eu pechodau ac a ymgyfammodent na lofruddient mwyach, a ryddhawyd; eithr cynnifer ag oedd na ymgyfammodent, ac a barhaent o hyd i fod â’r llofruddiaethau dirgel hyn yn eu calonau; ïe, cynnifer ag a gafwyd yn chwythu bygythion yn erbyn eu brodyr, a gondemniwyd ac a gospwyd yn ol y gyfraith. Ac felly y gosodasant derfyn ar yr holl gydfwriadau drygionus, a dirgel, a ffieidd hyny, yn y rhai yr oedd cymmaint o ddrygioni, a chynnifer o lofruddiaethau yn cael eu cyflawni. Ac felly yr aeth heibio y ddwyfed flwyddyn ar hugain, a’r drydedd flwyddyn ar hugain hefyd, a’r bedwaredd ar hugain, a’r bummed ar hugain; ac felly yr aeth pum mlynedd ar hugain heibio, ac yr oedd llawer o bethau wedi cymmeryd lle, ag a fyddent yn ngolwg rhai, yn fawrion a rhyfedd; er hyny, nis gallant gael eu hysgrifenu oll yn y llyfr hwn; ïe, nis gall y llyfr hwn gynnwys y ganfed ran o’r hyn a gyflawnwyd yn mhlith cynnifer o bobl, yn yr yspaid o bum mlynedd ar hugain; eithr wele, y mae cof-lyfrau ag ydynt yn cynnwys holl weithrediadau y bobl hyn; a hanes byrach ond cywir a roddwyd gan Nephi; am hyny, mi a wnaethym fy nghofnodiad o’r pethau hyn yn ol cof-lyfr Nephi, yr hwn a gerfiwyd ar y llafnau a elwid llafnau Nephi. Ac wele, yr wyf fi yn gwneuthur coflyfr ar lafnau, y rhai a wnaethym â’m dwylaw fy hun. Ac wele, gelwir fi Mormon, gan gael fy ngalw yn ol tir Mormon, y tir yn mha un y sefydlodd Alma yr eglwys yn mhlith y bobl; ïe, yr eglwys gyntaf ag a sefydlwyd yn eu plith wedi iddynt droseddu. Wele, myfi wyf ddyseybl i Iesu Grist, Mab Duw. Myfi a alwyd ganddo ef i draethu ei air yn mhlith ei bobl, fel y caent fywyd tragywyddol. A daeth yn fuddiol i mi, yn unol ag ewyllys Duw, fel y byddai i weddiau y rhai sydd wedi myned oddi yma, ag oeddynt y rhai santaidd, gael eu cyflawni yn ol cu ffydd, i wneuthur cof-lyfr o’r pethau hyn a wnaethwyd; ïe, cof-lyfr bychan o’r hyn a gymmerodd le o’r amser y gadawodd Lehi Jerusalem, i lawr hyd yr amser presennol; gan hyny, yr wyf fi yn gwneuthur fy nghof-lyfr o’r hanesion a roddwyd gan y rhai oeddynt o’m blaen, hyd ddechreu fy nydd i: ac yna yr wyf yn gwneuthur cofnodiad o’r pethau a welais â’m llygaid fy hun. Ac mi a wn fod y cof-lyfr wyf fi yn ei wneuthur yn gof-lyfr ffyddlawn a chywir; er hyny, y mae llawer o bethau, y rhai, yn ol ein hiaith ni, nad ydym yn alluog i’w hysgrifenu. Ac yn awr, yr wyf yn terfynu fy ngeiriau i, y rhai ydynt o honof fy hun, ac yn myned rhagof i roddi fy hanes am y pethau ag oeddynt o’m blaen; myfi yw Mormon, a disgynydd pur o Lehi. Mae genyf achos i fendithio fy Nuw a’m Hiachawdwr Iesu Grist, am iddo ddwyn ein tadau allan o wlad Jerusalem (ac ni wyddai neb hyny oddieithr ei hunan, a’r rhai a ddygodd efe allan o’r wlad hono), a’i fod wedi rhoddi i mi a’m pobl gymmaint o wybodaeth er iachawdwriaeth ein heneidiau. Yn ddiau efe a fendithiodd dŷ Jacob, ac a fu drugarog wrth hâd Joseph. Ac yn gymmaint â bod plant Lehi wedi cadw ei orchymynion, efe a’u bendithiodd ac a’u llwyddodd hwynt yn ol ei air; ïe, ac yn ddiau efe a ddwg drachefn weddill o had Joseph i wybodaeth o’r Arglwydd eu Duw; a diau fel mai byw yr Arglwydd, efe a gasgla i mewn o bedwar cwr y ddaear, holl weddill had Jacob, y rhai ydynt wasgaredig ar hyd holl wyneb y ddaear; ac megys yr ymgyfammododd efe â holl dŷ Jacob, felly y cyfammod â pha un yr ymgyfammododd efe â thŷ Jacob, a gaiff ei gyflawni yn ei amser cyfaddas ei hun, er adferiad holl dŷ Jacob i wybodaeth o’r o’r cyfammod a ymgyfammododd â hwynt; ac yna yr adnabyddant eu Gwaredwr, yr hwn yw Iesu Grist, Mab Duw; ac yna y cesglir hwynt i mewn o bedwar cwr y ddaear, i’w tiroedd eu hunain, o ba le y gwasgarwyd hwynt; ïe, fel mai byw yr Arglwydd, felly y bydd. Amen."
            },
            "3": {
                "0": "Felly hefyd yr aeth heibio y ddeuddegfed flwyddyn ar hugain. A Nephi a waeddodd ar y bobl yn nechreu y drydedd flwyddyn ar ddeg; ac efe a bregethodd iddynt edifeirwch a maddeuant pechodau. Yn awr, mi a fynwn i chwi gofio hefyd, nad oedd neb ag a ddygwyd i edifeirwch, na fedyddiwyd â dwfr; gan hyny, yr oedd Nephi wedi ordeinio dynion i’r weinidogaeth hon, fel y gallai pawb a ddeuent atynt hwy, gael eu bedyddio â dwfr, a hyn fel tystiolaeth gerbron Duw, ac o flaen y bobl, eu bod wedi edifarhau a derbyn maddeuant o’u pechodau. Ac yr oedd llawer yn nechreu y flwyddyn hon, y rhai a gawsant eu bedyddio i edifeirwch; ac felly yr aeth heibio y rhan fwyaf o’r flwyddyn."
            },
            "4": {
                "0": "Ac yn awr, dygwyddodd ar ol i’r bobl glywed y geiriau hyn, iddynt ddechreu wylofain ac uban drachefn, o herwydd colli eu perthynasau a’u cyfeillion. A bu mai felly yr aeth heibio y tri diwrnod. Ac yr oedd yn y boreu, a’r tywyllwch a wasgarodd oddiar wyneb y tir, a’r ddaear a beidiodd grynu, a’r creigiau a beidiasant rwygo, a’r cwynfan erchyll a ddarfyddodd, a’r holl awn terfysglyd a aeth heibio, a’r ddaear a lynodd ynghyd drachefn, fel y safodd, a galar, a griddfan, a wylofain y bobl ag a adawyd yn fyw, a beidiasant; a’u galar a drowyd yn llawenydd, a’u wylofain yn fawl a diolchgarwch i’r Arglwydd Iesu Grist, eu Gwaredwr. Ac hyd yma y cyflawnwyd yr ysgrythyrau a lefarwyd gan y prophwydi. A’r rhan fwyaf cyfiawn o’r bobl oedd y rhai a achubwyd, a hwy oedd y rhai a dderbyniasant y prophwydi, ac nis llabyddiasant hwynt; a’r rhai ni thywalltasant waed y saint, oedd y rhai a arbedwyd; a hwy a arbedwyd, ac ni soddwyd, ac ni chladdwyd hwynt yn y ddaear; ac ni foddwyd hwynt yn eigion y môr; ac ni losgwyd hwynt gan dân, ac ni chwympodd dim arnynt a’u gwasgu i farwolaeth; ac ni chariwyd hwynt ymaith yn y corwynt; ac ni orchfygwyd hwynt gan darth mwg a thywyllwch. Ac yn awr, yr hwn sydd yn darllen, dealled; yr hwn sydd ganddo yr ysgrythyrau, chwilied hwynt, ac edrych a gweled os nad yw yr holl farwolaethau a dinystriadau hyn gan dân, a chan fwg, a chan dymhestloedd, a chan gorwyntoedd, a chan y ddaear yn ymagor i’w derbyn hwynt, a’r holl bethau hyn, yn gyflawniad o brophwydoliaethau llawer o brophwydi santaidd. Wele, meddaf wrthych, ïe, y mae llawer wedi tystiolaethu am y pethau hyn ar ddyfodiad Crist, ac wedi eu lladd oblegid eu bod yn tystiolaethu am y pethau hyn; ïe, y prophwyd Zenos a dystiolaethodd am y pethau hyn, a Zenock hefyd a lefarodd am y pethau hyn, o herwydd eu bod yn tystolaethu yn benodol am danom ni, y rhai ydym y gweddill o’u had. Wele, ein tad Jacob hefyd a dystiolaethodd am weddill had Joseph. Ac wele, ai nid ydym ni yn weddill o had Joseph? Ac ai nid yw y pethau hyn a dystiolaethant am danom ni, yn ysgrifenedig ar y llafnau pres a ddygodd ein tad Lehi allan o Jerusalem? Ac yn niwedd y bedwaredd flwyddyn ar ddeg ar hugain, wele, mi a ddangosaf i chwi, i bobl Nephi, y cyfryw ag a arbedwyd, ac hefyd y rhai a elwid Lamaniaid, y cyfryw ag a arbedwyd, gael ffafr fawr wedi ei dangos tuag atynt, a bendithion mawrion wedi eu tywallt ar eu penau, yn gymmaint ag yn fuan ar ol esgyniad Crist i’r nef, iddo wir amlygu ei hun iddynt hwy; gan ddangos ei gorff iddynt, a gweinyddu iddynt; a hanes ei weinidogaeth a roddir yn ol llaw. Gan hyny, am y waith hon yr wyf yn terfynu fy ngeiriau."
            },
            "5": {
                "intro": "Iesu Grist yn dangos ei hun i bobl Nephi, fel yr oedd y dyrfa wedi ymgasglu ynghyd yn nhir Llawnder, ac yn gweinidogaethu iddynt; ac yn y modd hyn yr ymddangosodd efe iddynt.",
                "0": "Na thrysorwch i chwi drysorau ar y ddaear, lle y mae gwyfyn a rhwd yn llygru, a lle y mae lladron yn cloddio drwodd ac yn lladrata; eithr trysorwch i chwi drysorau yn y nef, lle nad oes na gwyfyn na rhwd yn llygru, a lle nis cloddia lladron trwodd ac nis lladratânt. Canys lle y mae eich trysor, yno y bydd eich calon hefyd. Canwyll y corff yw y llygad; am hyny, os bydd dy lygad yn syml, dy holl gorff fydd yn oleu. Eithr os bydd dy lygad yn ddrwg, dy holl gorff fydd yn dywyll. Am hyny, os bydd y goleuni sydd ynot yn dywyllwch, pa faint fydd y tywyllwch! Ni ddichon neb wasanaethu dau arglwydd; canys naill ai efe a gasâ y naill, ac a gâr y llall; ai efe a mylŷn wrth y naill, ac a esgeulusa y llall. Ni ellwch wasanaethu Duw a mammon."
            },
            "6": {
                "0": "Gan hyny pwy bynag sydd yn gwrandaw fy ngeiriau hyn, ac yn eu gwneuthur, mi a’u cyffelybaf ef i wr doeth, yr hwn a adeiladodd ci dŷ ar y graig; a’r gwlaw a ddisgynodd, a’r llifogydd a ddaethant, a’r gwyntoedd a chwythasant, ac a ruthrasant ar y tŷ hwnw; ac ni syrthiodd; oblegid sylfaenesid ef ar y graig. A phob un a’r sydd yn gwrandaw fy ngeiriau hyn, ac heb eu gwneuthur, a gyffelybaf i wr ffol, yr hwn a adeiladodd ei dŷ ar y tywod; a’r gwlaw a ddisgynodd, a’r llif-ddyfroedd a ddaethant, a’r gwyntoedd a chwythasant, ac a gurasant ar y tŷ hwnw; ac efe a syrthiodd, a’i gwymp a fu fawr."
            },
            "7": {
                "0": "Ac yn awr, gygwyddodd ar ol i’r Iesu lefaru y geiriau hyn, iddo ddywedyd wrth y denddeg a ddewisodd, Chwychwi yw fy nyscyblion; ac yr ydych yn oleuni i’r bobl hyn, y rhai ydynt weddill o dŷ Joseph. Ac wele, hon yw gwlad eich etifeddiaeth; ac y mae y Tad wedi ei rhoddi i chwi. Ac nid yw y Tad un amser wedi gorchymyn i mi fynegi hyn wrth eich brodyr yn Jerusalem; ac nid yw y Tad un amser wedi gorchymyn i mi fynegi wrthynt am lwythau ereill tŷ Isael, y rhai a arweiniodd y Tad allan o’r wlad. Cymmaint â hyn a orchymynodd y Tad i mi fynegi wrthynt hwy, Defaid ereill sydd genyf, y rhai nid ydynt o’r gorlan hon; y rhai hyny hefyd sydd raid i mi eu cyrchu, a’m llais i a wrandawant; a bydd un gorlan, ac un bugail. Ac yn awr, o herwydd gwargaledrwydd ac anghrediniaeth, ni ddeallasant fy ngair: am hyny, gorchymynwyd i mi gan y Tad, na ddywedwn ychwaneg wrthynt hwy ynghylch y peth hwn. Eithr, yn wir, meddaf i chwi, mae y Tad wedi gorchymyn i mi, ac yr wyf yn ei fynegi wrthych, i chwi gael eich gwahanu o’u mysg hwynt o herwydd eu drygioni; am hyny, eu drygioni yw yr achos na wyddant am danoch chwi. Ac yn wir, meddaf i chwi drachefn, fod y Tad wedi gwahanu y llwythau ereill oddiwrthynt; a’u drygioni yw yr achos na wyddant am danynt. Ac yn wir, meddaf wrthych, chwychwi yw y rhai hyny y dywedais am danynt, Defaid ereill sydd genyf, y rhai nid yndynt o’r gorlan hon; y rhai hyny hefyd sydd raid i mi eu cyrchu, a’m llais i a wrandawant; a bydd un gorlan, ac un bugail. A hwynt hwy ni’m deallent, canys tybient mai y Cenedloedd oeddynt; canys ni ddeallent mai trwy eu pregethu hwy yr argyhoeddid y Cenedloedd ac ni ddeallent fi pan y dywedais y caent glywed fy llais; ac ni ddeallent fi na chai y Cenedloedd un amser glywed fy llais; na amlygwn fy hun iddynt hwy, ond trwy yr Ysbryd Giân. Eithr wele, chwi a glywsoch fy llais, ac a’m gwelsoch; a chwi yw fy nefaid, a chyfrifir chwi yn mhlith y rhai a roddodd y Tad i mi. Ac yn wir, yn wir, meddaf i chwi, y mae genyf ddefaid ereill, y rhai nid ydynt o’r wlad hon, nac o wlad Jerusalem, nac ychwaith yn unrhyw ranau o’r wlad hono oddiamgylch, yn mha le y bum yn gweinidogaethu. Canys hwynt-hwy am y rhai y llefarwyf, yw y rhai hyny nad ydynt etto wedi clywed fy llais; ac nid wyf fi un amser wedi amlygu fy hun iddynt. Eithr mi a dderbyniais orchymyn gan y Tad, fod i mi fyned atynt hwy, a bod iddynt gael clywed fy llais, a chael eu cyfrif gyda fy nefaid, fel y byddo un gorlan, ac un bugail; am hyny, yr wyf fi yn myned i ddangos fy hun iddynt. Ac yr wyf yn gorchymyn i chwi ysgrifenu y geiriau hyn, ar ol fy myned, fel os dygwydd i’m pobl yn Jerusalem, y rhai a’m gwelsant, ac a fuont gyda mi yn fy ngweinidogaeth, beidio gofyn i’r Tad yn fy enw i, fel y derbyniont wybodaeth am danoch chwi trwy yr Ysbryd Glân, ac hefyd am y llwythau ereill y rhai nis gwyddant am danynt, y byddo i’r geiriau hyn a ysgrifenwch gael eu cadw, a’u hamlygu i’r Cenedloedd, fel trwy gyflawnder y Cenedloedd, y byddo i weddill eu had hwy, ag a wasgerir ar wyneb yr holl ddaear, o herwydd eu hanghrediniaeth, gael eu dwyn i mewn, neu eu dwyn i wybodaeth am danaf fi, eu Gwaredwr. Ac yna mi a’u casglaf hwynt i mewn o bedwar cwr y ddaear; ac yna y cyflawnaf y cyfammod a wnaeth y Tad â holl bobl tŷ Israel. A gwynfyd y Cenedloedd, o herwydd eu crediniaeth ynof fi, yn a thrwy yr Ysbryd Glân, yr hwn a dystiolaetha wrthynt am danaf fi ac am y Tad. Wele, oblegid eu crediniaeth hwy ynof fi, medd y Tad, ac o herwydd eich anghrediniaeth chwithau, O dŷ Israel, y gwirionedd yn y dyddiau diweddaf a ddaw at y Cenedloedd, fel yr amlyger cyflawnder y pethau hyn iddynt hwy. Eithr gwae, medd y Tad, y rhai anghrediniol o’r Cenedloedd, canys er eu bod wedi dyfod ar wyneb y tir hwn, ac wedi gwasgaru fy mhobl, y rhai ydynt o dŷ Israel; a’m pobl y rhai ydynt o dŷ Israel, a fwriwyd allan o’u mysg, ac a fathrwyd ganddynt dan draed; ac o herwydd trugareddau y Tad tuag at y Cenedloedd, ac hefyd farnedigaethau fy Nhad ar fy mhobl, y rhai ydynt o dŷ Israel, yn wir, yn wir, meddaf i chwi, mai ar ol hyn oll, ac mi a achosais i’m pobl y rhai ydynt o dŷ Israel, gael eu taraw, a’u cystuddio, a’u lladd, a’u bwrw allan o’u mysg, a’u casâu ganddynt, ac i fyned yn ddiareb ac yn watwargerdd yn eu plith. Ac fel hyn y gorchymyna y Tad i mi ddywedyd wrthych, yn y dydd y pecho y Cenedloedd yn erbyn fy efengyl, ac yr ymddyrchafont yn malchder eu calonau uwchlaw pob cenedl, ac uwchlaw holl bobl y ddaear i gyd, ac yr ymlenwont â phob math o gelwyddau, a thwyll, a drygioni, â phob math o gelwyddau, a thwyll, a drygioni, a phob math o ragrith, a llofruddiaethau, a chrefydd-dwyll, a phuteindra, a dirgel ffieidd-dra; ac os gwnant yr holl bethau hyn, a gwrthod cyflawnder fy efengyl, wele, medd y Tad, mi a ddygaf gyflawnder fy efengyl o’u mysg hwynt; ac yna mi a gofiaf fy nghyfammod yr hwn a wnaethym â’m pobl, O dŷ Israel, ac a ddygaf fy efengyl iddynt; ac mi a ddangosaf i ti, O dŷ Israel, na chaiff y Cenedloedd awdurdod arnat, eithr mi a gofiaf fy nghyfammod â thi, O dŷ Israel, a thi a gai ddyfod i wybodaeth o gyflawnder fy efengyl. Eithr os na edifarha y Cenedloedd, a dychwelyd ataf fi, medd y Tad, wele, hwy a gyfrifir yn mhlith fy mhobl i, O dŷ Israel; ac ni oddefaf i’m pobl, y rhai ydynt o dŷ Israel, fyned trwy eu canol hwynt, a’u mathru i lawr, medd y Tad. Eithr os na throant ataf fi, a gwrandaw ar fy llais, mi a oddefaf iddynt, ïe mi a oddefaf i’m pobl, O dŷ Israel, fyned trwy eu canol hwynt, a’u mathru i lawr, a hwy a fyddant megys halen wedi colli ei flâs, yr hwn wedi hyny nid yw dda i ddim, ond i’w daflu allan, a’i sathru dan draed fy mhobl, O dŷ Israel. Yn wir, yn wir, meddaf i chwi, fel hyn y gorchymynodd y Tad i mi, ar roddi o honof i’r bobl yma, y tir hwn yn etifeddiaeth. A phan gyflawnir geiriau y prophwyd Isaiah, y rhai a ddywedant: Dy wylwyr a ddyrchafant lef; gyda’r llef y cydganant; canys gwelant lygad yn llygad, pan ddychwelo yr Arglwydd Seion. Bloeddiwch, cydgenwch, anialwch Jerusalem; canys yr Arglwydd a gysurodd ei bobl, efe a waredodd Jerusalem. Diosgodd yr Arglwydd fraich ei santeiddrwydd yn ngolwg yr holl genedloedd; a holl gyrau y ddaear a welant iachawdwriaeth ein Duw ni."
            },
            "8": {
                "0": "A bu ar ol i’r Iesu gyffwrdd â hwynt oll, i gwmwl ddyfod a gorchuddio y dyrfa fel nas gallent weled yr Iesu. A thra yr oeddynt yn orchuddiedig, efe a ymadawodd oddi wrthynt, ac a esgynodd i’r nef. A’r dyscyblion a welsant ac a ddygasant dystiolaeth iddo ef esgyn drachefn i’r nef."
            },
            "9": {
                "0": "A bydd i’r amser ddyfod, pan y caiff cyflawnder fy efengyl ei phregethu iddynt, a hwy a gredant ynof, mai myfi yw Iesu Grist, Mab Duw, ac a weddiant ar y Tad yn fy enw. Yna eu gwylwyr a ddyrchafant eu llef, a chyda’r llef y cyd-ganant; canys gwelant lygad yn llygad. Yna y casgla y Tad hwynt ynghyd drachefn, ac y rhodda iddynt Jerusalem yn wlad eu hetifeddiaeth. Yna y bloeddiant allan—cyd-genwch, anialwch Jerusalem; canys yr Arglwydd a gysurodd ei bobl, efe a waredodd Jerusalem. Diosgodd y Tad fraich ei santeiddrwydd yn ngolwg yr holl genedloedd; a holl derfynau y ddaear a welant iachawdwriaeth y Tad; a’r Tad a minnau un ydym. Ac yna y dygir oddiamgylch yr hyn a ysgrifemwud. Deffro, deffro drachefn, gwisg dy nerth, Seion; gwisg wisgoedd dy ogoniant, santaidd ddinas Jerusalem, canys ni ddaw o’th fewn mwy ddienwaededig ac aflan. Ymysgwyd o’r llwch, cyfod, eistedd, Jerusalem; ymddattod oddiwrth rwymau dy wddf, ti gaethferch Seion. Canys fel hyn y dywed yr Arglwydd, Yn rhad yr ymwerthasoch; ac nid ag arian y’ch gwaredir. Yn wir, yn wir, meddaf i chwi, fy mhobl a gânt adnabod fy enw; ïe, yn y dydd hwnw y cânt adnabod fy enw; ïe, yn y dydd hwnw y cânt wybod mai myfi yw yr hwn sydd yn dywedyd. Ac yna y y dywedant, Mor hyfryd ar y mynyddoedd yw traed yr hwn sydd yn efengylu iddynt, yn cyhoeddi heddwch: a’r hwn sydd yn mynegi daioni iddynt, yn cyhoeddi iachawdwriaeth; yn dywedyd wrth Seion, Dy Dduw di sydd yn teyrnasu! Ac yna yr â gwaedd allan, Ciliwch, ciliwch, ewch allan oddi yno, na chyffyrddwch â dim halogedig; ewch allan o’i chanol; ymlanhewch, y rhai a ddygwch lestri yr Arglwydd. Canys nid ar frys yr ewch allan, ac nid ar ffo y cerddwch; canys yr Arglwydd a â o’ch blaen chwi, a Duw Israel a’ch casgl chwi. Wele, fy ngwas a lwydda; efe a godir, ac a ddyrchefir, ac a fydd yn uchel iawn. Megys y rhyfeddodd llawer wrthyt (mor llygredig oedd ei wedd yn anad neb, a’i bryd yn anad meibion dynion); felly y taenella efe genedloedd lawer; breninoedd a gauant eu genau wrtho ef; canys gwelant yr hyn ni fynegasid iddynt, a deallant yr hyn ni chlywsent. Yn wir, yn wir, meddaf i chwi, yr holl bethau hyn a ddeuant yn ddiau, megys y gorchymynodd y Tad i mi. Yna y caiff y cyfammod hwn ag a gyfammododd y Tad â’i bobl, ei gyflawni; ac yna y preswylir Jerusalem drachefn â’m pobl i, a chaiff fod iddynt yn wlad eu hetifeddiaeth. Ac yn wir, meddaf i chwi, yr wyf yn rhoddi i chwi arwydd, fel y gwypoch yr amser pan fydd y pethau hyn ynghylch cymmeryd lle, y bydd i mi gasglu i mewn o’u hir wasgariad, fy mhobl, O dŷ Israel, a sefydlu yn eu plith hwynt drachefn fy Seion. Ac wele, hyn yw y peth a roddaf i chwi yn arwydd, canys yn wir, meddaf i chwi, pan fydd i’r pethau hyn ag wyf yn draethu i chwi, a’r hyn a draethaf i chwi ar ol hyn fy hun, a thrwy allu yr Ysbryd Glân, yr hwn a roddir i chwi gan y Tad, gael eu gwneuthur yn adnabyddus i’r Cenedloedd, fel y gwypont ynghylch y bobl hyn y rhai ydynt weddill o dŷ Jacob, ac ynghylch fy mhobl hyn y rhai a wasgerir ganddynt hwy; yn wir, yn wir, meddaf i chwi, pan wneir y pethau hyn yn adnabyddus iddynt hwy gan y Tad, ac y deilliant o’r Tad, oddi wrthynt hwy, atoch chwi, canys y mae yn ddoethineb yn y Tad iddynt gael eu sefydlu yn y tir hwn, a chael eu gosod i fyny fel pobl ryddion trwy allu y Tad, fel y delo y pethau hyn allan oddi wrthynt hwy at weddill o’ch had chwi, fel y cyflawner cyfammod y Tad yr hwn a ymgyfammododd efe â’i bobl, O dŷ Israel; am hyny, pan ddelo y gweithredoedd hyn, a’r gweithredoedd a gyflawnir yn eich plith chwi yn ol llaw, allan oddiwrth y Cenedloedd, at eich had chwi, y rhai a fethant mewn anghrediniaeth o herwydd anwiredd; canys felly y mae yn gweddu i’r Tad iddo ddyfod allan oddiwrth y Cenedloedd, fel y dangoso efe ei allu i’r Cenedloedd, i’r dyben hyn, fel y gallo y Cenedloedd, os na chaledant eu calonau, edifarhau a dyfod ataf fi, a chael eu bedyddio yn fy enw, a gwybod am wir bynciau fy athrawiaeth, fel y cyfrifer hwynt yn mhlith fy mhobl, O dŷ Israel; a phan ddêl y pethau hyn oddi amgylch, y dechreuo dy had di wybod y pethau hyn, bydd iddynt yn arwydd, fel y gwypont fod gwaith y Tad eisoes wedi dechreu hyd at gyflawniad y cyfammed a wnaeth efe â’r bobl y rhai ydynt o dŷ Israel. A phan ddelo y dydd hwnw, y bydd i freninoedd gau eu genau; canys gwelant yr hyn ni fynegasid iddynt, a deallant yr hyn ni chlywsant. Canys yn y dydd hwnw, er fy mwyn i, y Tad a wna waith, yr hwn a fydd yn waith mawr a rhyfedd yn eu mysg hwynt; a bydd yn eu mysg hwynt y cyfryw nas credant ef, er i ddyn ei draethu iddynt. Eithr, wele, bywyd fy ngwas a fydd yn fyllaw; am hyny, nis niweidiant ef, er yr anafir ef o’u hachos hwynt. Etto mi a’i hiachâf ef, canys mi a ddangosaf iddynt fod fy noethineb i yn fwy nâ chyfrwysdra y diafol. A bydd, gan hyny, pwy bynag ni chredant yn fy ngeiriau i, yr hwn wyf IesuGrist, y rhai a achosa y Tad iddo ef ddwyn allan i’r Cenedloedd, ac a rydd allu iddo ef eu dwyn hwynt allan i’r Cenedloedd (caiff ei wneuthur fel y dywedodd Moses), hwy a dorir ymaith o blith fy mhobl y rhai ydynt yn y cyfammod; a’m pobl y rhai ydynt weddill o Jacob, a fyddant yn mhlith y Cenedloedd, ïe, yn eu canol hwynt fel llew yn mhlith bwystfilod y goedwig, ac fel cenaw llew yn mhlith y deadelloedd defaid, yr hwn, pa êl trwodd, a sathra ac a ysglyfaetha, ac ni bydd achubydd. Eu llaw a ddyrchefir yn erbyn eu gwrthwynebwyr, a’u holl elynion a dorir ymaith. Ië, gwae y Cenedloedd, os na edifarhant, canys bydd yn y dydd hwnw, medd y Tad, i mi dori ymaith dy feirch o’th ganol di, a dinystrio dy gerbydau, a thoraf i lawr ddinasoedd dy wlad, a dymchwelaf dy holl amddiffynfeydd: a thoraf ymaith o’th law y swynion, ac ni bydd i ti ddewiniaid. Toraf hefyd i lawr dy luniau cerfiedig, a’th ddelwau o’th blith; ac ni chei ymgrymu mwyach i weithredoedd dy ddwylaw dy hun; a diwreiddiaf dy lwyni o’th ganol, a dinystriaf dy ddinasoedd. A bydd i bob celwydd, a thwyll, a chenfigen, ac amryson, a chrefydd-dwyll, a phuteindra, gael eu bwrw heibio. Canys bydd, medd y Tad, yn y dydd hwnw, pwy bynag ni edifarhant ac ni ddeuant at fy anwyl Fab, mi a’u toraf hwynt ymaith o blith fy mhobl, O dŷ Israel; ac a wnaf i ddialedd a llid ddyfod arnynt hwy, megys ag ar y cenedloedd, y fath ag na chlywsant."
            },
            "10": {
                "0": "Ac yn awr, dygwyddodd ar ol i’r Iesu lefaru y geiriau hyn, iddo ddywedyd wrthynt drachefn, ar ol iddo egluro iddynt yr holl ysgrythyrau ag oeddynt wedi dderbyn, Wele, ysgrythyrau ereill a fynwn i chwi eu hysgrifenu, y rhai nid ydynt genych. A bu iddo ddywedyd wrth Nephi, Dwg allan y coflyfr ag a gedwaist ti. Ac wedi i Nephi ddwyn y cof-lyfrau alan, a’u gosod o’i flaen, efe a daflodd ei olwg arnynt, ac a ddywedodd, Yn wir, meddaf i chwi, mi a orchymynais i’m gwas Samuel, y Lamaniad, am dystiolaethu wrth y bobl hyn, mai yn y dydd y gogoneddai y Tad ei enw ynof fi, y byddai llawer o saint yn cyfodi oddiwrth y meirw, ac yn ymddangos i lawer, ac yn gweinyddu iddynt. Ac efe a ddywedodd wrthynt, Ai ni bu felly? A’i ddyscyblion a’i hatebodd, gan ddywedyd, Do, Arglwydd, Samuel a brophwydodd yn ol dy eiriau di, a hwy a gyflawnwyd oll. A’r Iesu a ddywedodd wrthynt, Pa fodd y bu na ysgrifenasoch y peth hwn, ddarfod i lawer o saint adgyfodi ac ymddangos i laweroedd, a gweinyddu iddynt? A bu i Nephi gofio nad oedd y peth hwn wedi ei ysgrifenu. A bu i’r Iesu orchymyn iddo gael ei ysgrifenu; gan hyny, ysgrifenwyd ef yn ol fel y gorchymynodd."
            },
            "11": {
                "0": "Ac yn awr, dygwyddodd ar ol i’r Iesu draethu y pethau hyn, efe a’u hesboniodd i’r dyrfa, ac efe a esboniodd bob peth iddynt, yn fawrion a bychain. Ac efe a ddywedodd, Yr ysgrythyrau hyn ag nad oeddynt genych, a orchymynodd y Tad i mi eu rhoddi i chwi, canys yr oedd yn ddoethineb ynddo ef iddynt gael eu rhoddi i genedlaethau dyfodol. Ac efe a esboniodd bob peth, o’r dechreuad hyd yr amser y deuai efe yn ei ogoniant; ïe, sef pob peth ag a ddeuai ar wyneb y ddaear, hyd nes y buasai yr elfenau gan wir wrês yn toddi, a’r ddaear yn cael ei phlygu ynghyd fel rhol, a’r nefoedd a’r ddaear yn myned heibio; ac hyd y dydd mawr a diweddaf, pan y caiff pob pobl, a phob llwyth, a phob cenedl ac iaith, sefyll gerbron Duw, i gael eu barnu am eu gweithredoedd, pa un a fyddont ai da neu ddrwg; os byddant dda, i adgyfodiad bywyd tragywyddol; ac os byddant ddrwg, i adgyfodiad damnedigaeth, gan fod yn gyfatebol, y naill ar un llaw, a’r llall ar y llaw arall, yn ol y turgaredd, a’r cyfiawnder, a’r santeiddrwydd ag sydd yn Nghrist, yr hwn oedd cyn dechreuad y byd."
            },
            "12": {
                "0": "A dygwyddodd fel yr oedd dyscyblion yr Iesu yn teithio ac yn pregethu y pethau a glywsant ac a welsant, ac yn bedyddio yn enw yr Iesu, iddynt fod wedi ymgasglu ynghyd, ac yn un mewn gweddi alluog ac ympryd. A’r Iesu a ymddangosodd iddynt drachefn, canys yr oeddynt yn gweddio ar y Tad, yn ei enw; a’r Iesu a ddaeth ac a safodd yn eu canol hwynt, ac a ddywedodd wrthynt, Pa beth a ewyllysiwch i mi ei roddi i chwi? a hwythau a ddywedasant, Arglwydd, ewyllysiwn i ti fynegi yr enw wrth ba un y galwn yr eglwys hon; canys y mae dadleuon yn mhlith y bobl ynghylch y mater hwn. A’r Arglwydd a ddywedodd wrthynt, Yn wir, yn wir, meddaf i chwi, paham y mae’r bobl yn grwgnach ac ymddadleu o herwydd y peth hwn? Ai nid ydynt wedi darllen yr ysgrythyrau, y rhai a ddywedant y rhaid i chwi gymmeryd arnoch enw Crist, yr hwn yw fy enw i? Canys wrth yr enw hwn y gelwir chwi yn y dydd diweddaf; a phwy bynag sydd yn cymmeryd arno fy enw i, ac yn parhau hyd y diwedd, a fydd cadwedig yn y dydd diweddaf; am hyny, pa beth bynag a wnewch, gwnewch ef yn fy enw i; am hyny, chwi a gewch alw yr eglwys ar fy enw i; a chwi a gewch alw ar y Tad yn fy enw i, am iddo fendithio yr eglwys er fy mwyn; a pha fodd y mae yn eglwys i mi, oni elwir hi ar fy enw? Canys os gelwir eglwys ar enw Moses, yna eglwys Moses fydd; neu os gelwir hi ar enw dyn, yna eglwys dyn fydd; eithr os gelwir hi ar fy enw i, yna fy eglwys i ydyw, os ydynt wedi adeiladu ar fy efengyl. Yn wir, meddaf i chwi, yr ydych chwi wedi eich adeiladu ar fy efengyl; am hyny, chwi a gewch alw pa bethau bynag a alwch, yn fy enw i; am hyny, os galwch ar y Tad, dros yr eglwys, os bydd yn fy enw i, y Tad a’ch clyw chwi; ac os bydd yr eglwys wedi ei hadeiladu ar fy efengyl, yna y Tad a ddengys ei weithredoedd ei hun ynddi; eithr os na fydd wedi ei hadeiladu ar fy efengyl, ac wedi ei hadeiladu ar weithredoedd dyn, neu ar weithredoedd y diafol, yn wir, meddaf i chwi, y maent yn cael llawenydd yn eu gweithredoedd dros dymmor, a maes o law mae y diwedd yn dyfod, a hwy a dorir i lawr ac a fwrir i’r tân, o ba le nid oes dychweliad; canys y mae eu gweithredoedd yn eu canlyn hwynt, canys oblegid eu gweithredoedd y torir hwynt i lawr; am hyny, cofiwch y pethau a fynegais i chwi. Wele, mi a roddais i chwi fy efengyl, a hyn yw yr efengyi a roddais i chwi, i mi ddyfod i’r byd i wneuthur ewyllys fy Nhad, o herwydd i’m Tad fy nanfon; a’m Tad a’m danfonodd fel y cawn fy nyrchafu ar y groes; ac ar ol i mi gael fy nyrchafu ar y groes, y gallwn dynu pawb ataf; ac megys ag y dyrchafwyd fi gan ddynion, felly hefyd y dyrchefir dynion gan y Tad, i sefyll ger fy mron i, i gael eu barnu am eu gweithredoedd, pa un bynag a fyddont ai da neu ddrwg; ac i’r dyben yma y dyrchafwyd fi; am hyny, yn ol gallu y Tad, mi a dynaf bawb ataf, fel y barner hwynt yn ol eu gweithredoedd. A bydd, pwy bynag a edifarhao ac a fedyddier yn fy enw i, a lenwir; ac os parha hyd y diwedd, wele, efe a fydd ddieuog gerbron fy Nhad, yn y dydd y safaf i farnu y byd. A’r hwn ni pharhao hyd y diwedd, efe yw yr hwn a dorir i lawr ac a fwrir i’r tân, o ba le ni fydd dychweliad mwyach, o herwydd cyfiawnder y Tad; ac hwn yw y gair a roddodd efe i blant dynion. Ac i’r dyben yma y cyflawnodd efe y geiriau a roddodd, ac nid yw yn dywedyd celwydd, eithr yn cyflawni ei holl eiriau; ac nis gall dim aflan fyned i mewn i’w deyrnas; am hyny, nid oes dim yn myned i mewn i’w orphwysfa ef, ond y rhai a olchasant eu dillad yn fy ngwaed, oblegid eu ffydd, a’u hedifeirwch am eu holl bechodau, a’u ffyddlondeb hyd y diwedd. Yn awr, hwn yw y gorchymyn, Edifarhewch, chwi holl derfynau y ddaear, a deuwch ataf fi, a chymmerwch eich bedyddio yn fy enw, fel y santeiddier chwi trwy dderbyniad yr Ysbryd Glân, fel y safoch yn ddifrycheulyd ger fy mron yn y dydd diweddaf. Yn wir, yn wir, meddaf i chwi, hon yw fy efengyl; a chwi a wyddoch y pethau sydd raid i chwi eu gwneuthur yn fy eglwys; canys y gweithredoedd a welsoch fi yn eu gwneuthur, a gewch chwithau eu gwneuthur hefyd; canys yr hyn a welsoch fi yn ei wneuthur, hyny a gewch chwithau ei wneuthur; am hyny, os gwnewch y pethau hyn, gwyn eich byd, canys chwi a ddyrchefir yn y dydd diweddaf."
            },
            "13": {
                "0": "A bydd, pan welo yr Arglwydd yn ei ddoethineb yn addas, y cânt weinidogaethu i holl lwythau gwasgaredig Israel, ac i bob cenedl, llwyth, iaith, a phobl, a dwyn allan o honynt i’r Iesu laweroedd o eneidiau, fel y cyflawner eu dymuniad, ac hyny trwy allu argyhoeddiadol Duw yr hwn sydd ynddynt; ac y maent megys angylion Duw, ac os gweddiant ar y Tad yn enw yr Iesu, hwy a allant ddangos eu hunain i ba ddyn bynag a ewyllysiont; am hyny, gweithredoedd mawrion a rhyfedd a wneir ganddynt hwy, cyn y dydd mawr sydd yn dyfod, pan y rhaid i’r holl bobloedd sefyll gerbron brawdle Crist; ïe, hyd y nod yn mhlith y Cenedloedd, y caiff gwaith mawr a rhyfedd ei wneuhur ganddynt, cyn dydd y farn. A phe buasai genych yr holl ysgrythyrau ag sydd yn rhoddi hanes am holl weithredoedd rhyfeddol Crist, chwi a wypech, yn ol geiriau Crist, fod yn rhaid i’r pethau hyn ddyfod. A gwae yr hwn ni wrandawo ar eiriau yr Iesu, ac hefyd y rhai a ddewisodd ac a ddanfonodd efe i’w mysg, canys yr hwn nid yw yn derbyn geiriau yr Iesu, a geiriau y rhai a ddanfonodd efe, nid yw yn ei dderbyn yntau; ac am hyny, yntau nis derbynia hwythau yn y dydd diweddaf; a buasai yn well iddynt pe nas ganesid hwynt. Canys a ydych chwi yn meddwl y gellwch gael gwared o gyfiawnder Duw tramgwyddedig, yr hwn a sathrwyd dan draed dynion, fel trwy hyny y deuai iachawdwriaeth? Ac yn awr, wele, megys ag y llefarais ynghylch y rhai a ddewisodd yr Arglwydd, ïe, y tri ag a gipiwyd i fyny i’r nef, nis gwyddwn pa un a lanhawyd hwynt o farwoldeb i anfarwoldeb. Eithr wele, er pan ysgrifenais, mi a ymofynais â’r Arglwydd, ac efe a’i hamlygodd i mi, fod yn rhaid fod cyfnewidiad wedi ei effeithio ar eu cyrff, onide fod yn rhaid iddynt brofi marwolaeth; am hyny, fel na phrofent farwolaeth, cafodd cyfnewidiad ei effeithio ar eu cyrff, fel na ddyoddefent boen na thristwch, oddieithr dros bechodau y byd. Yn awr, nid oedd y cyfnewidiad hwn yn gyfartal i’r cyfryw a gymmer le yn y dydd diweddaf; eithr effeithiwyd cyfnewidiad arnynt, yn gymmaint ag nas gallai satan gael awdurdod arnynt, fel nas gallai eu temtio hwynt, a hwy a santeiddiwyd yn y cnawd, fel yr oeddynt yn santaidd, ac fel na allai galluoedd y ddaear eu dal hwynt; ac yn y sefyllfa hon yr oeddynt i aros hyd ddydd barn Crist; ac yn y dydd hwnw yr oeddynt i dderbyn cyfnewidiad mwy, c i gael eu derbyn deyrnas y Tad, heb fyned allan mwy, eithr i drigo gyda Duw yn dragywyddol yn y nefoedd. Ac yn awr, wele, yr wyf yn dywedyd wrthych, pan welo yr Arglwydd yn addas yn ei ddoethineb, i’r geiriau hyn ddyfod at y Cenedloedd, yn ol ei air, yna y gellwch wybod fod y cyfammod a wnaeth y Tad â phlant Israel, yn nghylch eu hadferiad i diroedd eu hetifeddiaeth, eisoes yn dechreu cael ei gyflawni; a gellwch wybod y bydd i eiriau yr Arglwydd, y rhai a lefarwyd gan y prophwydi santaidd, gael eu cyflawni oll; ac nid oes achos i chwi ddywedyd fod yr Arglwydd yn cedi ei ddyfodiad at blant Israel; ac nid oes achos i chwi dybied yn eich ealonau fod y geiriau a lefarwyd yn ofer, canys, wele, yr Arglwydd a gofia ei gyfammod yr hwn a wnaeth â’i bobl o dŷ Israel. A phan weloch chwi yr ymadroddion hyn yn dyfod allan yn eich mysg, yna nid oes achos i chwi mwyach ddiystyru gweithredoedd yr Arglwydd, canys y mae cleddyf ei gyfiawnder yn ei ddeheulaw; ac wele, yn y dydd hwnw, os diystyrwch ei weithredoedd, efe a achosa iddo eich goddiweddu yn fuan. Gwae yr hwn a ddiystyro weithredoedd yr Arglwydd; ïe, gwae yr hwn a wado Grist a’i weithredoedd; ïe, gwae yr hwn a wado ddadguddiadau yr Arglwydd, ac a ddywedo, Nid yw yr Arglwydd mwyach yn gweithio trwy ddadguddiad, neu trwy brophwydoliaeth, neu trwy ddoniau, neu trwy dafodau, neu trwy iachâu, neu trwy allu yr Ysbryd Glân; ïe, a gwae yr hwn a ddywedo yn y dydd hwnw, Nis gall un wyrth gael ei chyflawni trwy Iesu Grist, er mwyn elw; canys yr hwn a wnelo hyn, a fydd yn gyffelyb i fab y golledigaeth, i’r hwn nid oedd drugaredd, yn ol gair Crist. Ië, ac nid oes achos yn hŵy i chwi hwtio, na diystyru, na gwawdio yr Iuddewon, nac unrhyw weddill o dŷ Israel, canys wele, mae yr Arglwydd yn cofio ei gyfammod â hwynt, ac efe a wna iddynt yn ol yr hyn a dyngodd; am hyny, na thybiwch y gellwch droi llaw ddeheu yr Arglwydd at yr aswy, fel na weinydelo farn er cyflawni ei gyfammod yr hwn a wnaeth â thŷ Israel."
            },
            "14": {
                "0": "Clywch, O chwi Genedloedd, a gwrandewch eiriau Iesu Grist, Mab y Duw byw, y rhai y gorchymynodd efe i mi lefaru mewn perthynas i chwi; canys, wele, gorchymynodd i mi ysgrifenu, gan ddywedyd, Trowch, chwi yr holl Genedloedd, oddiwrth eich ffyrdd drygionus, ac edifarhewch am eich gweithredoedd drwg, am eich celwydd a’ch twyll, ac am eich puteindra, ac am eich dirgel ffieidd-dra, a’ch eilun-addoliaeth, a’ch llofruddiaethau, a’ch crefydd-dwyll, a’ch cenfigen, a’ch amrysonau, ac oddiwrth eich holl ddrygioni a’ch ffieidd-dra, a deuwch ataf fi, a chymmerwch eich bedyddio yn fy enw, fel y derbynioch faddeuant o’ch pechodau, ac y llanwer chwi â’r Ysbryd Glân, fel y cyfrifer chwi gyda fy mhobl, y rhai ydynt o dy Israel."
            },
            "15": {},
            "16": {},
            "17": {},
            "18": {},
            "19": {},
            "20": {},
            "21": {},
            "22": {},
            "23": {},
            "24": {},
            "25": {},
            "26": {},
            "27": {},
            "28": {},
            "29": {},
            "30": {}
        }
    },
    "4-ne": {
        "meta": {
            "slug": "4-ne",
            "name": "Llyfr Nephi,",
            "chapterWord": "Pennod Ⅰ."
        },
        "chapters": {
            "1": {
                "intro": "Hanes pobl Nephi, yn ol ei gof-lyfr ef.",
                "0": "A bi ar p; o dri chant a phum mlynedd fyned heibio (ac yr oedd y bobl etto yn parhau mewn drygioni), i Amos farw, a’i frawd Ammaron a gadwai cof-lyfr yn ei le. A dygwyddodd, ar ol i dri chant ac ugain mlynedd fyned heibio, i Ammaron, gan gael ei ddirgymhell gan yr Ysbryd Glân, guddio y cof-lyfrau ag oeddynt yn gyssegredig; ïe, sef yr holl gof-lyfrau ag a drosglwyddwyd i lawr o genedlaeth i genedlaeth, y rhai oeddynt gyssegredig, hyd yr ugeinfed flwyddyn a thri chant er dyfodiad Crist. Ac efe a’u cuddiodd hwynt i’r Arglwydd, fel y denent drachefn i weddill tŷ Jacob, yn ol prophwydoliaethau ac addewidion yr Arglwydd. Ac fel hyn y mae diwedd cof-lyfr Ammaron."
            }
        }
    },
    "morm": {
        "meta": {
            "slug": "morm",
            "name": "Llyfr Mormon.",
            "chapterWord": "Pennod Ⅰ."
        },
        "chapters": {
            "1": {
                "0": "A bu i mi, Mormon, wrthod yn gwbl o’r pryd hwn allan fod yn llywydd a blaenor ar y bobl hyn, o herwydd eu drygioni a’u ffieidd-dra. Wele, yr oeddwn wedi eu harwain, er eu holl ddrygioni; yr oeddwn wedi eu harwain amryw droion i ryfel, ac wedi eu caru, yn ol cariad Duw yr hwn oedd ynof, â’m holl galon; a’m henaid a gafodd ei dywallt allan mewn gweddi at fy Nuw drostynt, trwy gydol y dydd; etto, yr oedd heb ffydd, o herwydd caledwch eu calonau. A thair gwaith y gwaredais hwynt allan o ddwylaw eu gelynion, ac nid ydynt wedi edifarhau am eu pechodau. Ac wedi iddynt dyngu i’r hyn a waharddwyd iddynt gan ein Harglwydd a’n Hiachawdwr Iesu Grist, yr elent i fyny at eu gelynion i ryfel, ac ymddial gwaed eu brodyr, wele, llef yr Arglwydd a ddaeth ataf, gan ddywedyd, Dïal sydd eiddof fi, ac mi a ad-dalaf; ac oblegid nad yw y bobl hyn yn edifarhau ar ol i mi eu gwaredu hwynt, wele, hwy a dorir ymaith oddiar wyneb y ddaear. A bu i mi gwbl wrthod myned i fyny yn erbyn fy ngelynion; ac mi a wnaethym megys y gorchymynodd yr Arglwydd i mi; ac mi a safais fel tyst segur i amlygu i’r byd y pethau a welais ac a glywais, yn ol amlygiadau yr ysbryd ag oedd wedi tystiolaethu am bethau i ddyfod. Am hyny, yr wyf yn ysgrifenu atoch chwi, Genedloedd, ac hefyd atoch chwithau, dŷ Israel, pan ddechreuo y gwaith, y byddwch chwi ynghylch parotoi i ddychwelyd i wlad eich etifeddiaeth: ïe, wele, yr wyf yn ysgrifenu at holl derfynau y ddaear; ïe, atoch chwithau, ddeuddeg llwyth Israel, y rhai a gewch eich barnu yn ol eich gweithredoedd, gan y ddeuddeg a ddewisodd yr Iesu i fod yn ddyscyblion iddo yn ngwlad Jerusalem. Ac yr wyf yn ysgrifenu hefyd at weddill y bobl hyn, y rhai hefyd a fernir gan y deuddeg a ddewisodd yr Iesu yn y wlad hon; a hwythau a fernir gan y deuddeg arall a ddewisodd yr Iesu yn ngwlad Jerusalem. A’r pethau hyn y mae yr ysbryd yn eu dangos i mi; am hyny, yr wyf yn ysgrifenu atoch oll. Ac i’r dyben hyn yr wyf yn ysgrifenu atoch, fel y gwypoch fod yn rhaid i chwi oll sefyll gerbron brawdle Crist, ïe, pob enaid ag sydd yn perthyn i holl deulu dynol Adda; a rhaid i chwi sefyll i gael eich barnu am eich gweithredoedd, pa un a fyddont ai da ai drwg; ac hefyd fel y credoch efengyl Iesu Grist, yr hon a gewch yn eich plith; ac hefyd fel y caffo yr Iuddewon, pobl gyfammodol yr Arglwydd, dyst arall heblaw yr hwn a welsant ac a glywsant, mai yr Iesu yr hwn a laddasant, oedd y gwir Grist, a’r gwir Dduw; ac mi a fynwn pe gallwn eich perswadio chwi, holl derfynau y ddaear, i edifarhau a pharotoi i sefyll gerbron brawdle Crist."
            },
            "2": {
                "0": "A bu yn y pedwar-ugeinfed flwyddyn a thri chant, i’r Lamaniaid drachefn ddyfod yn ein herbyn i ryfel, ac ni a safasom yn eu herbyn hwynt yn wrol; eithr yr oedd y cyfan yn ofer, canys yr oedd eu rhifedi mor fawr fel y mathrent bobl y Nephiaid dan eu traed. A bu i ni drachefn ffoi, a’r rhai ag oedd â’u ffoedigaeth yn gyflymach nâ’r Lamaniaid a ddiangasant, a’r rhai ag nad oedd eu ffoedigaeth yn gynt nâ’r Lamaniaid, a ysgubwyd i lawr ac a ddinystriwyd. Ac yn awr, wele, nid wyf fi, Mormon, yn dymuno dryllio eneidiau dynion wrth osod o’u blaen y fath olygfa ofnadwy o waed a chyflafan ag a osodwyd o flaen fy llygaid i; eithr gan fy mod yn gwybod yn ddiau fod yn rhaid i’r pethau hyn gael eu gwneuthur yn hysbys, a bod yn rhaid i bob peth cuddiedig gael ei ddadguddio ar benau y tai, ac hefyd fod yn rhaid i wybodaeth o’r pethau hyn ddyfod at weddill y bobl hyn, ac hefyd at y Cenedloedd, y rhai y dywedai yr Arglwydd a gaent wasgaru y bobl hyn, ac y cyfrifid y bobl hyn megys diddym yn eu mysg hwynt,—mi a ysgrifenais gan hyny dalfyriad bychan, heb feiddio rhoddi hanes cyflawn o’r pethau a welais, o herwydd y gorchymyn a dderbyniais, ac hefyd fel na chaffech chwi ormod tristwch o herwydd dyrgioni y bobl hyn. Ac yn awr, wele, hyn wyf yn ei lefaru wrth eu had hwynt, ac hefyd wrth y Cenedloedd, y rhai sydd a gofal tŷ Israel arnynt, ac yn gwybod o ba le y mae eu bendithion yn dyfod. Canys mi a wn y tristâ y cyfryw oblegid drygfyd tŷ Israel; ïe, hwy a dristânt oblegid dinystr y bobl hyn; hwy a dristânt am nad edifarhaodd y bobl hyn, fel y gallent gael eu cofleidio yn mreichiau yr Iesu. Yn awr, mae y pethau hyn yn cael eu hysgrifenu at weddill tŷ Jacob; ac y maent wedi eu hysgrifenu yn y modd hyn, oblegid y gwyddis oddiwrth Dduw na ddwg drygioni hwynt allan iddynt; ac y maent i gael eu cuddio i’r Arglwydd, fel y delont allan yn ei amser cyfaddas ei hun. Ac hwn yw y gorchymyn a dderbyniais i; ac wele, hwy a ddeuant allan yn ol gorchymyn yr Arglwydd, pan welo efe yn addas yn ei ddoethineb. Ac wele, hwy a gânt fyned at yr anghrediniol o’r Iuddewon; ac i’r dyben hyn y cânt fyned, fel y perswadier hwy mai yr Iesu yw y Crist, Mab y Duw byw; fel y dygo y Tad oddiamgylch, trwy ei un anwylaf, ei fwriad mawr a thragywyddol, o adferu yr Iuddewon, neu holl dŷ Israel, i wlad eu hetifeddiaeth, yr hon y mae yr Arglwydd eu Duw wedi ei rhoddi iddynt, hyd at gyflawni ei gyfammod, ac hefyd fel y byddo i hâd y bobl hyn gredu ei efengyl yn fwy llwyr, yr hon a â allan iddynt oddiwrth y Cenedloedd; canys y bobl hyn a gânt eu gwasgaru, ac a ânt yn bobl dywyll, ffiaidd, ac atgas, tuhwnt i ddesgrifiad yr hyn a fu erioed yn ein plith ni; ïe, sef yr hyn a fu yn mhlith y Lamaniaid; a hyn oblegid eu hanghrediniaeth a’u heilun-addoliaeth. Canys wele, y mae ysbryd yr Arglwydd eisoes wedi darfod amryson â’u tadau, ac y maent hwythau heb Grist na Duw yn y byd, a gyrir hwynt oddiamgylch megys ûs o flaen y gwynt. Yr oeddynt unwaith yn bobl ddymunol, a chanddynt Grist yn fugail arnynt; ïe, hwy a arweinid hyd y nod gan Dduw y Tad. Eithr yn awr, wele, hwy a arweinir oddiamgylch gan satan, fel ûs yn cael ei yru o flaen y gwynt, neu fel llong yn cel ei thaflu o amgylch gan y tònau, heb hwyl nac angor, na dim i’w llywio; ac megys y mae hi, felly y maent hwythau. Ac wele, yr Arglwydd a gadwodd eu bendithion hwy, y rhai allasent dderbyn yn y wlad, er mwyn y Cenedloedd y rhai a gânt etifeddu y tir. Eithr wele, dygwydda iddynt gael eu gyru a’u gwasgaru gan y Cenedloedd, ac ar ol iddynt gael eu gyru a’u gwasgaru gan y Cenedloedd, wele, yna yr Arglwydd a gofia y cyfammod yr hwn a wnaeth i Abraham, ac i holl dŷ Israel. Ac hefyd yr Arglwydd a gofia weddiau y rhai cyfiawn, y rhai a ddanfonwyd i fyny ato ef drostynt. Ac yna, O chwi Genedloedd, pa fodd y gellwch sefyll o flaen gallu Duw, oddieithr i chwi edifarhau a dychwelyd oddiwrth eich ffyrdd drygionus! Ai ni wyddoch eich bod yn nwylaw Duw? Ai ni wyddoch fod ganddo ef bob gallu, ac mai wrth ei orchymyn mawr y caiff y ddaear ei phlygu ynghyd megys rhol? Am hyny, edifarhewch, ac ymddarostyngwch ger ei fron, rhag iddo ddyfod allan mewn barn yn eich erbyn; rhag i weddill o hâd Jacob fyned allan yn eich mysg megys llew, a’ch rhwygo, ac ni bydd achubydd."
            },
            "3": {
                "0": "Ac yn awr, wele, mi a fynwn lefaru rhywfaint wrth weddill y bobl hyn ag ydynt wedi eu harbed, os dygwydd i Dduw roddi iddynt fy ngeiriau, fel y gwybyddont am bethau eu tadau; ïe, yr wyf yn llefaru wrthych chwi weddill ty Israel; a’r rhai hyn yw y geiriau wyf yn lefaru, Gwybyddwch eich bod chwi o dy nis gellir eich achub. Gwybyddwch y rhaid i chwi osod i lawr eich arfau rhyfel, a pheidio ymhyfrydu mwyach i dywallt gwaed, a pheidio eu cymmeryd drachefn, oddieithr i Dduw orchymyn i chwi. Gwybyddwch y rhaid i chwi ddyfod i wybodaeth am eich tadau, ac edifarhau am eich holl bechodau a’ch anwireddau, a chredu yn Iesu Grist, mai efe yw Mab Duw, ac iddo gael ei ladd gan yr Iuddewon, a thrwy allu y Tad iddo gyfodi drachefn, trwy yr hyn y buddugoliaethodd ar y bedd; ac hefyd mai ynddo ef y llyncwyd colyn angeu. Ac y mae efe yn dwyn oddiamgylch adgyfodiad y meirw, trwy yr hyn y rhaid i ddyn gael ei gyfodi i sefyll gerbron ei frawdle ef. Ac efe a ddygodd oddiamgylch brynedigaeth y byd, trwy yr hyn y rhoddir i’r sawl a geir yn ddieuog ger ei fron ef yn nydd y farn, i drigo yn mhresennoldeb Duw yn ei deyrnas, i ganu mawl diddarfod gyda’r côrau fry, i’r Tad, ac i’r Mab, ac i’r Ysbryd Glân, y rhai ydynt un Duw, mewn sefyllfa o ddedwyddwch diddiwedd. Am hyny, edifarhewch, a bedyddier chwi yn enw Iesu Grist, a gafaelwch yn efengyl Crist, yr hon a osodir o’ch blaen chwi, nid yn unig yn y cof-lyfr hwn, ond hefyd yn y cof-lyfr a ddaw i’r Cenedloedd oddiwrth yr Iuddewon, yr hwn gof-lyfr a ddaw oddiwrth y Cenedloedd atoch chwi. Canys wele, ysgrifenir hwn i’r dyben i chwi gredu hwnw; ac os credwch hwnw, chwi a gredwch hwn hefyd; ac os credwch hwn, chwi a wybyddwch ynghylch eich tadau, ac hefyd y gweithredoedd rhyfeddol a weithredwyd gan allu Duw yn eu mysg hwynt; a chwi a wybyddwch hefyd eich bod yn weddill o had Jacob; am hyny cyfrifir chwi yn mhlith pobl y cyfammod cyntaf; ac os dygwydd i chwi gredu yn Nghrist, a chael eich bedyddio, yn gyntaf â dwfr, yna â thân ac â’r Ysbryd Glân, gan ddilyn esiampl ein Hiachawdwr yn ol yr hyn a ochymynodd i ni, bydd yn dda arnoch yn nydd y farn. Amen."
            },
            "4": {
                "0": "Ac yn awr, wele, ni a ysgrifenasom y cof-lyfr hwn yn ol ein gwybodaeth o’r llythyrenau, y rhai a elwir yn ein mysg ni yr Aifftaeg ddiwygiedig, wedi ei throsglwyddo i waered a’i chyfnewid genym ni, yn ol ein dull o lefaru. A phe buasai ein llafnau yn ddigon mawr, buasem wedi ysgrifenu yn yr Hebraeg; eithr y mae’r Hebraeg wedi ei chyfnewid genym ni hefyd; a phe gallasem ysgrifenu yn yr Hebraeg, wele, ni fuasai un anmherffeithrwydd yn ein cof-lyfr. Eithr yr Arglwydd a ŵyr y pethau a ysgrifenasom, ac na ŵyr neb pobl arall ein iaith; am hyny, efe a barotodd offerynau er eu cyfieithu. Ac y mae’r pethau hyn yn cael eu hysgrifenu, fel y glanhaom ein dillad oddiwrth waed ein brodyr y rhai a fethasant mewn anghrediniaeth. Ac wele, y peethau hyn ag a ddymunasom ynghylch ein brodyr, ïe, sef eu hadferiad i wybodaeth o Grist, ydynt yn unol â gweddiau yr holl saint ag ydynt wedi preswylio yn y tir. A chaniataed yr Arglwydd Iesu Grist i’w gweddiau gael eu hateb yn ol eu ffydd; a boed i Dduw y Tad gofio o cyfammod yr hwn a wnaeth â thŷ Israel; a boed iddo eu bendithio hwynt yn dragywydd, trwy ffydd yn enw Iesu Grist. Amen."
            },
            "5": {},
            "6": {},
            "7": {},
            "8": {},
            "9": {}
        }
    },
    "ether": {
        "meta": {
            "slug": "ether",
            "name": "Llyfr Ether.",
            "chapterWord": "Pennod Ⅰ."
        },
        "chapters": {
            "1": {
                "0": "A bu i’r Arglwydd orchymyn iddo selio i fyny y ddwy gareg a dderbyniodd, a pheidio eu dangos, hyd nes y dangosai yr Arglwydd hwynt i blant dynion. A’r Arglwydd a orchymynodd i frawd Jared fyned i lawr o’r mynydd oddiwrth bresennoldeb yr Arglwydd, ac ysgrifenu y pethau a welodd; a gwaharddwyd hwynt i ddyfod at blant dynion, hyd nes y byddai ar ol ei ddyrchafu ef ar y groes; ac o herwydd hyn y cadwodd y brenin Mosiah hwynt, fel na chaent ddyfod at y byd hyd nes y byddai ar ol i Grist ddangos ei hun i’w bobl. Ac ar ol i Grist yn ddiau ddangos ei hun i’w bobl, efe a orchymynodd iddynt gael eu hamlygu. Ac yn awr, ar ol hyny, y maent hwy oll wedi methu mewn anghrediniaeth, ac nid oes neb, oddieithr y Lamaniaid, ac y maent hwy wedi gwrthod efengyl Crist; am hyny, gorchymynir i mi eu cuddio hwynt drachefn yn y ddaear. Wele, mi a ysgrifenais ar y llafnau hyn y pethau a welodd brawd Jared; ac ni chafodd pethau mwy erioed eu hamlygu, na’r hyn a amlygwyd i frawd Jared; am hyny, yr Arglwydd a orchymynodd i mi eu hysgrifenu hwynt; ac mi a’u hysgrifenais hwynt. Ac efe a orchymynodd i mi eu selio hwynt i fyny; ac efe a orchymynodd hefyd i mi selio i fyny eu cyfieithad; am hyny, mi a seliais i fyny y cyfieithwyr, yn ol gorchymyn yr Arglwydd. Canys yr Arglwydd a ddywedodd wrthyf, Ni chant fyned allan at y Cenedloedd hyd y dydd yr edifarhant am eu hanwiredd, ac y dueant yn lân gerbron yr Arglwydd; ac yn y dydd yr ymarferont ffydd ynof fi, medd yr Arglwydd, ïe, megys ag y gwnaeth brawd Jared, fel y delont yn santeiddiedig ynof fi, yna yr amlygaf iddynt y pethau a welodd brawd Jared, hyd at egluro iddynt fy holl ddadguddiadau, medd Iesu Grist, Mab Duw, Tad y nefoedd a’r ddaear, a phob peth ag sydd ynddynt. A’r hwn a ymdrecho yn erbyn gair yr Arglwydd, bydded felldigedig; a’r hwn a wado y pethau hyn, bydded felldigedig; canys i’r cyfryw nis dangosaf bethau mwy, medd Iesu Grist, canys myfi yw yr hwn sydd yn llefaru; ac wrth fy nghorchymyn y mae’r nefoedd yn cael ei hagor a’i chau; ac wrth fy ngair, yr ysgydwa y ddaear; ac wrth fy ngorchymyn, yr â ei thrigolion heibio, megys trwy dân; a’r hwn nad yw yn credu fy ngeiriau i, nid yw yn credu fy nyscyblion; ac os nad myfi sydd yn llefaru, bernwch chwi; canys chwi a gewch wybod mai myfi sydd yn llefaru, yn y dydd diweddaf. Eithr yr hwn sydd yn credu y pethau hyn ag wyf wedi lefaru, mi a ymwelaf ag ef ag eglurhad fy ysbryd; ac efe a gaiff wybod a dwyn tystiolaeth. Canys trwy fy ysbryd efe a gaiff wybod fod y pethau hyn yn wir; canys y mae efe yn perswadio dynion i wneuthur daioni; a pha beth bynag sydd yn perswadio dynion i wneuthur daioni, sydd o honof fi; canys nid yw daioni yn dyfod oddiwrth neb, ond oddiwrthyf fi. Myfi yw yr hwn sydd yn arwain dynion i bob daioni; yr hwn ni chreda fy ngeiriau i, nis creda minnau, fy mod; a’r hwn nis creda fi, nis creda y Tad yr hwn a’m danfonodd. Canys wele, myfi yw y Tad, myfi yw goleuni, a bywyd, a gwirionedd y byd. Deuwch ataf fi, O chwi Genedloedd, ac mi a ddangosaf i chwi y pethau mwy, y wybodaeth a guddiwyd o herwydd anghrediniaeth. Deuwch ataf, O chwi dŷ Israel, ac fe eglurir i chwi pa bethau eu maint a drysorodd y Tad er eich mwyn, er seiliad y byd; ac ni ddaethant ataoch chwi, o herwydd anghrediniaeth. Wele, pan rwygoch y llèn hono o anghrediniaeth ag sydd yn achosi i chwi aros yn eich sefyllfa enbyd o ddrygioni a chaledwch calon, a dallineb meddwl, yna y caiff y pethau mawrion a rhyfedd ag ydynt wedi eu cuddio er seiliad y byd oddiwrthych chwi; ïe, pan alwoch ar y Tad yn fy enw i, gyda chalon ddrylliog ac ysbryd edifeiriol, yna y cewch wybod fod y Tad wedi cofio y cyfammod a wnaeth â’ch tadau chwi, O dŷ Israel; ac yna y caiff fy nadguddiadau i, y rhai a achosais i gael eu hysgrifenu gan fy ngwas Ioan, gael eu hegluro yn ngolwg yr holl bobl. Cofiwch, pan weloch y pethau hyn, y gwybyddwch fod yr amser wrth law pan yr amlygir hwynt mewn gwirionedd; am hyny, pan dderbynioch y cof-lyfr hwn, gellwch wybod fod gwaith y Tad wedi dechreu ar holl wyneb y tir. Am hyny, edifarhewch chwi holl derfynau y ddaear, a deuwch ataf fi, a chredwch fy efengyl, a bedyddier chwi yn fy enw; canys y neb a gredo, ac a fedyddier, a fydd cadwedig; eithr y neb ni chredo, a gondemnir; ac arwyddion a ganlynant y rhai a gredant yn fy enw. A gwyn fyd yr hwn a geir yn ffyddlawn i’m henw i, yn y dydd diweddaf, canys efe a ddyrchefir i drigo yn y deyrnas a barotowyd iddo ef er seiliad y byd. Ac wele, myfi sydd wedi ei lefaru. Amen."
            },
            "2": {
                "0": "Ac yn awr, myfi, Moroni, a ysgrifenais y geiriau a orchymynwyd i mi, yn ol fy nghof; ac mi a fynegais i chwi y pethau a seliais i fyny; am hyny, na chyffyrddwch â hwynt, i’r dyben o gyfieithu; canys gwaherddir i chwi y peth hwnw, oddieithr y bydd maes o law yn ddoethineb yn Nuw. Ac wele, chwi a ellwch gael y fraint o ddangos y llafnau i’r rhai hyny a gynnorthwyant i ddwyn y gwaith hwn allan; ac i dri y dangosir hwy trwy allu Duw; gan hyny, hwy a wybyddant mewn sicrwydd fod y pethau hyn yn wir. Ac yn ngenau trio o dystion y bydd y pethau hyn yn safadwy; a thystiolaeth tri, a’r gwaith hwn, yn mha un y dangosir allan allu Duw, ac hefyd ei air, o’r hyn y mae’r Tad, a’r Mab, a’r Ysbryd Glân yn dwyn tystiolaeth; a chaiff hyn oll sefyll yn dystiolaeth yn erbyn y byd yn y dydd diweddaf. Ac os dygwydd iddynt edifarhau a dyfod at y Tad yn enw yr Iesu, hwy a dderbynir i deyrnas Dduw. Ac yn awr, os nad oes genyf awdurdod dros y pethau hyn, bernwch chwi, canys chwi a gewch wybod fod genyf awdurdod pan y gwelwch fi, ac y cawn sefyll gerbron Duw yn y dydd diweddaf. Amen."
            },
            "3": {
                "0": "A bu iddo ef genedlu Omer, ac Omer a deyrnasodd yn ei le. Ac Omer a genedlodd Jared; a Jared a genedlodd feibion a merched. A Jared a wrthryfelodd yn erbyn ei dad, ac a ddaeth ac a drigodd yn nhir Heth. A bu iddo hudo llawer o bobl, trwy ei eiriau cyfrwys, hyd nes yr oedd wedi ennill hanner y deyrnas. Ac wedi iddo ennill hanner y deyrnas, efe a roddodd frwydr i’w dad, ac a ddygodd ei dad ymaith i gaethiwed, ac a wnaeth iddo wasanaethu mewn caethiwed. Ac yn awr, yn nyddiau teyrnasiad Omer, yr oedd efe mewn caethiwed hanner ei ddyddiau. A bu iddo genedlu mebion a merched, yn mhlith y rhai yr oedd Esrom a Coriantumr; ac yr oeddynt hwy yn ddigllawn iawn o herwydd gweithrediadau Jared eu brawd, yn gymmaint ag iddynt gyfodi byddin, a rhoddi brwydr i Jared. A u iddynt roddi brwydr iddo yn y nos. A bu wedi iddynt ladd byddin Jared, eu bod ynghylch ei ladd yntau hefyd; ac efe a ymbiliodd â hwynt na laddent ef, ac a addawodd y rhoddai y deyrnas i fyny i’w dad. A bu iddynt ganiatâu iddo ei fywyd. Ac yn awr, Jared a aeth yn drist iawn oblegid colli y deyrnas, canys yr oedd wedi gosod ei galon ar y deyrnas, ac ar ogoniant y byd. Yn awr, merch Jared, gan ei bod yn dra chyfrwys, a chan weled tristwch ei thad, a feddyliodd am ddyfeisio cynllun trwy yr hwn y medrai adferu y deyrnas i’w thad. Yn awr, yr oedd merch Jared yn deg odiaeth. A bu iddi ymddyddan â’i thad, a dywedyd wrtho, Trwy ba beth y mae fy nhad yn cael cymmaint o dristwch? Ai nid yw wedi darllen y cof-lyfr a ddygodd ein tadau yn groes i’r dyfnder mawr? Wele, ai nid oes hanes am y rhai gynt, mai trwy eu cynlluniau dirgel yr ennillent deyrnasoedd a gogoniant mawr? Ac yn awr, gan hyny, danfoned fy nhad am Akish, mab Kimnor; ac wele, yr wyf fi yn deg, ac mi a ddawnsiaf o’i flaen ef, ac mi a’i boddlonaf, fel y chwennycho fi yn wraig; gan hyny, os ewyllysia efe genyt roddi o honot fi yn wraig iddo, yna y dywedi, Mi a’i rhoddaf i ti, os dygi i mi ben fy nhad, y brenin. Ac yn awr, yr oedd Omer yn gyfaill i Akish; am hyny, pan ddanfonodd Jared am Akish, merch Jared a ddawnsiodd o’i flaen ef, nes y boddlonodd ef, yn gymmaint ag iddo ei chwennych hi yn wraig. A bu iddo ddywedyd wrth Jared, Rho hi i mi yn wraig. A Jared a ddywedodd wrtho, Mi a’i rhoddaf i ti, os dygi i mi ben fy nhad, y brenin. A bu i Akish gasglu i mewn i dŷ Jared ei holl berthynasau, a dywedyd wrthynt, A dyngwch chwi i mi y byddwch ffyddlawn i mi yn y peth yr hwn a ddymunaf genych? A bu iddynt oll dyngu wrtho ef, i Dduw y nef, ac hefyd i’r nefoedd, ac hefyd i’r ddaear, ac i’w penau, mai pwy bynag a wyrai oddiwrth y cynnorthwy ag oedd Akish yn ddymuno, a gai golli ei ben; a phwy bynag a ddadguddiai pa beth bynag a wnaeth Akish yn hysbys iddynt, y cyfryw a gai golli ei fywyd. A dygwyddodd mai felly y cytunasant ag Akish. Ac Akish a weinyddodd iddynt y llwon a roddwyd gan y rhai gynt, y rhai hefyd a geisient awdurdod, y rhai a drosglwyddwyd i waered hyd y nod oddiwrth Cain, yr hwn oedd yn llofrudd o’r dechreuad. A hwy a gadwyd i fyny trwy allu y diafol i weinyddu y llwon hyn i’r bobl, er eu cadw hwynt mewn tywyllwch, i gynnorthwyo y cyfryw a geisiant am awdurdod, i gael awdurdod, ac i lofruddio, ac yspeilio, a dywedyd celwydd, a chyflawni pob math o ddrygioni a phuteindra. A merch Jared ddarfu ei osod yn ei galon ef i chwilio allan yr hen bethau hyn; a Jared a’i gosododd yn nghalon Akish; am hyny, Akish a’i gweinyddodd i’w berthynasau a’i gyfeillion, gan eu harwain ymaith trwy addewidion teg i wneuthur pa beth bynag a ewyllysiai efe. A bu iddynt ffurfio cydfwriad dirgelaidd, megys hwynt-hwy gynt; yr hwn gydfwriad yw y mwyaf ffiaidd a drygionus uwchlaw pob peth, yn ngolwg Duw; canys nid yw yr Arglwydd yn gweithio mewn cydfwriadan dirgelaidd, ac nid yw efe yn ewyllysio i ddyn dywallt gwaed, eithr yn mhob peth y gwaharddodd ef, oddiar ddechreuad dyn. Ac yn awr, nid wyf fi, Moroni, yn ysgrifenu dull eu llwon a’u cydfwriadau, canys gwnaethwyd yn adnabyddus i mi eu bod i’w cael yn mhlith pob pobl, ac y maent i’w cael yn mhlith y Lamaniaid, ac y maent wedi achosi dinystr y bobl hyn am ba rai yr wyf yn awr yn llefaru, ac hefyd ddinystr pobl Nephi; a pha genedl bynag a ddaliant i fyny y fath gydfwriadau dirgelaidd, er cael awdurdod ac elw, hyd nes yr ymledaenont trwy y genedl, wele, hwy a ddinystrir, canys ni oddefa yr Arglwydd i waed ei saint, yr hwn a dywelltir ganddynt hwy, waeddi yn wastadol arno ef o’r ddaear am ddialedd arnynt, ac etto ddim yn eu dïal hwynt; am hyny, O chwi Genedloedd, y mae yn ddoethineb yn Nuw fod y pethau hyn yn cael eu dangos i chwi, fel trwy hyny yr edifarhaoch am eich pechodau, ac na adawoch i’r cydfwriadau llofruddiog hyn fyned uwchlaw i chwi, y rhai a gyfodir i fyny er cael awdurdod ac elw, ac i waith, ïe, sef gwaith dinystr ddyfod arnoch; ïe, cleddyf cyfiawnder y Duw tragywyddol a syrthia arnoch, er eich dadymchweliad a’ch dinystr, os goddefwch i’r pethau hyn fod; am hyny, mae yr Arglwydd yn gorchymyn i chwi, pan weloch y pethau hyn yn dyfod i’ch plith, am ddeffroi i deimlad o’ch sefyllfa enbydus, oblegid y cydfwriad dirgelaidd hwn ag a fydd yn eich plith, neu ynte gwae fydd iddo, o achos gwaed y rhai ag ydynt wedi eu lladd; canys hwy a waeddant o’r llwch am ddialedd arno, ac hefyd ar y rhai a’i hadeiladodd i fyny. Canys y mae yn dyfod oddiamgylch fod pwy bynag a’i hadeilado i fyny, yn ceisio dadymchwelyd rhyddid pob tir, cenedl, a gwlad; ac y mae yn dwyn oddiamgylch ddinystr pob pobl, canys y mae wedi ei adeiladu i fyny gan y diafol, yr hwn yw tad pob celwydd; ïe, yr un celwyddog hwnw yr hwn a dwyllodd ein rhieni cyntaf; ïe, yr un celwyddog hwnw yr hwn a achosodd i ddyn gyflawni llofruddiaeth o’r dechreuad; yr hwn sydd wedi caledu calonau dynion, nes y maent wedi llofruddio y prophwydi, a’u llabyddio, a’u bwrw hwynt allan o’r dechreuad. Am hyny, yr wyf fi, Moroni, wedi cael gorchymyn i ysgrifenu y pethau hyn, fel y peidio drygioni, ac fel y delo yr amser pan na chaffo satan awdurdod ar galonau plant dynion, eithr cael o honynt eu perswadio i wneuthur daioni yn wastadol, fel y delont i ffynnon pob cyfiawnder, a bod yn gadwedig."
            },
            "4": {
                "0": "A dygwyddodd i Coriantor drigo mewn caethiwed trwy ei holl ddyddiau. Ac yn nyddiau Coriantor hefyd daeth llawer o brophwydi, ac a brophwydasant am bethau mawrion a rhyfedd, ac a waeddasant edifeirwch wrth y bobl, ac os na edifarhaent, y gweinyddai yr Arglwydd Dduw farn yn eu herbyn hwynt er eu llwyr ddinystr; ac y byddai i’r Arglwydd Dduw ddanfon neu ddwyn allan bobl arall i feddiannu y wlad, trwy ei allu ef, yn ol y dull y dygodd eu tadau hwy. A hwy a wrthodasant holl eiriau y prophwydi, o herwydd eu cymdeithas ddirgel a’u ffieidd-dra drygionus. A bu i Coriantor genedlu Ether, a marw, wedi trigo mewn caethiwed trwy ei holl ddyddiau."
            },
            "5": {
                "0": "A bu i mi weddio ar yr Arglwydd, am iddo roddi grâs i’r Cenedloedd, fel y byddai ganddynt gariad. A bu i’r Arglwydd ddywedyd wrthyf, Os na fydd ganddynt gariad. A bu i’r Arglwydd ddywedyd wrthyf, Os na fydd ganddynt gariad, nid yw wahaniaeth i ti, tydi a fuost ffyddlawn; am hyny, dy wisgoedd di a lanheir. Ac oblegid i ti weled dy wendid, ti a wneir yn gryf, hyd at gael eistedd i lawr yn y lle a barotoais i yn nhrigfanau fy Nhad. Ac yn awr, yr wyf fi, Moroni, yn rhoi ffarwel i’r Cenedloedd, ïe, ac hefyd i’m brodyr y rhai wyf yn garu, hyd nes y cyfarfyddom gerbron brawdle Crist, lle y caiff pawb wybod nad yw fy ngwisgoedd wedi eu llychwino â’ch gwaed chwi; ac yna y cewch wybod fy mod i wedi gweled yr Iesu, a’i fod wedi ymddyddan â mi wyneb yn wyneb, ac iddo fynegi wrthyf mewn gostyngeiddrwydd syml, megys y mynega dyn i arall yn fy iaith i fy hun, ynghylch y pethau hyn; ac ychydig yn unig a ysgrifenais, oblegid fy ngwendid mewn ysgrifen. Ac yn awr, mi a’ch cymmeradwywn chwi i geisio yr Iesu hwn, am yr hwn yr ysgrifenodd y prophwydi a’r apostolion, fei y byddo i râs Duw y Tad, ac hefyd yr Arglwydd iesu Grist, a’r Ysbryd Glân, yr hwn a ddwg dystiolaeth am danynt, aros a thrigo gyda chwi yn dragywydd. Amen."
            },
            "6": {
                "0": "A bu i Coriantumr drachefn ysgrifenu epistol at Shiz, i ddymuno arno na ddeuai drachefn i frwydr, eithr am iddo gymmeryd y deyrnas, ac arbed bywydau y bobl. Eithr, wele, yr oedd ysbryd yr Arglwydd wedi darfod amryson â hwynt, ac yr oedd satan wedi cael cyflawn awdurdod ar galonau y bobl, canys yr oeddynt wedi ymroddi i fyny i galedwch eu calonau, a dallineb eu meddyliau, fel y dyfethid hwynt; am hyny, hwy a aethant drachefn i ryfel. A bu iddynt ymladd yr holl ddiwrnod hwnw, a phan ddaeth y nos hwy a gysgent ar eu cleddyfau; a thranoeth hwy a ymladdent hyd nes yr aeth yn nos; a phan yr aeth yn nos, yr oeddynt yn feddw gan lidiawgrwydd, megys y mae dyn yn feddw gan win; a hwy a gysgent drachefn ar eu cleddyfau; a thranoeth ymladdent drachefn; a phan yr aeth yn nos, yr oeddynt oll wedi syrthio trwy y cleddyf, oddieithr deuddeg a deugain o bobl Coriantumr, a thrugain a naw o bobl Shiz. A bu iddynt gysgu ar eu cleddyfau y noson hono, a thranoeth ymladdasant drachefn, ac a ymdrechasant â’u holl nerth â’u cleddyfau, ac â’u tarianau, yr holl ddiwrnod hwnw; a phan yr aeth yn nos, yr oedd deuddeg ar hugain o bobl Shiz, a saith ar hugain o bobl Coriantumr. A bu iddynt fwyta a chysgu, ac ymbarotoi i farw dranoeth. Ac yr oeddynt hwy yn ddynion mawrion a nerthol, o ran nerth dynion. A bu iddynt ymladd am yspaid tair awr, a hwy a lewygasant oblegid colli gwaed. A dygwyddodd ar ol i wyr Coriantumr dderbyn digon o nerth, fel y gallent rodio, eu bod ynghylch ffoi am eu bywydau, eithr wele, eyfododd Shiz, a’i wyr hefyd, ac efe a dyngodd yn ei lid y lladdai Coriantumr, neu ynte y trengai ef trwy y cleddyf; gan hyny, efe a’u hymlidiodd hwynt, a thranoeth goddiweddodd hwynt; a hwy a ymladdasant drachefn â’r cleddyf. A bu ar ol iddynt oll syrthio trwy y cleddyf, oddieithr Coriantumr a Shiz, wele, yr oedd Shiz wedi llewygu oblegid colli gwaed. A bu ar ol i Coriantumr bwyso ar ei gleddyf, fel y gorphwysodd ychydig, iddo dori ymaith ben Shiz. A dygwyddodd ar ol iddo dori ymaith ben Shiz, i Shiz gyfodi ar ei ddwylaw a syrthio; ac ar ol iddo ymdrechu am ei anadl, efe a fu farw. A bu i Coriantumr syrthio ar y ddaear, a myned fel pe na fyddai bywyd ynddo. A’r Arglwydd a lefarodd wrth Ether, ac a ddywedodd wrtho, Dos allan. Ac efe a aeth allan, ac a welodd fod geiriau yr Arglwydd wedi cael eu cyflawni oll; ac efe a orphenodd ei gof-lyfr (ac nid wyf fi wedi ysgrifenu y ganfed ran), ac efe a’i cuddiodd mewn modd fel y cafodd pobl Limhi afael ynddo. Yn awr, y geiriau olaf a ysgrifenwyd gan Ether yw y rhai hyn:—Pa un a ewyllysia yr Arglwydd fy nghymmeryd, neu fod i mi ddyoddef ewyllys yr Arglwydd yn y cnawd, nid yw wahaniaeth, os bydd i mi fod yn gadwedig yn nheyrnas Dduw. Amen."
            },
            "7": {},
            "8": {},
            "9": {},
            "10": {},
            "11": {},
            "12": {},
            "13": {},
            "14": {},
            "15": {}
        }
    },
    "moro": {
        "meta": {
            "slug": "moro",
            "name": "Llyfr Moroni",
            "chapterWord": "Pennod Ⅰ."
        },
        "chapters": {
            "1": {
                "0": "Yn awr, yr oeddwn i, Moroni, ar ol gorphen talfyru hanes pobl Jared, wedi meddwl na ysgrifenwn ychwaneg, eithr nid wyf hyd yn hyn wedi trengu; ac nid wyf yn gwneuthur fy hun yn adnabyddus i’r Lamaniaid, rhag iddynt fy nyfeetha. Canys, wele, mae eu rhyfeloedd yn dra gerwin yn eu mysg eu hunain; ac o herwydd eu casineb, gosodant i farwolaeth bob Nephiad na wado y Crist. A myfi, Moroni, nis gwadaf y Crist; am hyny, yr wyf fi yn crwydro pa le bynag y gallaf, er mwyn diogelwch fy mywyd fy hun. Gan hyny, yr wyf yn ysgrifenu ychydig o bethau yn ychwaneg, yn groes fel ag yr oeddwn wedi meddwl; canys yr oeddwn wedi meddwl na ysgrifenwn ddim ychwaneg; eithr yr wyf yn ysgrifenu ychydig o bethau yn ychwaneg, fel y byddont ysgatfydd o werth i’m brodyr, y Lamaniaid, mewn rhyw ddydd dyfodol, yn ol ewyllys yr Arglwydd."
            },
            "2": {
                "0": "Geiriau Crist, y rhai a lefarodd wrth ei ddyseyblion, y deuddeg y rhai a ddewisodd, pan yr oedd yn gosod ei ddwylaw arnynt. Ac efe a’u galwodd hwynt wrth eu henw, an ddywedyd, Chwi a gewch alw ar y Tad yn fy enw i, mewn gweddi nerthol; ac ar ol i chwi wneuthur hyn, chwi a gewch awdurdod fel ar y sawl y gosodoch eich dwylaw, y cewch roddi yr Ysbryd Glân; ac yn fy enw i y cewch ei roddi, canys felly y gwna fy apostolion i. Yn awr, y geiriau hyn a lefarodd Crist wrthynt yn amser ei ymddangosiad cyntaf; ac nis clywodd y dyrfa ef, eithr y dyscyblion a’i clywsant; ac ar gynnifer ag y gosodasant hwy eu dwylaw, y syrthiodd yr Ysbryd Glân."
            },
            "3": {
                "0": "Y modd ag yr oedd y dyscyblion, y rhai a elwid henuriaid yr eglwys, yn ordeinio offeiriaid a dysgawdwyr. Ar ol iddynt weddio ar y Tad yn enw Crist, hwy a osodent eu dwylaw arnynt, ac a ddywedent,—Yn enw Iesu Grist yr wyf fi yn dy ordeinio di yn offeiriad, neu (os mai dysgawdwr fydd), yr wyf fi yn dy ordeinio di yn ddysgawdwr, i bregethu edifeirwch a maddeuant pechodau trwy Iesu Grist, trwy barhad ffydd yn ei enw hyd y diwedd. Amen. Ac yn y modd hyn yr ordeinient hwy offeiriaid a dysgawdwyr, yn ol doniau a galwedigaethau Duw tuag at ddynion; a hwy a’u hordeinient trwy allu yr Ysbryd Glân, yr hwn oedd ynddynt."
            },
            "4": {
                "0": "Trefn eu henuriaid a’u hoffeiriaid yn gweinyddu cnawd a gwaed Crist i’r eglwys. A hwy a’u gweinyddent yn ol gorchymynion Crist; am hyny, ni a wyddom fod y drefn yn gywir; a’r henuriad neu yr offeiriad oedd yn ei weinyddu. A hwy a ymostyngent ar eu gliniau gyda’r eglwys, ac a weddient ar y Tad yn enw Crist, gan ddywedyd,—O Dduw, y Tad tragywyddol, yr ydym yn deisyf arnat yn enw dy Fab, Iesu Grist, i fendithio a santeiddio y bara hwn i eneidiau pawb a gyfranogont o hono, fel y byddo iddynt ei fwyta mewn coffadwriaeth am gorff dy Fab, a thystio wrthyt ti, O Dduw, y Tad tragywyddol, eu bod yn ewyllysgar i gymmeryd arnynt enw dy Fab, a chofio am dano a chadw ei orchymynion a roddodd efe iddynt, fel y byddo iddynt yn wastad gael ei ysbryd ef i fod gyda hwynt. Amen."
            },
            "5": {
                "0": "Y drefn i weinyddu y gwin. Wele, hwy a gymmerent y cwpan, ac a ddywedent,—O Dduw, y Tad tragywyddol, yr ydym yn deisyf arnat yn enw dy Fab, Iesu Grist, i fendithio a santeiddio y gwin hwn i eneidiau pawb a yfant o hono, fel y byddo iddynt ei wneuthur mewn coffadwriaeth am waed dy Fab, yr hwn a dywalltwyd drostynt hwy; fel y byddo iddynt dystiolaethu i ti, O Dduw, y Tad tragywyddol, eu bod yn wastad yn ei gofio ef, a chael ei ysbryd i fod gyda hwynt. Amen."
            },
            "6": {
                "0": "Ac yn awr, yr wyf yn llefaru ynghylch bedydd. Wele, yr oedd henuriaid, offeiriaid, a dysgawdwyr yn cael eu bedyddio; ac nid oeddynt yn cael eu bedyddio, oni ddygent allan ffrwyth addas eu bod yn deilwng o hono; ac ni dderbynient neb i fedydd, oni ddeuent allan gyda chalon ddrylliog ac ysbryd edfeiriol, a thystiolaethu wrth yr eglwys eu bod yn gwir edifarhau am eu holl bechodau. Ac ni dderbynid neb i fedydd, oni chymmerent arnynt enw Crist, gan fod yn benderfynol i’w wasanaethu ef hyd y diwedd. Ac ar ol iddynt gael eu derbyn i fedydd, a’u cyfnewid a’u glanhau trwy allu yr Ysbryd Glân, hwy a gyfrifid yn mhlith pobl eglwys Crist, a chymmerid eu henwau, fel y cofid ac y meithrinid hwynt trwy air Duw, i’w cadw hwynt yn y ffordd uniawn, gan eu cadw yn wastadol yn wyliadwrus i weddio, gan ymddiried yn unig ar haeddiant Crist, yr hwn oedd awdwr a pherffeithydd eu ffydd. Ac yr oedd yr eglwys yn ymgyfarfod yn fynych, i ymprydio a gweddio, ac i ymddyddan â’r naill y llall ynghylch lleshad eu heneidiau; a hwy a ymgyfarfyddent yn fynych i gyfranogi o fara a gwin, er cof am yr Arglwydd Iesu; ac yr oeddynt yn fanwl i edrych na fyddai dim anwiredd yn eu plith; a phwy bynag a geffid yn gweithredu anwiredd, a thri tyst o’r eglwys yn eu condemnio hwy gerbron yr henuriaid, os na edifarhaent a chyffesu, eu henwau a gaent eu dileu, ac ni chyfrifid hwynt yn mhlith pobl Crist; eithr can fynyched ag yr edifarhaent, a cheisio maddeuant, gyda gwir fwriad, hwy a faddeuid. Ac yr oedd eu cyfarfodydd yn cael eu llywodraethu gan yr eglwys, yn ol trefn gweithrediadau yr ysbryd, a thrwy allu yr Ysbryd Glân; canys megys ag yr oedd gallu yr Ysbryd Glân yn eu harwain hwynt pa un ai i bregethu, neu gynghori, neu weddio, neu ddeisyf, neu ganu, felly yr oedd yn cael ei wneuthur."
            },
            "7": {
                "0": "Ac yn awr, fy anwyl frodyr, os yw yn dygwydd fod y pethau hyn yn wir, y rhai a lefarais wrthych, a Duw a ddengys i chwi gyda gallu a gogoniant mawr yn y dydd diweddaf, eu bod yn wir; ac os ydynt yn wir, a ydyw dydd y gwyrthiau wedi darfod; neu a yw angylion wedi peidio ymddangos i blant dynion?—neu a yw efe wedi cadw gallu yr Ysbryd Glân oddiwrthynt? Neu a wna efe hyny, cyhyd ag y parhao amser, neu y safo y ddaear, neu y byddo un dyn ar ei gwyneb i gael ei achub? Wele, yr wyf yn dywedyd wrthych, na wna, canys trwy ffydd y cyflawnir gwyrthiau; a thrwy ffydd y mae angylion yn ym ddangos ac yn gweinyddu i ddynion; am hyny, os yw y pethau hyn wedi darfod, gwae blant dynion, canys yr achos yw anghrediniaeth, ac y mae’r cyfan yn ofer; canys ni all neb gael ei achub, yn ol geiriau Crist, oddieithr fod ganddynt ffydd yn ei enw; am hyny, os yw y pethau hyn wedi darfod, yna y mae ffydd wedi darfod hefyd; ac y mae sefyllfa dyn yn ofnadwy; canys y mae megys pe na byddai prynedigaeth wedi ei gwneuthur. Eithr wele, fy anwyl frodyr, yr wyf yn barnu pethau gwell am danoch chwi, canys yr wyf yn barnu fod ffydd genych chwi yn Nghrist, oblegid eich llarieidd-dra: canys os nad oes ffydd genych chwi ynddo, yna nid ydych yn addas i gael eich cyfrif fynwn lefaru wrthych ynghylch gobaith. Pa fodd y gellwch gyrhaeddyd ffydd, oddieithr fod genych obaith? A pha beth a obeithiwch am dano? Wele, yr wyf yn dywedyd wrthych, y bydd i chwi gael gobaith trwy iawn Crist a gallu ei adgyfodiad, i gael eich hadgyfodi i fywyd tragywyddol; a hyn oblegid eich ffydd ynddo ef yn ol yr addewid; am hyny, os bydd gan ddyn ffydd, anghenrhaid yw fod ganddo obaith; canys heb ffydd nis gall fod dim gobaith. A thrachefn, yr wyf yn dywedyd wrthych, nas gall ef gael ffydd a gobaith, oddieithr ei fod yn addfwyn a gostyngedig o galon; pe amgen, byddai ei ffydd a’i obaith yn ofer, canys nid oes neb yn gymmeradwy gerbron Duw, oddieithr yr addfwyn a’r gostyngedig o galon; ac os bydd dyn yn addfwyn a gostyngedig o galon; ac yn cyffesu trwy allu yr Ysbryd Glân, mai Iesu yw y Crist, mae yn anghenrhaid fod ganddo gariad; canys os na fydd ganddo gariad, nid yw ddim; am hyny, mae yn anghenrhaid fod ganddo gariad. Ac y mae cariad yn hir-ymaros, ac yn gymmwynasgar, ac nid yw yn cenfigenu, ac nid yw yn ymchwyddo, nac yn ceisio yr eiddo ei hun, ni chythruddir, ni feddwl ddrwg, ac nid yw lawen am anghyfiawnder, eithr yn cydlawenhau â’r gwirionedd; y mae yn dyoddef pob dim, yn credu pob dim, yn gobeithio pob dim, ac yn ymaros â phob diim: am hyny, fy anwyl frodyr, os nad oes genych gariad nid ydych ddim, canys cariad byth ni chwymp ymaith. Am hyny, glynwch wrth gariad, yr hwn yw y mwyaf o’r cyfan, canys pob peth arall a ddarfyddant; eithr cariad sydd eiddo Crist, ac y mae yun parhau byth; a phwy bynag a geir yn feddiannol arno yn y dydd diweddaf, a fydd yn dda arnynt. Am hyny, fy anwyl frodyr, gweddiwch ar y Tad gyda holl egni calon, fel y llanwer chwi â’r cariad hwn ag a roddodd efe i bawb ag ydynt yn wir ganlynwyr ei Fab, Iesu Grist, fel y deuoch yn feibion i Dduw, fel pan ymddangoso efe, y byddom debyg iddo; canys ni a gawn ei weled ef megys ag y mae, fel y meddom y gobaith hwn, y purir ni, megys y mae yntau yn bur. Amen."
            },
            "8": {
                "0": "Ac yn awr, fy mab, yr wyf yn llefaru wrthyt ynghylch yr hyn ag sydd yn fy mlino i yn fawr; canys y mae yn flin genyf fod dadleuon yn cyfodi yn eich plith. Canys os wyf fi wedi clywed y gwirionedd, y mae dadleuon wedi bod yn eich plith chwi ynghylch bedyddio eich plant bychain. Ac yn awr, fy mab, mi a fynwn i ti lafurio yn ddyfal, fel y symuder y cyfeiliornad gwrthun hwn o’ch plith; canys i’r dyben yma yr ysgrifenais yr epistol hwn. Canys yn uniongyrchol wedi i mi glywed y pethau hyn gyda thi, mi a ymofynais â’r Arglwydd ynghylch y mater. A gair yr Arglwydd a ddaeth ataf trwy allu yr Ysbryd Glân, gan ddywedyd, Gwrandaw ar eirlau Crist, dy Waredwr, dy Arglwydd, a’th Dduw. Wele, ni ddaethym i i’r byd i alw y rhai cyfiawn, eithr pechaduriaid i edifeirwch; ni raid i’r rhai iach wrth feddyg, ond i’r rhai cleifion; am hyny, y mae plant bychain yn iach, canys nid ydynt yn abl i gyflawni pechod; o ganlyniad, melldith Adda a gymmerwyd oddiwrthynt ynof fi, fel nad oes ganddi awdurdod arnynt; ac y mae cyfraith yr enwaediad wedi ei diddymu ynof fi. Ac yn y modd hyn yr eglurodd yr Ysbryd Glân air Duw i mi; am hyny, fy anwyi fab, mi a wn mai gwawd ofnadwy gerbron Duw, yw i chwi fedyddio plant bychain. Wele, yr wyf yn dywedyd wrthych, y peth hyn a ddysgwch chwi, edifeirwch a bedydd i’r rhai hyny ag ydynt yn gyfrifol ac yn alluog i gyflawni pechod; ïe, dysgwch rieni fod yn rhaid iddynt edifarhau a chael eu bedyddio, ac ymostwng megys eu plant bychain, a hwy a achubir oll gyda’u plant bychain; ac nid oes ar eu plant bychain eisieu edifeirwch, na bedydd. Wele, bedydd sydd i edifeirwch i gyflawniad y gorchymynion er maddeuant pechodau. Eithr y mae plant bychain yn fyw yn Nghrist, ïe, er seiliad y byd; pe nid felly, buasai Duw yn Dduw pleidiol, ac hefyd yn Dduw cyfnewidiol, ac yn dderbyniwr wyneb; canys pa gynnifer o blant bychain sydd wedi marw heb fedydd. Am hyny, os na allai plant bychain gael eu hachub heb fedydd, mae yn rhaid eu bod wedi myned i uffern ddiddarfod. Wele, meddaf wrthych, mae yr hwn sydd yn tybied fod ar blant bychain eisieu bedydd, mewn bustl chwerwder, ac mewn rhwymau anwiredd; canys nid oes ganddo ffydd, gobaith, na chariad; am hyny, pe cai efe ei dori ymaith tra yn meddwl hyny, rhaid fuasai ei fyned i lawr i uffern. Canys erchyll yw y drygioni o feddwl fod Duw yn achub un plentyn o herwydd bedydd, a bod rhaid i’r llall drengu o herwydd na chafodd fedydd. Gwae y sawl a wyrdroant ffyrdd yr Arglwydd yn y modd hyn, canys hwy a gânt drengu, os na edifarhant. Wele, yr wyf fi yn llefru gydag eofndra, gan fod genyf awdurdod oddiwrth Dduw; ac nid wyf yn ofni pa beth a wnel dyn; canys y mae perffaith gariad yn bwrw allan bob ofn; ac yr wyf fi wedi fy llenwi o gariad, yr hwn sydd gariad tragywyddol; am hyny, y mae pob plant yn gyffelyb i mi; o ganlyniad yr wyf fi yn caru plant bychain â chariad perffaith; ac y maent hwy oll yn gyffelyb, ac yn gyfranogion o iachawdwriaeth. Canys mi a wn nad yw Duw yn Dduw pleidiol, nac ychwaith yn fôd cyfnewidiol; eithr y mae efe yn anghyfnewidiol o bob tragywyddoldeb i bob tragywyddoldeb. Nis gall plant bychain edifarhau; am hyny, y mae yn ddrygioni erchyll i wadu pur drugareddau Duw tuag atynt, canys y maent oll yn fyw ynddo ef o herwydd ei drugaredd. A’r hwn a ddywed fod ar blant bychain anghen bedydd, sydd yn gwadu trugareddau Crist, ac yn dirmygu ei iawn ef a gallu ei achubiaeth. Gwae y cyfryw, canys y maent yn euog o farwolaeth, uffern, a phoenedigaeth ddiddiwedd. Yr wyf yn ei lefaru yn eofn, y mae Duw wedi gorchymyn i mi. Gwrandewch arnynt ac ystyriwch, neu ynte hwy a safant yn eich erbyn chwi wrth orseddfainc Crist. Canys wele, y mae pob plant bychain yn fyw yn Nghrist, ac hefyd yr holl rai ag ydynt heb y gyfraith. Canys y mae gallu y brynedigaeth yn dyfod ar yr holl rai nad oes ganddynt gyfraith; am hyny, yr hwn na chondemniwyd, neu yr hwn nad yw dan gondemniad, nis gall edifarhau; ac i’r cyfryw nid yw bedydd yn lleshau dim. Eithr y mae yn watwar gerbron Duw, yn gwadu trugareddau Crist, a gallu ei ysbryd santaidd, ac yn gosod ymddiried mewn gweithredoedd meirwon. Wele, fy mab, ni ddylai y peth hyn fod; canys edifeirwch sydd iddynt hwy ag ydynt dan gondemniad a than felldith cyfraith doredig. A ffrwythau cyntaf edifeirwch yw bedydd; ac y mae bedydd yn dyfod trwy ffydd, hyd at gyflawni y gorchymynion; ac y mae cyflawni y gorchymynion yn dwyn maddeuant pechodau; ac y mae maddeuant pechodau yn dwyn addfwynder, a gostyngeiddrwydd calon, ac o herwydd addfwynder a gostyngeiddrwydd calon, y mae yn dyfod ymweliad yr Ysbryd Glân, yr hwn ddyddanydd sydd yn llenwi o obaith a pherffaith gariad, yr hwn gariad sydd yn parhau trwy ddyfalwch mewn gweddi, hyd nes delo y diwedd, pan y caiff yr holl saint drigo gyda Duw. Wele, fy mab, mi a ysgrifenaf atat drachefn, os nad âf allan yn fuan yn erbyn y Lamaniaid. Wele, y mae balchder y genedl hon, neu bobl y Nephiaid, wedi profi yn ddinystr iddynt, os na edifarhant. Gweddia drostynt, fy mab, fel y delo edifeirwch iddynt. Eithr, wele, yr wyf yn ofni rhag fod yr ysbryd wedi darfod amryson â hwynt; ac yn y rhan hon o’r tir y maent hefyd yn ceisio darostwng pob gallu ac awdurdod, ag sydd yn dyfod oddiwrth Dduw; ac y maent yn gwadu yr Ysbryd Glân. Ac ar ol gwrthod gwybodat gyflawni y prophwydoliaethau y rhai a lefarwyd gan y prophwydi, yn gystal â geiriau yr Iachawdwr ei hun. Ffarwel, fy mab, hyd nes yr ysgrifenaf atat, neu y cyfarfyddaf â thi drachefn. Amen."
            },
            "9": {
                "intro": "Ail Epistol Mormon at ei Fab Moroni.",
                "0": "Ac yn awr, yr wyf yn ysgrifenu rhywfaint ynghylch dyoddefiadau y bobl hyn. Canys yn ol yr hysbysiaeth a dderbyniais oddiwrth Amoron, wele, mae gan y Lamaniaid lawer o garcharorion, y rhai a gymmerasant o dwr Sherrizah; ac yr oedd ganddynt wyr, gwragedd, a phlant. A gwyr priod a thadau y gwragedd a’r plant hyny a laddasant; ac ymborthant y gwragedd â chnawd eu gwyr, a’r plant a chnawd eu tadau, ac ni roddant iddynt ddim dwfr, ond rhyw ychydig. Ac er y ffieidd-dra mawr hwn o eiddo y Lamaniaid, nid yw yn fwy nag eiddo pobl ein hunain yn Moriantum. Oblegid, wele, llawer o ferched y Lamaniaid a gymmerasant hwy yn garcharorion; ac ar ol eu hamddifadu o’r hyn oedd fwyaf anwyl a gwerthfawr uwchlaw pob peth, yr hyn yw diweirdeb a rhinwedd; ac ar ol iddynt wneyd hyny, lladdasant hwynt yn y modd mwyaf creulawn, gan boenydio eu cyrff hyd farw; ac ar ol iddynt wneyd felly, llarpiant eu cnawd fel creaduriaid gwylltion, o herwydd caledwch eu calonau; a gwnant hyny fel arwydd o wroldeb. O, fy anwyl fab, pa fodd y gall pobl fel y rhai hyn, ag sydd heb wareiddiad—(ac ond ychydig flynyddau sydd er pan oeddynt yn bobl foesol ac hyfrydol)—ond, O, fy mab, pa fodd y gall pobl fel hyn, y rhai a ymhyfrydant mewn cymmaint o ffieidd-dra—pa fodd y gallwn ddysgwyl yr ettyl Duw ei law mewn barn yn ein herbyn? Wele, mae fy nghalon yn cyhoeddi gwae uwchben y bobl hyn. Tyred allan mewn barn, O Dduw, a chuddia eu pechodau, a’u drygioni, a’u ffieidd-dra oddiwrth dy wyneb. A thrachefn, fy mab, y mae llawer o wragedd gweddwon a’u merched yn aros yn Sherrizah; a’r gyfran hono o’r lluniaeth na chymmarodd y Lamaniaid ymaith, wele, cymmerwyd hi ymaith gan fyddin Zenephi, ac a’u gadawsant hwythau i grwydro i ba le bynag y gallent am ymborth; ac y mae llawer o hen wragedd yn llewygu ar y ffordd ac yn marw. Ac y mae y fyddin sydd gyda mi yn wan; ac y mae byddinoedd y Lamaniaid rhwng Sherrizah a minnau; ac y mae cynnifer ag sydd wedi ffoi at fyddin Aaron, wedi syrthio yn ysglyfaeth i’w creulondeb erchyll. O lygredigaeth fy mhobl! Y manet heb drefn ac heb drugaredd. Wele, nid wyf fi ond dyn, ac nid oes genyf ond nerth dyn, ac nis gallaf yn hwy ddirgymhell fy nghorchymynion; ac y maent hwythau wedi ymgryfhau yn eu gwyrdrawsedd; ac y maent yr un mor greulawn, heb arbed neb, hen nac ieuanc; ac y maent yn ymhyfrydu yn mhob peth ond yn yr hyn sydd dda; ac y mae dyoddefiadau ein gwragedd a’n plant ar hyd holl wyneb y tir hwn, tu hwnt i bob peth; ïe, nis gall tafod eu traethu, ac nis gellir eu hysgrifenu. Ac yn awr, fy mab, nid wyf yn ymhelaethu yn hwy ar yr olygfa ddychrynllyd hon. Wele, ti a adwaenost ddrygioni y bobl hyn; ti a wyddost eu bod yn ddiegwyddor ac yn ddideimlad; ac y mae eu drygioni yn fwy nag eiddo y Lamaniaid. Wele, fy mab, nis gallaf fi eu gorchymyn hwynt i Dduw, rhag iddo fy nharaw. Eithr wele, fy mab, yr wyf yn dy orchymyn di i Dduw, ac yr wyf yn hyderu yn Nghrist y byddi yn gadwedig; ac yr wyf yn gweddio ar Dduw y bydd iddo arbed dy fywyd, i weled dychweliad ei bobl ato, neu eu llwyr ddinystr; canys mi a wn y rhaid iddynt drengu, oddieithr iddynt edifarhau a dychwelyd ato ef; ac os trengant, cyffelyb fyddant i’r Jarediaid, o herwydd penderfynolrwydd eu calon, yn ymgeisio am waed ac ymddial. Ac os dygwydda y trengant, ni a wyddom fod llawer o’n brodyr wedi ymneillduo at y Lamaniaid, a llawer yn ychwaneg hefyd a ymneillduant atynt etto; am hyny, ysgrifena ryw ychydig o bethau, os arbedir di; a myfi a drengaf ac nis gwelaf di; eithr yr wyf yn hyderu cael dy weled yn fuan; canys y mae genyf gof-lyfrau cyssegredig ag wyf yn ewyllysio eu cyflwyno i ti. Fy mab, bydd ffyddlawn yn Nghrist; ac na fydded i’r pethau a ysgrifenais dy ofidio, a’th orlwytho i farwolaeth, eithr dyrchafed Crist ti i fyny, a bydded i’w ddyoddefiadau a’i farwolaeth ef, ac ymddangosiad ei gorff i’n tadau, a’i drugaredd a’i hir-ymaros, a gobaith ei ogoniant, a bywyd tragywydddol, aros yn dy feddwi yn dragywydd. A boed i râs Duw y Tad, yr hwn sydd â’i orsedd yn ddyrchafedig yn y nefoedd, a’n Harglwydd Iesu Grist, yr hwn sydd yn eistedd ar ddeheulaw ei allu, hyd nes y darostynger pob peth iddo, drigo a bod gyda chwi yn dragywydd. Amen."
            },
            "10": {
                "0": "Yn awr, yr wyf fi, Moroni, yn ysgrifenu rhyw gymmaint megys y gwelwyf yn dda yn fy ngolwg; ac yr wyf yn ysgrifenu at fy mrodyr, y Lamaniaid; ac mi a fynwn iddynt wybod fod mwy nâ phedwar cant ac ugain o flynyddau wedi myned heibio oddiar yr arwydd a roddwyd o ddyfodiad Crist. Ac yr wyf fi yn selio i fyny y cof-ysgrifau hyn, ar ol i mi ysgrifenu ychydig o eiriau mewn ffordd o gynghor i chwi. Wele, mi a’ch cynghorwn chwi, pan fydd i chwi ddarllen y pethau hyn, os bydd yn ddoethineb yn Nuw fod i chwi eu darllen, ar gofio o honoch pa mor drugarog y bu yr Arglwydd tuag at blant dynion, er creadigaeth Adda, i lawr hyd yr amser y cewch dderbyn y pethau hyn, a dwys-ystyried hyny yn eich calonau. A phan Dduw, y Tad tragywyddol, yn enw Crist, os nad yw y pethau hyn yn wir; ac os gydd i chwi ofyn gyda chalon gywir, mewn gwir fwriad, gan feddu ffydd yn Nghrist, efe a eglura y gwirionedd o honynt i chwi, trwy allu yr Ysbryd Glân; a thrwy allu yr Ysbryd Glân chwi a ellwch wybod gwirionedd pob peth. Ac y mae pa beth bynag ag sydd yn dda, yn gyfiawn a chywir; am hyny, nid oes dim ag sydd yn dda yn gwadu y Crist, eithr yn cydnabod ei fod. A chwi a ellwch wybod ei fod, trwy allu yr Ysbryd Glân; am hyny, mi a’ch cynghorwn chwi, na wadoch allu Duw; canys y mae efe yn gweithredu trwy allu, yn ol ffydd plant dynion, yr un fath heddyw, ac y fory, ac yn dragywydd. A thrachefn, mi a’ch cynghorwn chwi, fy mrodyr, na wadoch ddoniau Duw, canys y maent yn llawer; ac y maent yn deillio oddiwrth yr un Duw. Ac y mae y doniau hyn yn cael eu cyfranu mewn gwahanol ffyrdd; eithr yr un yw Duw, yr hwn sydd yn gweithredu pob peth yn mhawb; a hwy a roddir trwy eglurhad ysbryd Duw i ddynion, er eu lleshad. Canys wele, i un, trwy ysbryd Duw, y rhoddir i ddysgu ymadrodd doethineb; ac i arall, i ddysgu ymadrodd gwybodaeth, trwy yr un ysbryd; ac i arall ddirfawr ffydd; ac i arall ddoniau iachâu, trwy yr un ysbryd. A thrachefn, i arall, fel y cyflawno wyrthiau nerthol; a thrachefn, i arall, fel y prophwydo ynghylch pob peth; a thrachefn, i arall, i weled angylion ac ysbrydion gwasanaethgar; a thrachefn, i arall, pob math o dafodau; a thrachefn, i arall, gyfieithad ieithoedd ac amryw dafodau. Ac y mae yr holl roddion hyn yn dyfod trwy ysbryd Crist; ac y maent yn dyfod i bob dyn ar wahan, megys y mae yn ewyllysio. Ac mi a’ch annogwn chwi, fy anwyl frodyr, i gofio fod pob rhodd dda yn dyfod oddiwrth Grist. Ac mi a’ch annogwn chwi, fy anwyl frodyr, i gofio mai yr un yw efe ddoe, heddyw, ac yn dragywydd, ac na fydd ir holl ddoniau hyn y llefarais am danynt, y rhai ydynt ysbrydol, byth gael eu dileu, ïe, cyhyd ag y safo y byd, ond yn ol anghrediniaeth plant dynion. Am hyny, y mae yn rhaid fod ffydd; ac os rhaid fod ffydd, mae yn rhaid hefyd fod gobaith; ac os rhaid fod gobaith, mae yn rhaid hefyd fod cariad; ac oni fydd genych gariad, nis gellwch mewn un modd gael eich achub yn nheyrnas Dduw; ac nis gellwch mewn un modd gael eich achub yn nheyrnas Dduw, oni fydd genych ffydd; ac nis gellwch ychwaith, oni fydd genych obaith; ac os nad oes genych obaith, anghenrhaid yw eich bod mewn anobaith; ac y mae anobaith yn dyfod o herwydd anwiredd. A Christ yn ddiau a ddywedodd wrth ein tadau, Os bydd genych ffydd, chwi a ellwch wneuthur pob peth ag sydd yn fuddiol i mi. Ac yn awr, yr wyf yn llefaru wrth holl derfynau y ddaear, os daw y dydd y dileir gallu a doniau Duw o’ch mysg, o achos anghrediniaeth y bydd. A gwae fydd i blant dynion, os mai felly y bydd; canys ni fydd neb ag sydd yn gwneuthur daioni yn eich mysg, na fydd un. Oblegid os bydd un yn eich mysg yn gwneuthur daioni, efe a weithreda trwy allu a doniau Duw. A gwae y rhai a ddilëant y pethau hyn ac a fyddant farw, canys byddant farw yn eu pechodau, ac nis gellir eu hachub yn nheyrnas Dduw; ac yr wyf yn llefaru hyn yn ol geiriau Crist, ac nid wyf yn dywedyd celwydd. Ac yr wyf yn eich annog i gofio y pethau hyn; canys y mae’r amser yn dyfod ar fyrder y cewch wybod nad wyf fi yn dywedyd celwydd, oblegid chwi a’m gwelwch wrth frawdle Duw, a’r Arglwydd Dduw a ddywed wrthych chwi, Ai ni thraethais i fy ngeiriau wrthych, y rhai a ysgrifenwyd gan y dyn hwn, megys un yn gwaeddi o blith y meriw? ïe, megys un yn llefaru allan o’r llwch? Yr wyf yn traethu y pethau hyn er cyflawni y prophwydoliaethau. Ac wele hwy a ddeuant allan o enau y Duw tragywyddol; a’i air ef a chwibana allan o genedlaeth i genedlaeth. A Duw a ddengys i chwi fod yr hyn a ysgrifenais i yn wirionedd. A thrachefn mi a’ch annogwn chwi i ddyfod at Grist, a dal gafael yn mhob rhodd dda, a pheidio cyffwrdd â’r rhodd ddrwg, na’r peth aflan. A deffro, a chyfod o’r llwch, O Jerusalem; ïe, a gwisg wisgoedddy ogoniant, O ferch Seion, a sicrha dy estynfeydd, ac helaetha dy gyffiniau yn dragywydd, fel na chywilyddier di mwyach, fel y cyflawner cyfammodau y Tad tragywyddol y rhai a wnaeth efe â thi, O dŷ Israel. Ië, deuwch at Grist, a pherffeithier chwi ynddo, ac ymwadwch â phob annuwioldeb; ac os ymwadwch â phob annuwioldeb, a charu Duw â’ch holl allu, meddwl, a nerth, yna digon fydd ei râs ef i chwi, fel trwy ei râs ef y byddwch berffaith yn Nghrist; ac os trwy râs Duw y byddwch berffaith yn Nghrist, nis gellwch mewn un modd wadu gallu Duw. A thrachefn, os byddwch, trwy râs Duw yn berffaith yn Nghrist, ac heb wadu ei allu, yna yr ydych wedi eich santeiddio yn Nghrist trwy râs Duw, trwy dywalltiad gwaed Crist, yr hwn sydd yn nghyfammod y Tad, er maddeuant eich pechodau, fel y byddoch santaidd a difrycheulyd. Ac yn awr yr wyf yn rhoddi ffarwel i chwi oll. Yr wyf yn myned ar fyr i orphwys yn mharadwys Duw, hyd nes yr ail-unir fy ysbryd a’m corff drachefn, ac y dygir minnau allan yn fuddugoliaethus trwy yr awyr, i gyfarfod â chwi gerbron brawdle ddymunol y Jehofah mawr, barnwr tragywyddol y byw a’r meirw. Amen."
            }
        }
    }
}